#Использовать "./internal"

Перем ШаблонМодуля;
Перем ШаблонМетода;

Процедура ПриСозданииОбъекта(Знач ДанныеПроекта_ = Неопределено)
    
    Если ДанныеПроекта_ = Неопределено Тогда
        ДанныеПроекта = Новый ProjectData;
    Иначе
		ДанныеПроекта = ДанныеПроекта_;
	КонецЕсли;
	
	CommonTools.СообщитьПроцесс("Generating SBSL adapter");
	
	Корень = ДанныеПроекта.ПолучитьЗначениеНастройки("paths.root");
	Языки  = ДанныеПроекта.ПолучитьЗначениеНастройки("localization.langs");
	
	Шаблоны      = ДанныеПроекта.ПолучитьЗначениеНастройки("sbsl.templates");
	ШаблонМодуля = ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(Шаблоны + "sbsl_module.txt"));
	ШаблонМетода = ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(Шаблоны + "sbsl_method.txt"));

	Для Каждого Язык Из Языки Цикл
		
		КаталогИндекса = Корень + Язык + "/cli/data/Classes/index";
		ФайлыИндексов  = НайтиФайлы(КаталогИндекса, "*.json");
		
		КаталогМодулей = ДанныеПроекта.ПолучитьЗначениеНастройкиЛокализации("sbslModules", Язык);
		
		УдалитьФайлы(КаталогМодулей, "*.sbsl");
		
		Для Каждого ФайлИндекса Из ФайлыИндексов Цикл
			СгенерироватьSbsl(ФайлИндекса.ПолноеИмя, ФайлИндекса.ИмяБезРасширения, КаталогМодулей);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СгенерироватьSbsl(Знач ПутьИндекса, Знач Команда, Знач КаталогМодулей)
	
	Данные = CommonTools.ПрочитатьФайлJSON(ПутьИндекса);
	
	ИмяМодуля = Данные["module"];
	ПутьSbsl  = КаталогМодулей + СтрШаблон("%1.sbsl", ИмяМодуля);

	МассивМетодов = СформироватьМассивМетодов(Данные);
	
	ТекстМодуля = СтрШаблон(ШаблонМодуля
		, ИмяМодуля
		, Команда
		, СтрСоединить(МассивМетодов, Символы.ПС + Символы.ПС));

	ПолучитьДвоичныеДанныеИзСтроки(ТекстМодуля).Записать(ПутьSbsl);

КонецПроцедуры

Функция СформироватьМассивМетодов(Знач Данные)
	
	МассивМетодов = Новый Массив;
	
	ВозвращаемоеЗначение = "Объект?";
	
	Для Каждого Метод Из Данные["methods"] Цикл

		СписокПараметров = Новый Массив;
		СписокОпций = Новый Массив;
			
		Для Каждого Параметр Из Метод["params"] Цикл
			
			СписокПараметров.Добавить(СтрШаблон("%1: Объект?", Параметр["title"]));
			СписокОпций.Добавить(СтрШаблон("    Опции.Вставить(""%1"", %2)", Параметр["short"], Параметр["title"]));

		КонецЦикла;
		
		ТекстМетода = СтрШаблон(ШаблонМетода
			, Метод["name"]
			, СтрСоединить(СписокПараметров, ", ")
			, ВозвращаемоеЗначение
			, СтрСоединить(СписокОпций, Символы.ПС));
		
		МассивМетодов.Добавить(ТекстМетода);

	КонецЦикла;
	
	Возврат МассивМетодов;

КонецФункции