#Использовать "./internal"

Перем ШаблонМодуля;
Перем ШаблонМетода;
Перем ШаблонIndex;
Перем МассивТребуется;

Процедура ПриСозданииОбъекта(Знач ДанныеПроекта_ = Неопределено)
    
    Если ДанныеПроекта_ = Неопределено Тогда
        ДанныеПроекта = Новый ProjectData;
    Иначе
		ДанныеПроекта = ДанныеПроекта_;
	КонецЕсли;
	
	CommonTools.СообщитьПроцесс("Generating SBSL adapter");
	
	Корень = ДанныеПроекта.ПолучитьЗначениеНастройки("paths.root");
	Языки  = ДанныеПроекта.ПолучитьЗначениеНастройки("localization.langs");
	
	Шаблоны      = ДанныеПроекта.ПолучитьЗначениеНастройки("sbsl.templates");
	ШаблонМодуля = ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(Шаблоны + "sbsl_module.txt"));
	ШаблонМетода = ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(Шаблоны + "sbsl_method.txt"));
	ШаблонIndex  = ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(Шаблоны + "sbsl_index.txt"));

	Для Каждого Язык Из Языки Цикл
		
		МассивТребуется = Новый Массив;
		КаталогИндекса  = Корень + Язык + "/cli/data/Classes/index";
		ФайлыИндексов   = НайтиФайлы(КаталогИндекса, "*.json");
		
		КаталогМодулей = ДанныеПроекта.ПолучитьЗначениеНастройкиЛокализации("sbslModules", Язык);
		
		УдалитьФайлы(КаталогМодулей, "*.sbsl");
		
		Для Каждого ФайлИндекса Из ФайлыИндексов Цикл
			
			Если ФайлИндекса.Имя = "lib.json" Тогда
				Продолжить;
			КонецЕсли;
			
			СгенерироватьSbsl(ФайлИндекса.ПолноеИмя, ФайлИндекса.ИмяБезРасширения, КаталогМодулей);
			
		КонецЦикла;

		ПолучитьДвоичныеДанныеИзСтроки(СтрШаблон(ШаблонIndex, СтрСоединить(МассивТребуется, Символы.ПС))).Записать(КаталогМодулей + "#Index.sbsl");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СгенерироватьSbsl(Знач ПутьИндекса, Знач Команда, Знач КаталогМодулей)
	
	Данные = CommonTools.ПрочитатьФайлJSON(ПутьИндекса);
	
	ИмяМодуля = Данные["module"];
	
	Если Не СтрНачинаетсяС(ИмяМодуля, "OPI_") Тогда
		Возврат;
	КонецЕсли;

	ИмяSbsl   = СтрШаблон("%1.sbsl", ИмяМодуля);
	ПутьSbsl  = КаталогМодулей + ИмяSbsl;

	МассивТребуется.Добавить("#требуется " + ИмяSbsl);

	МассивМетодов = СформироватьМассивМетодов(Данные);
	
	ТекстМодуля = СтрШаблон(ШаблонМодуля
		, ИмяМодуля
		, Команда
		, СтрСоединить(МассивМетодов, Символы.ПС + Символы.ПС));

	ПолучитьДвоичныеДанныеИзСтроки(ТекстМодуля).Записать(ПутьSbsl);

КонецПроцедуры

Функция СформироватьМассивМетодов(Знач Данные)
	
	МассивМетодов = Новый Массив;
	
	ВозвращаемоеЗначение = "Объект?";
	
	Для Каждого Метод Из Данные["methods"] Цикл

		СписокПараметров = Новый Массив;
		СписокОпций = Новый Массив;
		МассивКомментария = Новый Массив;
		
		МассивКомментария.Добавить(СтрШаблон("    // Метод %1", Метод["name"]));
		МассивКомментария.Добавить(СтрШаблон("    // %1", СтрРазделить(Метод["description"], Символы.ПС)[0]));
		МассивКомментария.Добавить("    //");
		
		МаксимальнаяДлина = 0;
		
		Для Каждого Параметр Из Метод["params"] Цикл
			
			ТекущаяДлина = СтрДлина(Параметр["title"]);
			
			Если ТекущаяДлина > МаксимальнаяДлина Тогда
				МаксимальнаяДлина = ТекущаяДлина;	
			КонецЕсли;		

		КонецЦикла;
		
			
		Для Каждого Параметр Из Метод["params"] Цикл
			
			Если Параметр["default"] = Неопределено Тогда
				СписокПараметров.Добавить(СтрШаблон("%1: Объект?", Параметр["title"]));
			Иначе
				СписокПараметров.Добавить(СтрШаблон("%1: Объект? = Неопределено", Параметр["title"]));
			КонецЕсли;
			
			СписокОпций.Добавить(СтрШаблон("        Опции.Вставить(""%1"", %2)", Параметр["short"], Параметр["title"]));
			
			Дополнение = ?(ЗначениеЗаполнено(Параметр["default"]), СтрШаблон(" (необяз. по ум. - %1)", Параметр["default"]), "");
			
			Заголовок = Параметр["title"];
			
			Пока СтрДлина(Заголовок) < МаксимальнаяДлина Цикл
				Заголовок = Заголовок + " ";
			КонецЦикла;

			МассивКомментария.Добавить(СтрШаблон("    // %1 - %2: %3"
			, Заголовок
			, Параметр["types"]
			, Параметр["description"] + Дополнение));

		КонецЦикла;
		
		ТекстМетода = СтрШаблон(ШаблонМетода
			, Метод["name"]
			, СтрСоединить(СписокПараметров, ", ")
			, ВозвращаемоеЗначение
			, СтрСоединить(СписокОпций, Символы.ПС)
			, СтрСоединить(МассивКомментария, Символы.ПС));
		
		МассивМетодов.Добавить(ТекстМетода);

	КонецЦикла;
	
	Возврат МассивМетодов;

КонецФункции