#Область ПрограммныйИнтерфейс

#Область РаботаСФайламиИПапками

Функция ПолучитьИнформациюОДиске(Знач Токен) Экспорт
	
	Заголовки = ЗаголовокАвторизации(Токен);
	Ответ     = OPI_Инструменты.Get("https://cloud-api.yandex.net/v1/disk", , Заголовки);
	
	Возврат Ответ;
	
КонецФункции

Функция СоздатьПапку(Знач Токен, Знач Путь) Экспорт
	
	Заголовки = ЗаголовокАвторизации(Токен);
	URL       = "https://cloud-api.yandex.net/v1/disk/resources";
	
	Параметры = Новый Структура;
	Параметры.Вставить("path", Путь);
	
	Параметры = OPI_Инструменты.ПараметрыЗапросаВСтроку(Параметры);	
	Ответ     = OPI_Инструменты.Put(URL + Параметры, , Заголовки, Ложь);
	
	Возврат Ответ;

КонецФункции

Функция ПолучитьОбъект(Знач Токен, Знач Путь) Экспорт
	
	Заголовки = ЗаголовокАвторизации(Токен);
	Параметры = Новый Структура;
	Параметры.Вставить("path", Путь);
	
	Ответ     = OPI_Инструменты.Get("https://cloud-api.yandex.net/v1/disk/resources", Параметры, Заголовки);
	
	Возврат Ответ;

КонецФункции

Функция УдалитьОбъект(Знач Токен, Знач Путь, Знач ВКорзину = Истина) Экспорт
	
	Заголовки = ЗаголовокАвторизации(Токен);
	Параметры = Новый Структура;
	Параметры.Вставить("path"       , Путь);
	Параметры.Вставить("permanently", Не ВКорзину);
	
	Ответ     = OPI_Инструменты.Delete("https://cloud-api.yandex.net/v1/disk", Параметры, Заголовки);
	
	Возврат Ответ;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФнукции

Функция ЗаголовокАвторизации(Знач Токен) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "OAuth " + Токен);
	
	Возврат Заголовки;
	
КонецФункции

#КонецОбласти