// OneScript: ./OInt/api/zeromq/Modules/OPI_ZeroMQ.os
// Lib: ZeroMQ
// CLI: none
// Keywords: zeromq, zmq

// DocsCategory: Exchange
// DocsNameRU: ZeroMQ
// DocsNameEN: ZeroMQ

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:LineLength-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content
//@skip-check method-too-many-params

// #Использовать "../../../tools/main"
// #Использовать "../../../tools/http"

#Область ПрограммныйИнтерфейс

#Область МетодыПодключения

// Создать соединение (REQ)
// Создает соединение для отправки запроса
//
// Параметры:
//  Адрес - Строка - Адрес приемника - addr
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция СоздатьСоединениеReq(Знач Адрес) Экспорт

    Результат = ИнициализироватьКоннектор(Адрес, "ConnectReq");
    Возврат Результат;

КонецФункции

// Создать соединение (SUB)
// Создает соединение подписчика
//
// Параметры:
//  Адрес - Строка - Адрес приемника - addr
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция СоздатьСоединениеSub(Знач Адрес) Экспорт

    Результат = ИнициализироватьКоннектор(Адрес, "ConnectSub");
    Возврат Результат;

КонецФункции

// Создать соединение (PUSH)
// Создает соединение отправки в пайплайн
//
// Параметры:
//  Адрес - Строка - Адрес приемника - addr
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция СоздатьСоединениеPush(Знач Адрес) Экспорт

    Результат = ИнициализироватьКоннектор(Адрес, "ConnectPush");
    Возврат Результат;

КонецФункции

// Создать соединение (PULL)
// Создает соединение чтения пайплайна
//
// Параметры:
//  Адрес - Строка - Адрес приемника - addr
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция СоздатьСоединениеPull(Знач Адрес) Экспорт

    Результат = ИнициализироватьКоннектор(Адрес, "ConnectPull");
    Возврат Результат;

КонецФункции

#КонецОбласти

#Область МетодыПрослушивания

// Открыть порт (REP)
// Открывает порт для входящих запросов
//
// Параметры:
//  Порт - Число - Целевой порт - port
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция ОткрытьПортRep(Знач Порт) Экспорт

    Результат = ИнициализироватьКоннектор(Порт, "BindRep");
    Возврат Результат;

КонецФункции

// Открыть порт (Pub)
// Открывает порт для подписчиков
//
// Параметры:
//  Порт - Число - Целевой порт - port
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция ОткрытьПортPub(Знач Порт) Экспорт

    Результат = ИнициализироватьКоннектор(Порт, "BindPub");
    Возврат Результат;

КонецФункции

// Открыть порт (Push)
// Открывает порт пайплайна для отправки данных
//
// Параметры:
//  Порт - Число - Целевой порт - port
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция ОткрытьПортPush(Знач Порт) Экспорт

    Результат = ИнициализироватьКоннектор(Порт, "BindPush");
    Возврат Результат;

КонецФункции

// Открыть порт (Pull)
// Открывает порт пайплайна для получения данных
//
// Параметры:
//  Порт - Число - Целевой порт - port
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция ОткрытьПортPull(Знач Порт) Экспорт

    Результат = ИнициализироватьКоннектор(Порт, "BindPull");
    Возврат Результат;

КонецФункции

#КонецОбласти

#Область МетодыВзаимодействия

// Отправить данные
// Отправляет данные в соединение
//
// Параметры:
//  Соединение - Произвольный        - Объект компоненты с открытым соединением или портом - conn
//  Данные     - ДвоичныеДанные      - Данные для отправки                                 - data
//  Таймаут    - Число, Неопределено - Таймаут (в мс). Без таймаута, если неопределено     - tout
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ОтправитьДанные(Знач Соединение, Знач Данные, Знач Таймаут = Неопределено) Экспорт

    Если Не ЭтоОбъектКоннектора(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Данные, Истина);

    Если Таймаут = Неопределено Тогда

        Таймаут = -1;

    Иначе
        OPI_ПреобразованиеТипов.ПолучитьЧисло(Таймаут);
    КонецЕсли;

    Результат = Соединение.Send(Данные, Таймаут);
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат Результат;

КонецФункции

// Получить данные
// Получает очередное сообщение из соединения
//
// Параметры:
//  Соединение - Произвольный        - Объект компоненты с открытым соединением или портом - conn
//  Таймаут    - Число, Неопределено - Таймаут (в мс). Без таймаута, если неопределено     - tout
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ПолучитьДанные(Знач Соединение, Знач Таймаут) Экспорт

    Если Не ЭтоОбъектКоннектора(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    Если Таймаут = Неопределено Тогда

        Таймаут = -1;

    Иначе
        OPI_ПреобразованиеТипов.ПолучитьЧисло(Таймаут);
    КонецЕсли;

    Результат = Соединение.Recv(Таймаут);

    Результат  = OPI_Инструменты.JsonВСтруктуру(Результат);
    КлючДанных = Неопределено;

    Если OPI_Инструменты.ПолеКоллекцииСуществует(Результат, "data", КлючДанных) Тогда
        Результат["data"] = OPI_Компоненты.ПолучитьДанные(Соединение, КлючДанных);
    КонецЕсли;

    Возврат Результат;

КонецФункции

// Обработать запрос
// Отправляет запрос и ожидает ответ в течении указанного времени (для схемы REQ/REP)
//
// Параметры:
//  Соединение       - Произвольный        - Объект компоненты с открытым соединением                  - conn
//  Данные           - ДвоичныеДанные      - Данные для отправки                                       - data
//  ТаймаутОтправки  - Число, Неопределено - Таймаут отправки (в мс). Без таймаута, если неопределено  - treq
//  ТаймаутПолучения - Число, Неопределено - Таймаут получения (в мс). Без таймаута, если неопределено - trep
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ОбработатьЗапрос(Знач Соединение
    , Знач Данные
    , Знач ТаймаутОтправки = Неопределено
    , Знач ТаймаутПолучения = Неопределено) Экспорт

    РезультатОтправки = ОтправитьДанные(Соединение, Данные, ТаймаутОтправки);

    Если Не РезультатОтправки["result"] Тогда
        Возврат РезультатОтправки;
    КонецЕсли;

    РезультатПолучения = ПолучитьДанные(Соединение, ТаймаутПолучения);

    Возврат РезультатПолучения;

КонецФункции

// Подписаться
// Осуществляет подписку на тему в схеме PUB/SUB
//
// Параметры:
//  Соединение - Произвольный - Объект компоненты с открытым соединением или портом - conn
//  Префикс    - Строка       - Требуемый префикс (тема) сообщений для получения    - prefix
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция Подписаться(Знач Соединение, Знач Префикс) Экспорт

    Если Не ЭтоОбъектКоннектора(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Префикс);

    Результат = Соединение.Subscribe(Префикс);
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат Результат;

КонецФункции

// Закрыть соединение
// Закрывает ранее созданное соединение
//
// Параметры:
//  Соединение - Произвольный - Объект компоненты с открытым соединением или портом - conn
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ЗакрытьСоединение(Знач Соединение) Экспорт

    Если Не ЭтоОбъектКоннектора(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    Результат = Соединение.Close();
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат Результат;

КонецФункции

// Это объект клиента !NOCLI
// Проверяет, что значение является объектом внешней компоненты ZeroMQ
//
// Параметры:
//  Значение - Произвольный - Значение для проверки - value
//
// Возвращаемое значение:
//  Булево -  Это коннектор
Функция ЭтоОбъектКоннектора(Знач Значение) Экспорт

    Возврат Строка(ТипЗнч(Значение)) = "AddIn.OPI_ZeroMQ.Main";

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьКоннектор(Знач АдресПорт, Знач Вид)

    Если СтрНачинаетсяС(Вид, "Connect") Тогда
        OPI_ПреобразованиеТипов.ПолучитьСтроку(АдресПорт);
        OPI_Инструменты.ВернутьУправляющиеПоследовательности(АдресПорт);
    Иначе
        OPI_ПреобразованиеТипов.ПолучитьЧисло(АдресПорт)
    КонецЕсли;

    ZMQ = OPI_Компоненты.ПолучитьКомпоненту("ZeroMQ");

    Если Вид = "ConnectReq" Тогда
        Результат = ZMQ.ConnectReq(АдресПорт);
    ИначеЕсли Вид = "ConnectSub" Тогда
        Результат = ZMQ.ConnectSub(АдресПорт);
    ИначеЕсли Вид = "ConnectPush" Тогда
        Результат = ZMQ.ConnectPush(АдресПорт);
    ИначеЕсли Вид = "ConnectPull" Тогда
        Результат = ZMQ.ConnectPull(АдресПорт);
    ИначеЕсли Вид = "BindRep" Тогда
        Результат = ZMQ.BindRep(АдресПорт);
    ИначеЕсли Вид = "BindPub" Тогда
        Результат = ZMQ.BindPub(АдресПорт);
    ИначеЕсли Вид = "BindPush" Тогда
        Результат = ZMQ.BindPush(АдресПорт);
    ИначеЕсли Вид = "BindPull" Тогда
        Результат = ZMQ.BindPull(АдресПорт);
    КонецЕсли;

    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат ?(Результат["result"], ZMQ, Результат);

КонецФункции

#КонецОбласти
