// OneScript: ./OInt/tests/Modules/OPItc_GRPC.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

//#Использовать "../../tools/main"
//#Использовать "../../tools/http"
//#Использовать "../../api"
//#Использовать asserts
//#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_СписокТестовКлиентСервер.СформироватьТестыЯксCLI("GRPC");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("GRPC");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область GRPC

Процедура GR_ОсновныеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Address"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_AddressNoTls", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Proto"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoTS"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoImport" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"         , ПараметрыТеста);

    GRPC_ОткрытьСоединение(ПараметрыТеста);
    GRPC_ЗакрытьСоединение(ПараметрыТеста);
    GRPC_ЭтоКоннектор(ПараметрыТеста);
    GRPC_УстановитьМетаданные(ПараметрыТеста);
    GRPC_ВызватьМетод(ПараметрыТеста);
    GRPC_ПолучитьНастройкиTls(ПараметрыТеста);
    GRPC_ПолучитьПараметрыСоединения(ПараметрыТеста);

КонецПроцедуры

Процедура GR_Интроспекция() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Address"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Proto"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoImport", ПараметрыТеста);

    GRPC_ПолучитьСписокСервисов(ПараметрыТеста);
    GRPC_ПолучитьСписокМетодов(ПараметрыТеста);
    GRPC_ПолучитьМетод(ПараметрыТеста);

КонецПроцедуры

Процедура GR_Стриминг() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Address"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_AddressNoTls", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Proto"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoTS"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoImport" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"         , ПараметрыТеста);

    GRPC_ИнициализироватьСерверныйПоток(ПараметрыТеста);
    GRPC_ИнициализироватьКлиентскийПоток(ПараметрыТеста);
    GRPC_ИнициализироватьДвунаправленныйПоток(ПараметрыТеста);
    GRPC_ОтправитьСообщение(ПараметрыТеста);
    GRPC_ПолучитьСообщение(ПараметрыТеста);
    GRPC_ЗакрытьПоток(ПараметрыТеста);
    GRPC_ОбработатьСерверныйПоток(ПараметрыТеста);
    GRPC_ОбработатьКлиентскийПоток(ПараметрыТеста);
    GRPC_ОбработатьДвунаправленныйПоток(ПараметрыТеста);
    GRPC_ЗавершитьОтправку(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // GRPC

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область GRPC

Процедура GRPC_ОткрытьСоединение(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);
    Опции.Вставить("meta", Мета);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Результат = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОткрытьСоединение");

    Результат = OPI_GRPC.ЗакрытьСоединение(Результат);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОткрытьСоединение", "Закрытие");

    Адрес     = ПараметрыФункции["GRPC_AddressNoTls"];
    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Результат = OPI_GRPC.ОткрытьСоединение(Параметры);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОткрытьСоединение", "Без TLS");

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto", Proto1);

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Результат = OPI_GRPC.ОткрытьСоединение(Параметры);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОткрытьСоединение", "Ошибка");

КонецПроцедуры

Процедура GRPC_ЗакрытьСоединение(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);
    Опции.Вставить("meta", Мета);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Результат  = OPI_GRPC.ЗакрытьСоединение(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ЗакрытьСоединение");

КонецПроцедуры

Процедура GRPC_ЭтоКоннектор(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);
    Опции.Вставить("meta", Мета);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Результат  = OPI_GRPC.ЭтоКоннектор(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ЭтоКоннектор");

КонецПроцедуры

Процедура GRPC_ПолучитьПараметрыСоединения(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);
    Опции.Вставить("meta", Мета);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ПолучитьПараметрыСоединения");

КонецПроцедуры

Процедура GRPC_ПолучитьНастройкиTls(ПараметрыФункции)

    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ПолучитьНастройкиTls");

КонецПроцедуры

Процедура GRPC_УстановитьМетаданные(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Мета      = Новый Структура("somekey", "somevalue");
    Результат = OPI_GRPC.УстановитьМетаданные(Соединение, Мета);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "УстановитьМетаданные");

    Если Не OPI_ПолучениеДанныхТестов.ЭтоТестCLI() Тогда

        Сервис = "grpcbin.GRPCBin";
        Метод  = "HeadersUnary";

        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("service", Сервис);
        Опции.Вставить("method", Метод);
        Опции.Вставить("data", Неопределено);
        Опции.Вставить("tls", Tls);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ВызватьМетод", Опции);

        OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "УстановитьМетаданные", "Проверка");

     КонецЕсли;

КонецПроцедуры

Процедура GRPC_ВызватьМетод(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);
    Опции.Вставить("meta", Мета);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyUnary";

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    МассивЧисел = Новый Массив;
    МассивЧисел.Добавить(1);
    МассивЧисел.Добавить(10);
    МассивЧисел.Добавить(100);

    МассивСтруктур = Новый Массив;
    МассивСтруктур.Добавить(Новый Структура("f_string", "Nested value 1"));
    МассивСтруктур.Добавить(Новый Структура("f_string", "Nested value 2"));

    МассивБулево = Новый Массив;
    МассивБулево.Добавить(Истина);
    МассивБулево.Добавить(Ложь);

    Файл = ПараметрыФункции["Document"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Файл);

    ИВФ = ПолучитьИмяВременногоФайла();
    Файл.Записать(ИВФ);

    МассивДвоичныхДанных = Новый Массив;
    МассивДвоичныхДанных.Добавить(Файл); // Как данные
    МассивДвоичныхДанных.Добавить(ИВФ);  // Как путь к файлу

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_int64"  , 123);
    Данные.Вставить("f_float"  , 123.22000122070312);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_enum"   , "ENUM_1");
    Данные.Вставить("f_bytes"  , Файл);
    Данные.Вставить("f_sub"    , Новый Структура("f_string"  , "Nested value"));
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_int32s" , МассивЧисел);
    Данные.Вставить("f_int64s" , МассивЧисел);
    Данные.Вставить("f_floats" , МассивЧисел);
    Данные.Вставить("f_bytess" , МассивДвоичныхДанных);
    Данные.Вставить("f_subs"   , МассивСтруктур);
    Данные.Вставить("f_bools"  , МассивБулево);
    Данные.Вставить("f_enums"  , СтрРазделить("ENUM_1,ENUM_2", ","));

    Опции = Новый Структура;
    Опции.Вставить("conn", Параметры);
    Опции.Вставить("service", Сервис);
    Опции.Вставить("method", Метод);
    Опции.Вставить("data", Данные);
    Опции.Вставить("tls", Tls);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ВызватьМетод", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ВызватьМетод");

    Опции = Новый Структура;
    Опции.Вставить("conn", Параметры);
    Опции.Вставить("service", Сервис);
    Опции.Вставить("method", Метод);
    Опции.Вставить("data", Неопределено);
    Опции.Вставить("tls", Tls);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ВызватьМетод", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ВызватьМетод", "Пустой");

    Метод     = "HeadersUnary";
    Опции = Новый Структура;
    Опции.Вставить("conn", Параметры);
    Опции.Вставить("service", Сервис);
    Опции.Вставить("method", Метод);
    Опции.Вставить("data", Неопределено);
    Опции.Вставить("tls", Tls);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ВызватьМетод", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ВызватьМетод", "Мета");

КонецПроцедуры

Процедура GRPC_ПолучитьСписокСервисов(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];
    Схема = ПараметрыФункции["GRPC_Proto"]; // Строка, путь к файлу или URL

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схема);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьСписокСервисов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ПолучитьСписокСервисов");

КонецПроцедуры

Процедура GRPC_ПолучитьСписокМетодов(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];
    Схема = ПараметрыФункции["GRPC_Proto"]; // Строка, путь к файлу или URL

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схема);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Сервис     = "grpcbin.GRPCBin";

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("service", Сервис);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьСписокМетодов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ПолучитьСписокМетодов");

КонецПроцедуры

Процедура GRPC_ПолучитьМетод(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];
    Схема = ПараметрыФункции["GRPC_Proto"]; // Строка, путь к файлу или URL

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схема);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Сервис     = "grpcbin.GRPCBin";
    Метод      = "Index";

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("service", Сервис);
    Опции.Вставить("method", Метод);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьМетод", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ПолучитьМетод");

КонецПроцедуры

Процедура GRPC_ИнициализироватьСерверныйПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyServerStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьСерверныйПоток(Соединение, Сервис, Метод, Данные); // <---

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    МассивСообщений = Новый Массив;

    Пока Истина Цикл

        ТекущееСообщение = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);

        Если Не ТекущееСообщение["result"] Тогда

            Ошибка = ТекущееСообщение["error"];

            Если Ошибка = "Timeout" Тогда
                Продолжить;
            ИначеЕсли Ошибка = "Closed" Тогда
                Прервать;
            Иначе
                ВызватьИсключение Ошибка;
            КонецЕсли;

        Иначе

            ДанныеСообщения = ТекущееСообщение["message"];

            Если ЗначениеЗаполнено(ДанныеСообщения) Тогда
                МассивСообщений.Добавить(ДанныеСообщения);
            КонецЕсли;

        КонецЕсли;

    КонецЦикла;

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат      , "GRPC", "ИнициализироватьСерверныйПоток");
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(МассивСообщений, "GRPC", "ИнициализироватьСерверныйПоток", "Массив");

КонецПроцедуры

Процедура GRPC_ИнициализироватьКлиентскийПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyClientStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьКлиентскийПоток(Соединение, Сервис, Метод); // <---

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    ФинальноеСообщение = Неопределено;

    Счетчик = 0;
    Пока Истина Цикл

        ТекущаяОтправка = OPI_GRPC.ОтправитьСообщение(Соединение, IDПотока, Данные);
        Счетчик         = Счетчик + 1;

        Если Не ТекущаяОтправка["result"] Тогда

            Ошибка = ТекущаяОтправка["error"];

            Если Ошибка = "Timeout" Тогда
                Продолжить;
            ИначеЕсли Ошибка = "Closed" Тогда
                ФинальноеСообщение = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);
                Прервать;
            Иначе
                ВызватьИсключение СтрШаблон("%1 (отправлено сообщений %2)", Ошибка, Счетчик);
            КонецЕсли;

        Иначе

            Если Счетчик = 10 Тогда
                Завершение         = OPI_GRPC.ЗавершитьОтправку(Соединение, IDПотока);
                ФинальноеСообщение = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);
                Прервать;
            КонецЕсли;

        КонецЕсли;

    КонецЦикла;

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(ФинальноеСообщение, "GRPC", "ИнициализироватьКлиентскийПоток", , Счетчик);

КонецПроцедуры

Процедура GRPC_ИнициализироватьДвунаправленныйПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyBidirectionalStreamStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьДвунаправленныйПоток(Соединение, Сервис, Метод); // <---

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    МассивРезультата = Новый Массив;
    Счетчик          = 0;

    Пока Счетчик < 10 Цикл

        Данные.Вставить("f_int32", Счетчик + 1);

        ТекущаяОтправка = OPI_GRPC.ОтправитьСообщение(Соединение, IDПотока, Данные);

        Если Не ТекущаяОтправка["result"] Тогда

            Ошибка = ТекущаяОтправка["error"];

            Если Ошибка = "Timeout" Тогда
                Продолжить;
            Иначе
                 ВызватьИсключение СтрШаблон("Ошибка отправки: %1 (обработано сообщений %2)", Ошибка, Счетчик);
            КонецЕсли;

        КонецЕсли;

        ТекущееПолучение = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);

        Если Не ТекущееПолучение["result"] Тогда
            ВызватьИсключение СтрШаблон("Ошибка получения: %1 (обработано сообщений %2)", Ошибка, Счетчик);
        КонецЕсли;

        МассивРезультата.Добавить(ТекущееПолучение["message"]);
        Счетчик = Счетчик + 1;

    КонецЦикла;

    OPI_GRPC.ЗакрытьПоток(Соединение, IDПотока);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ИнициализироватьДвунаправленныйПоток", , МассивРезультата);

КонецПроцедуры

Процедура GRPC_ОтправитьСообщение(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyClientStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьКлиентскийПоток(Соединение, Сервис, Метод);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    Результат = OPI_GRPC.ОтправитьСообщение(Соединение, IDПотока, Данные); // <---
    Закрытие  = OPI_GRPC.ЗакрытьПоток(Соединение, IDПотока);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОтправитьСообщение", , Закрытие);

КонецПроцедуры

Процедура GRPC_ПолучитьСообщение(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyServerStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    МассивЧисел = Новый Массив;
    МассивЧисел.Добавить(1);
    МассивЧисел.Добавить(10);
    МассивЧисел.Добавить(100);

    Файл = ПараметрыФункции["Document"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Файл);

    ИВФ = ПолучитьИмяВременногоФайла();
    Файл.Записать(ИВФ);

    МассивДвоичныхДанных = Новый Массив;
    МассивДвоичныхДанных.Добавить(Файл); // Как данные
    МассивДвоичныхДанных.Добавить(ИВФ);  // Как путь к файлу

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_int64"  , 123);
    Данные.Вставить("f_float"  , 123.22000122070312);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_enum"   , "ENUM_1");
    Данные.Вставить("f_bytes"  , Файл);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_int32s" , МассивЧисел);
    Данные.Вставить("f_bytess" , МассивДвоичныхДанных);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьСерверныйПоток(Соединение, Сервис, Метод, Данные);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    Результат = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока); // <---
    Закрытие  = OPI_GRPC.ЗакрытьПоток(Соединение, IDПотока);

    // END

    Данные.Вставить("f_int64s", Новый Массив);
    Данные.Вставить("f_enums" , Новый Массив);
    Данные.Вставить("f_floats", Новый Массив);
    Данные.Вставить("f_bools" , Новый Массив);
    Данные.Вставить("f_subs"  , Новый Массив);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ПолучитьСообщение", , Закрытие, Данные);

КонецПроцедуры

Процедура GRPC_ЗакрытьПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyServerStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьСерверныйПоток(Соединение, Сервис, Метод, Данные);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    Результат = OPI_GRPC.ЗакрытьПоток(Соединение, IDПотока); // <---

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ЗакрытьПоток");

    Результат = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ЗакрытьПоток", "Отправка");

КонецПроцедуры

Процедура GRPC_ОбработатьСерверныйПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyServerStream";

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Опции = Новый Структура;
    Опции.Вставить("conn", Параметры);
    Опции.Вставить("service", Сервис);
    Опции.Вставить("method", Метод);
    Опции.Вставить("data", Данные);
    Опции.Вставить("tls", Tls);
    Опции.Вставить("count", 3);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ОбработатьСерверныйПоток", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОбработатьСерверныйПоток");

КонецПроцедуры

Процедура GRPC_ОбработатьКлиентскийПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyClientStream";

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    МассивЗапросов = Новый Массив;

    Для Н = 1 По 10 Цикл
        МассивЗапросов.Добавить(Данные);
    КонецЦикла;

    Опции = Новый Структура;
    Опции.Вставить("conn", Параметры);
    Опции.Вставить("service", Сервис);
    Опции.Вставить("method", Метод);
    Опции.Вставить("data", МассивЗапросов);
    Опции.Вставить("tls", Tls);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ОбработатьКлиентскийПоток", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОбработатьКлиентскийПоток");

    МассивЗапросов.Удалить(МассивЗапросов.ВГраница());

    Опции = Новый Структура;
    Опции.Вставить("conn", Параметры);
    Опции.Вставить("service", Сервис);
    Опции.Вставить("method", Метод);
    Опции.Вставить("data", МассивЗапросов);
    Опции.Вставить("tls", Tls);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ОбработатьКлиентскийПоток", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОбработатьКлиентскийПоток", "Ошибка");

КонецПроцедуры

Процедура GRPC_ОбработатьДвунаправленныйПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyBidirectionalStreamStream";

    ПорядокОбмена = Новый Массив;

    Для Н = 1 По 10 Цикл

        ПорядокОбмена.Добавить(Данные);       // Одно отправляем
        ПорядокОбмена.Добавить(Неопределено); // Одно получаем

    КонецЦикла;

    Опции = Новый Структура;
    Опции.Вставить("conn", Параметры);
    Опции.Вставить("service", Сервис);
    Опции.Вставить("method", Метод);
    Опции.Вставить("exch", ПорядокОбмена);
    Опции.Вставить("tls", Tls);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ОбработатьДвунаправленныйПоток", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ОбработатьДвунаправленныйПоток");

КонецПроцедуры

Процедура GRPC_ЗавершитьОтправку(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("proto", Схемы);

    Параметры = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьПараметрыСоединения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Tls = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("grpc", "ПолучитьНастройкиTls", Опции);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyClientStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    Результат = OPI_GRPC.ИнициализироватьКлиентскийПоток(Соединение, Сервис, Метод);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    Результат = OPI_GRPC.ЗавершитьОтправку(Соединение, IDПотока);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GRPC", "ЗавершитьОтправку");

КонецПроцедуры

#КонецОбласти // GRPC

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure GR_CommonMethods() Export
    GR_ОсновныеМетоды();
EndProcedure

Procedure GR_Introspection() Export
    GR_Интроспекция();
EndProcedure

Procedure GR_Streaming() Export
    GR_Стриминг();
EndProcedure

#EndRegion
