// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

#Использовать "../../../../../oint/tools/main"
#Использовать "../../../../core/Classes/internal"
#Использовать "../../../../data"

Перем ОбъектОПИ;
Перем ПеременныеСеанса;
Перем ЗаголовокАвторизации;
Перем ЗаголовокСервера;
Перем РазрешеноGet;
Перем РазрешеноPost;


#Область СлужебныйПрограммныйИнтерфейс

Функция ЗапуститьСервер(Знач Порт, Знач Post = Истина, Знач Get = Ложь, Знач Авторизация = "") Экспорт

	ОбъектОПИ        = Новый LibraryComposition;
	ПеременныеСеанса = Новый Соответствие;
	
	OPI_ПреобразованиеТипов.ПолучитьЧисло(Порт);
	OPI_ПреобразованиеТипов.ПолучитьБулево(Post);
	OPI_ПреобразованиеТипов.ПолучитьБулево(Get);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Авторизация);
	
	ЗаголовокАвторизации = Авторизация;
	ЗаголовокСервера     = СтрШаблон("OInt/%1 (Kestrel)", ОбъектОПИ.ПолучитьВерсию());
	РазрешеноGet         = Get;
	РазрешеноPost        = Post;
	
	Пока Истина Цикл
		
		Попытка
			
			ВебСервер = Новый ВебСервер(Порт);
			ВебСервер.ДобавитьОбработчикЗапросов(ЭтотОбъект, "ОсновнаяОбработка");
			ВебСервер.Запустить();
			
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

		Приостановить(5000);

	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОсновнаяОбработка(Контекст, СледующийОбработчик) Экспорт
    
	Попытка
		
		Контекст.Ответ.Заголовки["Server"] = ЗаголовокСервера;
		
		Метод = вРег(Контекст.Запрос.Метод);
		
		Если Метод = "GET" И РазрешеноGet
			Или Метод = "POST" И РазрешеноPost Тогда
			
			Результат = ОбработатьЗапрос(Контекст, Метод);
			
		Иначе
			Результат = Ошибка(Контекст, 405, "Использование указанного метода HTTP не разрешено!");
		КонецЕсли;
        
    Исключение
        
        Результат = ОписаниеОшибки();
        
        Если Контекст.Ответ.КодСостояния = 200 Тогда
            Контекст.Ответ.КодСостояния = 500;
        КонецЕсли;
        
    КонецПопытки;
    
    ВыполнитьСборкуМусора();
    
    Если Результат <> Неопределено Тогда
        
		Если OPI_Инструменты.ЭтоКоллекция(Результат) Тогда
			ContentType = "application/json;charset=utf-8";
		ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
			ContentType = "text/plain;charset=utf-8";
		Иначе
			ContentType = "application/octet-stream";
		КонецЕсли;
		
		Контекст.Ответ.Заголовки["Content-Type"] = ContentType;
        
        OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Результат, Истина, Ложь);
        
        ЗаписьДанных = Новый ЗаписьДанных(Контекст.Ответ.Тело);
        ЗаписьДанных.Записать(Результат);
        ЗаписьДанных.Закрыть();
         
    КонецЕсли;
    
КонецПроцедуры

Функция ОбработатьЗапрос(Контекст, Знач МетодHttp)

	Путь = Контекст.Запрос.Путь;
	
	ЧастиПути = СтрРазделить(Путь, "/", Ложь);
	
	Если ЧастиПути.Количество() < 2 Тогда
		Возврат Ошибка(Контекст, 400, "Отсутствует имя метода и/или команды!");
	КонецЕсли;
	
	Метод   = ЧастиПути[ЧастиПути.ВГраница()];
	Команда = ЧастиПути[ЧастиПути.ВГраница() - 1];

	КонтекстВыполнения = Новый Соответствие;

	ОпцииОбработанные = СформироватьОпции(Контекст, КонтекстВыполнения, МетодHttp);
	СтруктураВызова   = ОбъектОПИ.СформироватьСтрокуВызоваМетода(ОпцииОбработанные, Команда, Метод, , Истина);
	
	Если СтруктураВызова["Ошибка"] Тогда
		Возврат Ошибка(Контекст, 400, СтрШаблон("Проверьте порядок и экранирование при вводе команды! Команда: %1, Метод: %2", Команда, Метод));
	КонецЕсли;
	
	ТекстВыполнения = СтруктураВызова["Результат"];
	
	Результат = Неопределено;
	
	Попытка
		Executor.ВыполнитьСкрипт(ТекстВыполнения, Результат, , КонтекстВыполнения);
		НормализоватьРезультат(Результат);
	Исключение
		Результат = Ошибка(Контекст, 400, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

Функция Ошибка(Контекст, Знач Код, Знач Текст) 
	
	Контекст.Ответ.КодСостояния = Код;
	Возврат Новый Структура("result,error", Ложь, Текст);

КонецФункции

Функция СформироватьОпции(Знач Контекст, Знач КонтекстВыполнения, Знач Метод)
	
	Опции = Новый Соответствие;

	Если Метод = "GET" Тогда
		Опции = СформироватьОпцииGet(Контекст);
	Иначе

		Если СтрНайти(Строка(Контекст.Запрос.Заголовки["Content-Type"]), "JSON") > 0 Тогда
			Опции = СформироватьОпцииJson(Контекст);
		Иначе
			Опции = СформироватьОпцииForm(Контекст);
		КонецЕсли;
		
	КонецЕсли;
	
	ОпцииНормализованные = Новый Соответствие;

	Для Каждого Опция Из Опции Цикл
		НормализованноеЗначение = ДополнитьКонтекст(КонтекстВыполнения, Опция.Значение);
		ОпцииНормализованные.Вставить(Опция.Ключ, НормализованноеЗначение);
	КонецЦикла;

	Возврат ОпцииНормализованные;

КонецФункции

Функция СформироватьОпцииGet(Знач Контекст)

    Запрос    = Контекст.Запрос;
	Параметры = Запрос.Параметры;
	
	Возврат Параметры;
	
КонецФункции

Функция СформироватьОпцииJson(Знач Контекст)

	Запрос = Контекст.Запрос;
	
	Попытка
		ЧтениеДанных = Новый ЧтениеДанных(Запрос.Тело);
		ТелоЗапроса  = ЧтениеДанных.Прочитать().ПолучитьДвоичныеДанные();
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(ТелоЗапроса));
		
		Параметры = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
	Исключение
		Контекст.Ответ.КодСостояния = 400;
		ВызватьИсключение "Тело запроса не является валидным JSON!"
	КонецПопытки;
	
	Возврат Параметры;
	
КонецФункции

Функция СформироватьОпцииForm(Знач Контекст)
	
	Запрос = Контекст.Запрос;
	Форма  = Запрос.Форма;
	
	Если Не ЗначениеЗаполнено(Форма) Тогда
		Контекст.Ответ.КодСостояния = 400;
        ВызватьИсключение "Не найдены данные формы в теле запроса!";
	КонецЕсли;
	
    Параметры = Новый Соответствие;
    Файлы     = Форма.Файлы;
    
    Для Каждого Поле Из Форма Цикл
        
        Параметры.Вставить(Поле.Ключ, Поле.Значение);
        
    КонецЦикла;
    
	Для Каждого Файл Из Файлы Цикл
		
        Параметры.Вставить(Файл.Имя, Файл);
        
    КонецЦикла;
	
	Возврат Параметры;

КонецФункции

Функция СгенерироватьКлючПеременной()
	
	КлючПеременной = "";
	ШаблонКлюча    = "{oint-%1}";
	
	Пока КлючПеременной = "" Или ПеременныеСеанса.Получить(КлючПеременной) <> Неопределено Цикл
		
		КлючПеременной = СтрШаблон(ШаблонКлюча, Лев(Строка(Новый УникальныйИдентификатор), 6));
		
	КонецЦикла;
	
	Возврат КлючПеременной;
	
КонецФункции

Процедура НормализоватьРезультат(Результат)
	
	ТипРезультата = ТипЗнч(Результат);
	
	Если СтрНачинаетсяС(Строка(ТипРезультата), "AddIn.") Тогда
		
		КлючПеременной = СгенерироватьКлючПеременной();
		ПеременныеСеанса.Вставить(КлючПеременной, Результат);	
		Результат = КлючПеременной;

	КонецЕсли;

КонецПроцедуры

Функция ДополнитьКонтекст(Контекст, Знач ТекущееЗначение)
	
	ТипЗначения = ТипЗнч(ТекущееЗначение);
	
	Если ТипЗначения = Тип("ДвоичныеДанные") Тогда
		
		КлючПеременной = СгенерироватьКлючПеременной();
		Контекст.Вставить(КлючПеременной, ТекущееЗначение);
		Возврат КлючПеременной;

	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		
		ЗначениеПеременной = ПеременныеСеанса.Получить(ТекущееЗначение);

		Если ЗначениеПеременной <> Неопределено Тогда
			Контекст.Вставить(ТекущееЗначение, ЗначениеПеременной);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекущееЗначение;

КонецФункции

#КонецОбласти