// OneScript: ./OInt/core/Modules/OPI_GRPC.os
// Lib: GRPC
// CLI: grpc
// Keywords: grpc

// MIT License

// Copyright (c) 2023-2025 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:LineLength-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:DuplicateStringLiteral-off

//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content
//@skip-check method-too-many-params
//@skip-check constructor-function-return-section
//@skip-check doc-comment-collection-item-type

#Область ПрограммныйИнтерфейс

#Область ОсновныеМетоды

// Открыть соединение !NOCLI
// Открывает gRPC соединение
//
// Параметры:
//  Параметры - Строка                     - Параметры соединения. См. ПолучитьПараметрыСоединения    - params
//  Tls       - Структура Из КлючИЗначение - Настройки TLS, если необходимо. См. ПолучитьНастройкиTls - tls
//
// Возвращаемое значение:
//  Произвольный - Объект коннектора или соответствие с информацией об ошибке
Функция ОткрытьСоединение(Знач Параметры, Знач Tls = Неопределено) Экспорт
     
    Если ЭтоКоннектор(Параметры) Тогда
        Возврат Параметры;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Параметры);
    
    Адрес = OPI_Инструменты.ПолучитьИли(Параметры, "address", Неопределено);
    
    Если Адрес = Неопределено Тогда
        Ошибка = Новый Соответствие;
        Ошибка.Вставить("result", Ложь);
        Ошибка.Вставить("error" , "Структура параметров не содержит адрес");
    КонецЕсли;
    
    Коннектор = OPI_Компоненты.ПолучитьКомпоненту("GRPC");
    Коннектор.ServerAddress = Строка(Адрес);

    Tls = OPI_Компоненты.УстановитьTls(Коннектор, Tls);

    Если Не OPI_Инструменты.ПолучитьИли(Tls, "result", Ложь) Тогда
        Возврат Tls;
    КонецЕсли;

    Результат = Коннектор.Connect();
    Результат = OPI_Инструменты.JSONВСтруктуру(Результат);
    
    Если Не OPI_Инструменты.ПолучитьИли(Результат, "result", Ложь) Тогда
        Возврат Результат;
    КонецЕсли;
    
    Результат = УстановитьProto(Коннектор, Параметры);

    Возврат ?(Результат["result"], Коннектор, Результат);

КонецФункции


// Закрыть соединение !NOCLI
// Явно закрывает переданное соединение
//
// Параметры:
//  Соединение - Произвольный - Объект компоненты с открытым соединением - conn
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Результат закрытия соединения
Функция ЗакрытьСоединение(Знач Соединение) Экспорт

    Если ЭтоКоннектор(Соединение) Тогда

        Результат = Соединение.Disconnect();
        Результат = OPI_Инструменты.JsonВСтруктуру(Результат, Ложь);

    Иначе

        Результат = Новый Структура("result,error", Ложь, "It's not a connection");

    КонецЕсли;

    Возврат Результат;

КонецФункции

// Это коннектор !NOCLI
// Проверяет, что значение является объектом внешней компоненты для работы с gRPC
//
// Параметры:
//  Значение - Произвольный - Значение для проверки - value
//
// Возвращаемое значение:
//  Булево -  Это коннектор
Функция ЭтоКоннектор(Знач Значение) Экспорт

    Возврат Строка(ТипЗнч(Значение)) = "AddIn.OPI_GRPC.Main";

КонецФункции

// Получить параметры соединения
// Формирует структуру параметров для создания соединения
// 
// Параметры:
//  Адрес - Строка  - Адрес для подключения (с протоколом)         - addr
//  Схема - Строка  - Proto схема сервиса строкой или путь к файлу - proto
// 
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Параметры соединения
Функция ПолучитьПараметрыСоединения(Знач Адрес, Знач Схема = Неопределено) Экспорт
    
    ПараметрыСоединения = Новый Структура;
    OPI_Инструменты.ДобавитьПоле("address", Адрес, "Строка", ПараметрыСоединения);
    OPI_Инструменты.ДобавитьПоле("proto"  , Схема, "Строка", ПараметрыСоединения);
    
    Возврат ПараметрыСоединения;
    
КонецФункции

// Получить настройки TLS
// Формирует настройки для использования TLS при выполнении запросов
//
// Примечание:
// Настройки Tls могут быть установлены только в момент создания соединения: явного, при использовании функции `ОткрытьСоединение`^^
// или неявного, при передаче настроек
//
// Параметры:
//  ОтключитьПроверкуСертификатов - Булево - Позволяет работать с некорретными сертификатами, в т.ч. самоподписанными   - trust
//  ПутьКСертификату              - Строка - Путь к корневому PEM файлу сертификата, если его нет в системном хранилище - cert
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Структура настроек TLS соединения
Функция ПолучитьНастройкиTls(Знач ОтключитьПроверкуСертификатов, Знач ПутьКСертификату = "") Экспорт

    Возврат OPI_Компоненты.ПолучитьНастройкиTls(ОтключитьПроверкуСертификатов, ПутьКСертификату);

КонецФункции

#КонецОбласти

#Область Интроспекция 

// Получить список сервисов
// Получает список доступных сервисов
// 
// Параметры:
//  Соединение - Произвольный               - Существующее соединение или параметры соединения         - conn
//  Tls        - Структура Из КлючИЗначение - Настройки TLS, если необходимо. См. ПолучитьНастройкиTls - tls
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ПолучитьСписокСервисов(Знач Соединение, Знач Tls = Неопределено) Экспорт

    Если ЭтоКоннектор(Соединение) Тогда
        ЗакрыватьСоединение = Ложь;
        Коннектор           = Соединение;
    Иначе
        ЗакрыватьСоединение = Истина;
        Коннектор           = ОткрытьСоединение(Соединение, Tls);
    КонецЕсли;

    Если Не ЭтоКоннектор(Коннектор) Тогда
        Возврат Коннектор;
    КонецЕсли;
    
    Результат = Соединение.ListServices();
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);
        
    Если ЗакрыватьСоединение Тогда
        ЗакрытьСоединение(Коннектор);
    КонецЕсли;

    Возврат Результат;
    
КонецФункции

// Получить список методов
// Получает список доступных методов указанного сервиса
// 
// Параметры:
//  Сервис     - Строка                     - Имя сервиса                                              - service
//  Соединение - Произвольный               - Существующее соединение или параметры соединения         - conn
//  Tls        - Структура Из КлючИЗначение - Настройки TLS, если необходимо. См. ПолучитьНастройкиTls - tls
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ПолучитьСписокМетодов(Знач Сервис, Знач Соединение, Знач Tls = Неопределено) Экспорт

    Если ЭтоКоннектор(Соединение) Тогда
        ЗакрыватьСоединение = Ложь;
        Коннектор           = Соединение;
    Иначе
        ЗакрыватьСоединение = Истина;
        Коннектор           = ОткрытьСоединение(Соединение, Tls);
    КонецЕсли;

    Если Не ЭтоКоннектор(Коннектор) Тогда
        Возврат Коннектор;
    КонецЕсли;
    
    OPI_ПреобразованиеТипов.ПолучитьСтроку(Сервис);
    
    Результат = Соединение.ListMethods(Сервис);
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);
        
    Если ЗакрыватьСоединение Тогда
        ЗакрытьСоединение(Коннектор);
    КонецЕсли;

    Возврат Результат;
        
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьProto(Коннектор, Знач Параметры)
    
    Proto = OPI_Инструменты.ПолучитьИли(Параметры, "proto", Неопределено);
    
    Если Proto <> Неопределено Тогда
    
        OPI_ПреобразованиеТипов.ПолучитьСтроку(Proto, Истина);
        Результат = Коннектор.LoadProto(Proto);
        Результат = OPI_Инструменты.JSONВСтруктуру(Результат);
            
    Иначе
        Результат = Новый Структура("result", Истина);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

#КонецОбласти
