 // OneScript: ./OInt/tests/Modules/OPI_Тесты.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

// #Использовать oint
// #Использовать asserts
// #Использовать "internal"

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область SSH

Процедура SShell_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровSSH();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        SSH_ОткрытьСоединение(ПараметрыТеста);
        SSH_ПолучитьКонфигурациюСоединения(ПараметрыТеста);
        SSH_ВыполнитьКоманду(ПараметрыТеста);
        SSH_ЗакрытьСоединение(ПараметрыТеста);
        SSH_ЭтоКоннектор(ПараметрыТеста);
        SSH_ПолучитьНастройкиЛогинПароль(ПараметрыТеста);
        SSH_ПолучитьНастройкиПриватныйКлюч(ПараметрыТеста);
        SSH_ПолучитьНастройкиЧерезАгента(ПараметрыТеста);
        SSH_ПолучитьНастройкиKI(ПараметрыТеста);
        SSH_ПолучитьНастройкиПрокси(ПараметрыТеста);

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(МассивВариантов[0]["SSH_Key"], "Ошибка удаления файла после теста");

КонецПроцедуры

#КонецОбласти // SSH

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область SSH

Процедура SSH_ОткрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Результат = OPI_SSH.ОткрытьСоединение(НастройкиSSH, НастройкиПрокси);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ОткрытьСоединение", Постфикс);

КонецПроцедуры

Процедура SSH_ВыполнитьКоманду(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SSH.ОткрытьСоединение(НастройкиSSH, НастройкиПрокси);

    Если OPI_SSH.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SSH.ВыполнитьКоманду(Соединение, "whoami");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ВыполнитьКоманду", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьКонфигурациюСоединения(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Результат = OPI_SSH.ПолучитьКонфигурациюСоединения(НастройкиSSH, НастройкиПрокси);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ПолучитьКонфигурациюСоединения", Постфикс);

    Результат = OPI_SSH.ВыполнитьКоманду(Результат, "whoami");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ПолучитьКонфигурациюСоединения", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура SSH_ЗакрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SSH.ОткрытьСоединение(НастройкиSSH, НастройкиПрокси);

    Если OPI_SSH.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SSH.ЗакрытьСоединение(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ЗакрытьСоединение", Постфикс);

КонецПроцедуры

Процедура SSH_ЭтоКоннектор(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = 2223; // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SSH.ОткрытьСоединение(НастройкиSSH, НастройкиПрокси);
    Результат  = OPI_SSH.ЭтоКоннектор(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ЭтоКоннектор", Постфикс);

    Результат = OPI_SSH.ЭтоКоннектор("a");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ЭтоКоннектор", "Ошибка, " + Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиЛогинПароль(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["SSH_Host"];
    Порт   = ПараметрыФункции["SSH_Port"];
    Логин  = ПараметрыФункции["SSH_User"];
    Пароль = ПараметрыФункции["SSH_Password"];

    Результат = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ПолучитьНастройкиЛогинПароль", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиПриватныйКлюч(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост          = ПараметрыФункции["SSH_Host"];
    Порт          = ПараметрыФункции["SSH_Port"];
    Логин         = ПараметрыФункции["SSH_User"];
    ПриватныйКлюч = "./ssh_key";
    ПубличныйКлюч = "./ssh_key.pub";

    ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
    ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

    Результат = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ПолучитьНастройкиПриватныйКлюч", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиЧерезАгента(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост      = ПараметрыФункции["SSH_Host"];
    Порт      = ПараметрыФункции["SSH_Port"];
    Логин     = ПараметрыФункции["SSH_User"];
    Результат = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ПолучитьНастройкиЧерезАгента", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиKI(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["SSH_Host"];
    Порт   = ПараметрыФункции["SSH_Port"];
    Логин  = ПараметрыФункции["SSH_User"];
    Пароль = ПараметрыФункции["SSH_Password"];

    МассивОтветов = Новый Массив;
    МассивОтветов.Добавить("yes");
    МассивОтветов.Добавить(Пароль);

    Результат = OPI_SSH.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ПолучитьНастройкиKI", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиПрокси(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

    АдресПрокси  = ПараметрыФункции["Proxy_IP"];
    ПортПрокси   = ПараметрыФункции["Proxy_Port"];
    ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
    ПарольПрокси = ПараметрыФункции["Proxy_Password"];

    Результат = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SSH", "ПолучитьНастройкиПрокси", Постфикс);

КонецПроцедуры

#КонецОбласти // SSH

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции
