// OneScript: ./OInt/tools/http/Modules/internal/Classes/OPI_HTMLФорма.os
// Lib: HTML
// CLI: none
// Keywords: html

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:LineLength-off
// BSLLS:ExportVariables-off
// BSLLS:OneStatementPerLine-off
// BSLLS:MagicNumber-off
// BSLLS:CommonModuleNameClientServer-off
// BSLLS:NonStandardRegion-off

//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content
//@skip-check method-too-many-params
//@skip-check constructor-function-return-section
//@skip-check doc-comment-collection-item-type
//@skip-check object-module-export-variable

// #Использовать "../../../../main"

#Область ОписаниеПеременных // !OPI

Перем ЭлементыHTML;
Перем СтилиCSS;

Перем АтрибутыHtml;
Перем АтрибутыBody;
Перем АтрибутыHead;

Перем ТекущийЭлементФормы;

#КонецОбласти // !OPI

#Область ПрограммныйИнтерфейс

#Область Основные

Функция Инициализировать() Экспорт

	ЭлементыHTML = Новый ТаблицаЗначений;
	ЭлементыHTML.Колонки.Добавить("ID");
	ЭлементыHTML.Колонки.Добавить("ОткрывающийТэг");
	ЭлементыHTML.Колонки.Добавить("ЗакрывающийТэг");
	ЭлементыHTML.Колонки.Добавить("Артибуты");
	ЭлементыHTML.Колонки.Добавить("Стили");
	ЭлементыHTML.Колонки.Добавить("Классы");
	ЭлементыHTML.Колонки.Добавить("Содержимое");
	ЭлементыHTML.Колонки.Добавить("Родитель");
	ЭлементыHTML.Колонки.Добавить("Уровень");
	
	СтилиCSS = Новый Соответствие;
	
	АтрибутыHtml = Новый Соответствие;
	АтрибутыBody = Новый Соответствие;
	АтрибутыHead = Новый Соответствие;
	
	Возврат ЭтотОбъект;
	  
КонецФункции

Функция УстановитьАтрибутHtml(Знач Имя, Знач Значение) Экспорт
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Имя);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Значение);
	
	АтрибутыHtml.Вставить(Имя, Значение);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция УстановитьАтрибутHead(Знач Имя, Знач Значение) Экспорт
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Имя);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Значение);
	
	АтрибутыHead.Вставить(Имя, Значение);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция УстановитьАтрибутBody(Знач Имя, Знач Значение) Экспорт
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Имя);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Значение);
	
	АтрибутыBody.Вставить(Имя, Значение);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция СгенерироватьHTML(Знач РодительскийЭлемент = "") Экспорт
	
	ДочерниеЭлементы      = НайтиДочерние(РодительскийЭлемент, Ложь);
	МассивСгенерированных = Новый Массив;
	
	Для Каждого Дочерний Из ДочерниеЭлементы Цикл
		МассивСгенерированных.Добавить(СгенерироватьHTML(Дочерний["ID"]));
	КонецЦикла;
	
	ТекущийЭлемент = НайтиЭлемент(РодительскийЭлемент);
	
	Если ТекущийЭлемент <> Неопределено И ТекущийЭлемент["ОткрывающийТэг"] = "#raw" Тогда
		Возврат ТекущийЭлемент["Содержимое"];
	КонецЕсли;
	
	ШаблонЭлемента = СоздатьШаблонЭлемента(РодительскийЭлемент);
	ДочернийHTML   = СтрСоединить(МассивСгенерированных, Символы.ПС);
	
	Если Не ЗначениеЗаполнено(ДочернийHTML)
		И ТекущийЭлемент <> Неопределено
		И ЗначениеЗаполнено(ТекущийЭлемент["Содержимое"]) Тогда
		
		ДочернийHTML = ТекущийЭлемент["Содержимое"];
		
	КонецЕсли;
		
	HTML = СтрШаблон(ШаблонЭлемента, ДочернийHTML);
	
	Возврат HTML;
		
КонецФункции

#КонецОбласти

#Область Элементы

Функция ВставитьЭлемент(Знач IDЭлемента
	, Знач ОткрывающийТэг
	, Знач ЗакрывающийТэг = Истина
	, Знач Родитель = ""
	, Знач Атрибуты = Неопределено
	, Знач Стили = Неопределено
	, Знач Классы = Неопределено) Экспорт
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЭлемента);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(ОткрывающийТэг);
	OPI_ПреобразованиеТипов.ПолучитьБулево(ЗакрывающийТэг);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Родитель);
	
	Если НайтиЭлемент(IDЭлемента) <> Неопределено Тогда
		ВызватьИсключение СтрШаблон("Нельзя создать два элемента с одинаковым ID (%1)", IDЭлемента);
	КонецЕсли;
	
	ЭлементРодитель = НайтиЭлемент(Родитель);
	
	Если ЗначениеЗаполнено(Родитель) И ЭлементРодитель = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Элемент с указанным ID не найден (%1)", Родитель);
	КонецЕсли;
	
	Если ЭлементРодитель <> Неопределено И Не ЭлементРодитель["ЗакрывающийТэг"] Тогда
		ВызватьИсключение СтрШаблон("Элемент без закрывающего тэга не может быть родителем (%1)", Родитель);	
	КонецЕсли;
	
	Если Атрибуты <> Неопределено Тогда
		OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Атрибуты);
	Иначе
		Атрибуты = Новый Соответствие;
	КонецЕсли;
	
	Если Стили <> Неопределено Тогда
		OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Стили);
	Иначе
		Стили = Новый Соответствие;
	КонецЕсли;
	
	Если Классы <> Неопределено Тогда
		OPI_ПреобразованиеТипов.ПолучитьКоллекцию(Классы);
	Иначе
		Классы = Новый Массив;
	КонецЕсли;
	
	НовыйЭлемент = ЭлементыHTML.Добавить();
	НовыйЭлемент.ID             = IDЭлемента;
	НовыйЭлемент.ОткрывающийТэг = ОткрывающийТэг;
	НовыйЭлемент.ЗакрывающийТэг = ЗакрывающийТэг;
	НовыйЭлемент.Родитель       = Родитель;
	НовыйЭлемент.Атрибуты       = Атрибуты;
	НовыйЭлемент.Стили          = Стили;
	НовыйЭлемент.Классы         = Классы;

	НовыйЭлемент.Уровень = ?(ЗначениеЗаполнено(ЭлементРодитель)
		, ЭлементРодитель.Уровень + 1
		, 1);
	 
	 ТекущийЭлементФормы = НовыйЭлемент;
	 
	 Возврат ЭтотОбъект;
		
КонецФункции

Функция ВставитьСыройЭлемент(Знач IDЭлемента
	, Знач Родитель = ""
	, Знач Содержимое = "") Экспорт
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Содержимое);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЭлемента);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Родитель);
	
	Если НайтиЭлемент(IDЭлемента) <> Неопределено Тогда
		ВызватьИсключение СтрШаблон("Нельзя создать два элемента с одинаковым ID (%1)", IDЭлемента);
	КонецЕсли;
	
	ЭлементРодитель = НайтиЭлемент(Родитель);
	
	Если ЗначениеЗаполнено(Родитель) И ЭлементРодитель = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Элемент с указанным ID не найден (%1)", Родитель);
	КонецЕсли;
	
	Если ЭлементРодитель <> Неопределено И Не ЭлементРодитель["ЗакрывающийТэг"] Тогда
		ВызватьИсключение СтрШаблон("Элемент без закрывающего тэга не может быть родителем (%1)", Родитель);	
	КонецЕсли;

	
	НовыйЭлемент = ЭлементыHTML.Добавить();
	НовыйЭлемент.ID             = IDЭлемента;
	НовыйЭлемент.Родитель       = Родитель;
	НовыйЭлемент.Содержимое     = Содержимое;
	
	НовыйЭлемент.Уровень = ?(ЗначениеЗаполнено(ЭлементРодитель)
		, ЭлементРодитель.Уровень + 1
		, 1);
	 
	 ТекущийЭлементФормы = НовыйЭлемент;
	 
	 Возврат ЭтотОбъект;
		
КонецФункции

Функция ВставитьДочернийЭлемент(Знач IDЭлемента
	, Знач ОткрывающийТэг
	, Знач ЗакрывающийТэг = Истина
	, Знач Атрибуты = Неопределено
	, Знач Стили = Неопределено
	, Знач Классы = Неопределено) Экспорт
	
	Если ТекущийЭлементФормы = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Не задан текущий элемент-родитель для вставки дочернего элемента (%1)", IDЭлемента);
	КонецЕсли;
	
	Возврат ВставитьЭлемент(IDЭлемента
		, ОткрывающийТэг
		, ЗакрывающийТэг
		, ТекущийЭлементФормы["ID"]
		, Атрибуты
		, Стили
		, Классы);
		
КонецФункции

Функция ВставитьСыройДочернийЭлемент(Знач IDЭлемента, Знач Содержимое = "") Экспорт
	
	Если ТекущийЭлементФормы = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Не задан текущий элемент-родитель для вставки дочернего элемента (%1)", IDЭлемента);
	КонецЕсли;
	
	Возврат ВставитьСыройЭлемент(IDЭлемента
		, ТекущийЭлементФормы["ID"]
		, Содержимое);
		
КонецФункции

Функция УстановитьТекущийЭлемент(Знач IDЭлемента) Экспорт

	OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЭлемента);	
	СтрокаЭлемента = НайтиЭлемент(IDЭлемента);

	Если СтрокаЭлемента = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Элемент с указанным ID не найден (%1)", IDЭлемента);
	КонецЕсли;
	
	ТекущийЭлементФормы = СтрокаЭлемента;
	
	Возврат ЭтотОбъект;
			
КонецФункции

Функция УдалитьЭлемент(Знач IDЭлемента = "") Экспорт
	
	СтрокаЭлемента = НайтиЭлемент(IDЭлемента);

	Если СтрокаЭлемента = Неопределено Тогда
		Возврат ЭтотОбъект;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(IDЭлемента) Тогда
		ТекущийЭлементФормы = Неопределено;
	КонецЕсли;
				
	УдаляемыеЭлементы = НайтиДочерние(IDЭлемента);
	УдаляемыеЭлементы.Добавить(СтрокаЭлемента);
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		ЭлементыHTML.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция УстановитьАтрибут(Знач Имя, Знач Значение, Знач IDЭлемента = "") Экспорт

	СтрокаЭлемента = НайтиЭлемент(IDЭлемента);

	Если СтрокаЭлемента = Неопределено Тогда
		
		ТекстОшибки = ?(ЗначениеЗаполнено(IDЭлемента)
			, СтрШаблон("Элемент с указанным ID не найден (%1)", IDЭлемента)
			, "Не задан текущий элемент для установки атрибута");
			
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Имя);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Значение);
	
	СтрокаЭлемента["Атрибуты"].Вставить(Имя, Значение);
	
	Возврат ЭтотОбъект;
		
КонецФункции

Функция ДобавитьКласс(Знач ИмяКласса, Знач IDЭлемента = "") Экспорт

	СтрокаЭлемента = НайтиЭлемент(IDЭлемента);

	Если СтрокаЭлемента = Неопределено Тогда
		
		ТекстОшибки = ?(ЗначениеЗаполнено(IDЭлемента)
			, СтрШаблон("Элемент с указанным ID не найден (%1)", IDЭлемента)
			, "Не задан текущий элемент для добавления класса");
			
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(ИмяКласса);
	СтрокаЭлемента["Классы"].Добавить(ИмяКласса);
	
	Возврат ЭтотОбъект;
		
КонецФункции

Функция НаУровеньВыше() Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущийЭлементФормы) Тогда
		ВызватьИсключение "Не задан текущий элемент формы!";
	КонецЕсли;
	
	СтрокаЭлемента = НайтиЭлемент(ТекущийЭлементФормы["Родитель"]);

	Если СтрокаЭлемента = Неопределено Тогда	
		ВызватьИсключение "У данного элемента нет родителя!";
	КонецЕсли;
	
	ТекущийЭлементФормы = СтрокаЭлемента;
	
	Возврат ЭтотОбъект;
	
КонецФункции
	
#КонецОбласти

#Область Стили

Функция УстановитьСвойствоКласса(Знач Класс, Знач Свойство, Знач Значение, Знач Создавать = Истина) Экспорт
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Класс);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Свойство);
	OPI_ПреобразованиеТипов.ПолучитьБулево(Создавать);
	
	НаборСвойств = СтилиCSS.Получить(Класс);
	
	Если НаборСвойств = Неопределено Тогда
		
		Если Не Создавать Тогда
			ВызватьИсключение СтрШаблон("Класс не найден (%1)", Класс);
		КонецЕсли;
		
		НаборСвойств = Новый Соответствие;
		СтилиCSS.Вставить(Класс, НаборСвойств);
		
	КонецЕсли;
	
	НаборСвойств.Вставить(Свойство, OPI_Инструменты.ЧислоВСтроку(Значение));
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция СоздатьКласс(Знач Имя, Знач НаборСтилей = Неопределено, Знач Перезаписывать = Ложь) Экспорт
		
	OPI_ПреобразованиеТипов.ПолучитьБулево(Перезаписывать);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Имя);
	
	Если Не Перезаписывать И Не СтилиCSS.Получить(Имя) = Неопределено Тогда
		
		Шаблон = "Нельзя перезаписать существующий стиль (%1) без явного указания Перезаписывать = Истина!";
		ВызватьИсключение СтрШаблон(Шаблон, Имя);
			
	КонецЕсли;
	
	Если НаборСтилей <> Неопределено Тогда
		
		OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(НаборСтилей);
		СтилиCSS.Вставить(Имя, НаборСтилей);
		
	Иначе
		СтилиCSS.Вставить(Имя, Новый Соответствие);
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиЭлемент(Знач IDЭлемента, Знач ИспользоватьТекущий = Ложь)
	
	Если ЗначениеЗаполнено(IDЭлемента) Тогда
		
		OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЭлемента);	

		СтрокиТаблицы = ЭлементыHTML.НайтиСтроки(Новый Структура("ID", IDЭлемента));
	
		Возврат ?(СтрокиТаблицы.Количество() > 0, СтрокиТаблицы[0], Неопределено);
			
	Иначе
		Возврат ТекущийЭлементФормы;
	КонецЕсли;
	
КонецФункции

Функция НайтиДочерние(Знач IDЭлемента, Знач Рекурсивно = Истина)

	СтрокиТаблицы = ЭлементыHTML.НайтиСтроки(Новый Структура("Родитель", IDЭлемента));
	
	Если Рекурсивно Тогда
	
		Для Каждого ДочернийЭлемент Из СтрокиТаблицы Цикл
			
			IDДочернего = ДочернийЭлемент["ID"];
			
			Для Каждого СтрокаДочернего Из НайтиДочерние(IDДочернего, Истина) Цикл
				СтрокиТаблицы.Добавить(СтрокаДочернего);	
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрокиТаблицы;
	
КонецФункции

Функция СоздатьШаблонЭлемента(Знач IDЭлемента) Экспорт

	Если IDЭлемента = "" Тогда
		Возврат СоздатьОсновнойШаблон();
	КонецЕсли;
	
	ТекущийЭлемент = НайтиЭлемент(IDЭлемента);
	
	Если ТекущийЭлемент = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Элемент с указанным ID не найден (%1)", IDЭлемента);
	КонецЕсли;
	
	ОткрывающийТэг = ТекущийЭлемент["ОткрывающийТэг"];
	ЗакрывающийТэг = ТекущийЭлемент["ЗакрывающийТэг"];
	Уровень        = ТекущийЭлемент["Уровень"];
	
	Атрибуты = ТекущийЭлемент["Атрибуты"];
	Стили    = ТекущийЭлемент["Стили"];
	Классы   = ТекущийЭлемент["Классы"];
	
	ТекстАртибутов = СформироватьТекстАртибутов(Атрибуты, Стили, Классы);
	
	Если ЗакрывающийТэг Тогда
		
		ОсновнойШаблон = "%1<%2%3>
		|    %1%%1
		|%1</%2>";
		
	Иначе
		ОсновнойШаблон = "%1<%2%3/>";
	КонецЕсли;
	
	СтрокаФормата     = СтрШаблон("ЧЦ=%1; ЧН=; ЧВН=; ЧГ=0", (Уровень - 1) * 4);
	ОтступВложенности = СтрЗаменить(Формат(0, СтрокаФормата), "0", " ");
	
	Отступ = СтрШаблон("%1%2", "        ", ОтступВложенности);
	
	HTML = СтрШаблон(ОсновнойШаблон, Отступ, ОткрывающийТэг, ТекстАртибутов);
	
	Возврат HTML;
		
КонецФункции

Функция СоздатьОсновнойШаблон()
	
	ОсновнойШаблон = "<!DOCTYPE html>
		|<html %2>
		|    <head %3>
		|        <meta charset=""UTF-8"">
		|        <meta name=""viewport"" content=""width=device-width, initial-scale=1.0"">
		|        <style>
		|%1
		|        </style>
		|    </head>
		|    <body %4>
		|%%1
		|    </body>
		|</html>";
		
	Возврат СтрШаблон(ОсновнойШаблон
		, СформироватьCSS()
		, СформироватьТекстАртибутов(АтрибутыHtml)
		, СформироватьТекстАртибутов(АтрибутыHead)
		, СформироватьТекстАртибутов(АтрибутыBody));

КонецФункции

Функция СформироватьCSS()
	
	ШаблонНачалаКласса = "            %1 {";
	ШаблонКонцаКласса  = "            }";
	ШаблонСвойства     = "              %1: %2;";
	
	МассивСтрок = Новый Массив;
	
	Для Каждого Класс Из СтилиCSS Цикл
		
		МассивСтрок.Добавить(СтрШаблон(ШаблонНачалаКласса, Класс.Ключ));
		
		Для Каждого СвойствоКласса Из Класс.Значение Цикл
			МассивСтрок.Добавить(СтрШаблон(ШаблонСвойства, СвойствоКласса.Ключ, СвойствоКласса.Значение));
		КонецЦикла;
		
		МассивСтрок.Добавить(ШаблонКонцаКласса);
		МассивСтрок.Добавить("");
				
	КонецЦикла;
	
	Возврат СтрСоединить(МассивСтрок, Символы.ПС);
	
КонецФункции

Функция СформироватьТекстАртибутов(Знач Атрибуты, Знач Стили = "", Знач Классы = "")
	
	ШаблонАтрибута  = "%1=""%2""";
	МассивАтрибутов = Новый Массив;
	
	Для Каждого Атрибут Из Атрибуты Цикл
		
		КлючАтрибута     = Атрибут.Ключ;
		ЗначениеАтрибута = OPI_Инструменты.ЧислоВСтроку(Атрибут.Значение);
		
		МассивАтрибутов.Добавить(СтрШаблон(ШаблонАтрибута, КлючАтрибута, ЗначениеАтрибута));
		
	КонецЦикла;
			
	Если ЗначениеЗаполнено(Стили) Тогда
		
		ШаблонСтилей = "style=""%1""";
		ШаблонСтиля  = "%1:%2";
		МассивСтилей = Новый Массив;
		
		Для Каждого Стиль Из Стили Цикл
			МассивСтилей.Добавить(СтрШаблон(ШаблонСтиля, Стиль.Ключ, Стиль.Значение));
		КонецЦикла;
		
		МассивАтрибутов.Добавить(СтрШаблон(ШаблонСтилей, СтрСоединить(МассивСтилей, ";")));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Классы) Тогда
		
		ШаблонСтилей = "class=""%1""";
		МассивАтрибутов.Добавить(СтрШаблон(ШаблонСтилей, СтрСоединить(Классы, " ")));
		
	КонецЕсли;
	
	Возврат СтрСоединить(МассивАтрибутов, " ");
	
КонецФункции

#КонецОбласти

