#Использовать "../../tools"

Перем ОбъектОПИ;

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриСозданииОбъекта()

	ОбъектОПИ = Новый СвязьОПИ; 

КонецПроцедуры

Процедура ВывестиНачальнуюСтраницу() Экспорт
	
	СписокКоманд = "";
	Модули 		 = ОбъектОПИ.ПолучитьИмяМодуля();

	Для Каждого Команда Из Модули Цикл
		СписокКоманд = СписокКоманд + Команда.Ключ + ", ";
	КонецЦикла;

	СписокКоманд = Лев(СписокКоманд, СтрДлина(СписокКоманд) - 2);

	Сообщить("-----------------------------------------------------", СтатусСообщения.Информация);
	Сообщить("
		|
		|    _______ _____________  ___  _______
		|    __  __ ___/__  _/_ /  |  / /___  __/
		|    _  / / / __  /  __      / __  /   
		|    / /_/ / __/ /   _  /|  /  _  /    
		|    \____/  /___/   /_/ |_/   /_/     
		|                          
		|
		| Добро пожаловать в OInt!
		|
		| Структура команд:
		| OInt БИБЛИОТЕКА ""МЕТОД"" [Параметры]
		|
		| Вызов библиотеки без метода или метода без параметров возвращает справку
		| Список доступных библиотек: " 
		+ СписокКоманд 
		+ "
		|", СтатусСообщения.Внимание);
	
	Сообщить("Полную документацию можно найти по адресу: https://opi.neocities.org" + Символы.ПС
		, СтатусСообщения.Информация);
	
КонецПроцедуры

Процедура ВывестиСправкуПоМетодам(Знач Команда, Знач ТаблицаПараметров) Экспорт

	Сообщить(Символы.ПС + " ## Команда - " + Команда, СтатусСообщения.Информация);

	ТаблицаПараметров.Свернуть("Метод");
	МассивМетодов = ТаблицаПараметров.ВыгрузитьКолонку("Метод");

	Сообщить(" ## Доступные методы: " + Символы.ПС, СтатусСообщения.Информация);

	Для каждого Метод Из МассивМетодов Цикл
		Сообщить("    - " + Метод, СтатусСообщения.Внимание);
	КонецЦикла;

	Сообщить(Символы.ПС);

КонецПроцедуры

Процедура ВывестиСправкуПоПараметрам(Знач ТаблицаПараметров, Знач Команда) Экспорт 

	Если ТаблицаПараметров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ИмяМетода    		= ТаблицаПараметров[0].Метод;
	ТекстСправки 		= "";

	Сообщить("
	| ## Метод " + ИмяМетода + "
	| ## "       + ТаблицаПараметров[0].ОписаниеМетода + "
	| "          + ОбъектОПИ.ДополнениеОписанияПараметров[Команда] + "
	| ", СтатусСообщения.Информация);

	ОбработатьТабуляциюСправки(ТаблицаПараметров);

	Для Каждого ПараметрМетода Из ТаблицаПараметров Цикл

		ТекстСправки = ТекстСправки 
			+ Символы.ПС
			+ "    "
			+ ПараметрМетода["Параметр"]
			+ " - "
			+ ПараметрМетода["Описание"];

	КонецЦикла;

	Сообщить(ТекстСправки + Символы.ПС, СтатусСообщения.Внимание);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьТабуляциюСправки(ТаблицаПараметров)

	МаксимальнаяДлина 	= 0;

	Для Каждого ПараметрМетода Из ТаблицаПараметров Цикл
			
		ДлинаТекущего     = СтрДлина(ПараметрМетода["Параметр"]);
		МаксимальнаяДлина = ?(ДлинаТекущего > МаксимальнаяДлина, ДлинаТекущего, МаксимальнаяДлина);

		Пока Не СтрДлина(ПараметрМетода["Параметр"]) = МаксимальнаяДлина Цикл
			ПараметрМетода["Параметр"] = ПараметрМетода["Параметр"] + " ";
		КонецЦикла;

		ТекущееОписание    = ПараметрМетода["Описание"];
		МассивОписания     = СтрРазделить(ТекущееОписание, Символы.ПС);
		НачальнаяТабуляция = 4;

		Если МассивОписания.Количество() = 1 Тогда
			Продолжить;
		Иначе

			Для Н = 1 По МассивОписания.ВГраница() Цикл

				ТекущийЭлемент = МассивОписания[Н];
				НеобходимаяДлина = СтрДлина(ТекущийЭлемент) + СтрДлина(ПараметрМетода["Параметр"] + " - ") + НачальнаяТабуляция;

				Пока СтрДлина(МассивОписания[Н]) < НеобходимаяДлина Цикл
					МассивОписания[Н] = " " + МассивОписания[Н];
				КонецЦикла;

			КонецЦикла;

			ПараметрМетода["Описание"] = СтрСоединить(МассивОписания, Символы.ПС);	
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

ПриСозданииОбъекта();
