// OneScript: ./OInt/tests/Modules/internal/OPI_Тесты.os

// MIT License

// Copyright (c) 2023-2025 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

// Раскомментировать, если выполняется OneScript
// #Использовать oint
// #Использовать asserts

#Область СлужебныйПрограммныйИнтерфейс

// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯкс();

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертс();

КонецФункции

#Область ЗапускаемыеТесты

#Область Служебные

Процедура ПроверитьСоответствиеИБПоследнейСборке() Экспорт

    Если OPI_ПолучениеДанныхТестов.ЭтоТестCLI() Тогда

        //@skip-check use-non-recommended-method
        Сообщить("CLI test check for hash sum");
        СуммаСборки = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("hashsum", "", Новый Структура);

    Иначе

        СуммаСборки = OPI_Инструменты.ПолучитьХешСуммуПоследнейСборки();

    КонецЕсли;

    URL = "https://raw.githubusercontent.com/Bayselonarrend/OpenIntegrations/refs/heads/main/service/last_build_hash.txt";

    СуммаПоследний = OPI_ЗапросыHTTP
        .НовыйЗапрос()
        .Инициализировать(URL)
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакСтроку(Ложь, Истина);

    Обработать(СуммаСборки, "BuildCheck", "ПроверитьСоответствиеИБПоследнейСборке", , СуммаПоследний);

КонецПроцедуры

#КонецОбласти

#Область Telegram

Процедура Телеграм_ПолучитьИнформациюБота() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token", ПараметрыТеста);

    Telegram_ПолучитьИнформациюБота(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ПолучитьОбновления() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token", ПараметрыТеста);

    Telegram_УдалитьWebhook(ПараметрыТеста);
    Telegram_ПолучитьОбновления(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_УстановитьWebhook() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_URL"  , ПараметрыТеста);

    Telegram_УстановитьWebhook(ПараметрыТеста);
    Telegram_УдалитьWebhook(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьТекстовоеСообщение() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("String"            , ПараметрыТеста);

    Telegram_ОтправитьТекстовоеСообщение(ПараметрыТеста);
    Telegram_ЗаменитьТекстСообщения(ПараметрыТеста);
    Telegram_ЗаменитьКлавиатуруСообщения(ПараметрыТеста);
    Telegram_СформироватьКлавиатуруПоМассивуКнопок(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьКартинку() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("String"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"           , ПараметрыТеста);

    Telegram_ОтправитьКартинку(ПараметрыТеста);
    Telegram_ЗаменитьОписаниеСообщения(ПараметрыТеста);
    Telegram_СкачатьФайл(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьВидео() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("String"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video"             , ПараметрыТеста);

    Telegram_ОтправитьВидео(ПараметрыТеста);
    Telegram_СкачатьФайл(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьАудио() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("String"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Audio"             , ПараметрыТеста);

    Telegram_ОтправитьАудио(ПараметрыТеста);
    Telegram_СкачатьФайл(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьДокумент() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("String"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"          , ПараметрыТеста);

    Telegram_ОтправитьДокумент(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьГифку() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("String"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GIF"               , ПараметрыТеста);

    Telegram_ОтправитьГифку(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьМедиагруппу() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("String"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"           , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video"             , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"          , ПараметрыТеста);

    Telegram_ОтправитьМедиагруппу(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьМестоположение() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Long"              , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Lat"               , ПараметрыТеста);

    Telegram_ОтправитьМестоположение(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьКонтакт() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Name"              , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Surname"           , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Phone"             , ПараметрыТеста);

    Telegram_ОтправитьКонтакт(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ОтправитьОпрос() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);

    Telegram_ОтправитьОпрос(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ПереслатьСообщение() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"           , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"          , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelMessageID", ПараметрыТеста);

    Telegram_ПереслатьСообщение(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_БанРазбан() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);

    Telegram_Бан(ПараметрыТеста);
    Telegram_Разбан(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_СоздатьСсылкуПриглашение() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);

    Telegram_СоздатьСсылкуПриглашение(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ЗакрепитьОткрепитьСообщение() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"           , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelMessageID", ПараметрыТеста);

    Telegram_ЗакрепитьСообщение(ПараметрыТеста);
    Telegram_ОткрепитьСообщение(ПараметрыТеста);
    Telegram_УдалитьСообщение(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ПолучитьЧислоУчастников() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ChannelID", ПараметрыТеста);

    Telegram_ПолучитьЧислоУчастников(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ПолучитьСписокАватаровФорума() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token", ПараметрыТеста);

    Telegram_ПолучитьСписокИконокАватаров(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_СоздатьУдалитьТемуФорума() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ForumID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("String"          , ПараметрыТеста);

    Telegram_СоздатьТемуФорума(ПараметрыТеста);
    Telegram_ИзменитьТемуФорума(ПараметрыТеста);
    Telegram_ЗакрытьТемуФорума(ПараметрыТеста);
    Telegram_ОткрытьТемуФорума(ПараметрыТеста);
    Telegram_ОчиститьСписокЗакрепленныхСообщенийТемы(ПараметрыТеста);
    Telegram_УдалитьТемуФорума(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_СкрытьПоказатьГлавнуюТему() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ForumID", ПараметрыТеста);

    Telegram_СкрытьГлавнуюТемуФорума(ПараметрыТеста);
    Telegram_ПоказатьГлавнуюТемуФорума(ПараметрыТеста);

КонецПроцедуры

Процедура Телеграм_ИзменитьИмяГлавнойТемы() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Telegram_ForumID", ПараметрыТеста);

    Telegram_ИзменитьИмяГлавнойТемыФорума(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область VK

Процедура ВК_СоздатьСсылкуТокена() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VK_AppID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VK_GroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VK_Token"  , ПараметрыТеста);

    VK_СоздатьСсылкуПолученияТокена(ПараметрыТеста);
    VK_ПолучитьПараметрыАвторизации(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_СоздатьУдалитьПост() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2", ПараметрыТеста);

    VK_СоздатьПост(ПараметрыТеста);
    VK_УдалитьПост(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_СоздатьСоставнойПост() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video"  , ПараметрыТеста);

    VK_СоздатьСоставнойПост(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_СоздатьОпрос() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture", ПараметрыТеста);

    VK_СоздатьОпрос(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_СохранитьУдалитьКартинку() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture", ПараметрыТеста);

    VK_СоздатьАльбом(ПараметрыТеста);
    VK_СохранитьКартинкуВАльбом(ПараметрыТеста);
    VK_УдалитьКартинку(ПараметрыТеста);
    VK_УдалитьАльбом(ПараметрыТеста);
    VK_ЗагрузитьФотоНаСервер(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_СоздатьИсторию() Экспорт

    ПараметрыТеста = Новый Соответствие;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture", ПараметрыТеста);

    VK_СоздатьИсторию(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_МетодыОбсуждений() Экспорт

    ПараметрыТеста = Новый Структура;
    Параметры      = ПолучитьПараметрыВК();

    VK_СоздатьОбсуждение(ПараметрыТеста);
    VK_ЗакрытьОбсуждение(ПараметрыТеста);
    VK_ОткрытьОбсуждение(ПараметрыТеста);
    VK_НаписатьВОбсуждение(ПараметрыТеста);

    OPI_VK.ЗакрытьОбсуждение(ПараметрыТеста["VK_ConvID"], Истина, Параметры);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ВК_ЛайкРепостКоммент() Экспорт

    ПараметрыТеста = Новый Структура;
    Параметры      = ПолучитьПараметрыВК();
    Текст          = "Пост из автотеста";

    Результат = OPI_VK.СоздатьПост(Текст, Новый Массив, , , Параметры);
    ИДПоста   = Результат["response"]["post_id"];

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("VK_PostID", ИДПоста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VK_PostID", ПараметрыТеста);

    VK_ПоставитьЛайк(ПараметрыТеста);
    VK_СделатьРепост(ПараметрыТеста);
    VK_НаписатьКомментарий(ПараметрыТеста);
    VK_СократитьСсылку(ПараметрыТеста);

    OPI_VK.УдалитьПост(ИДПоста                 , Параметры);
    OPI_VK.УдалитьПост(ПараметрыТеста["Repost"], Параметры);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ВК_ПолучитьСтатистику() Экспорт

    ПараметрыТеста = Новый Структура;

    VK_ПолучитьСтатистику(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ВК_ПолучитьСтатистикуПостов() Экспорт

    ПараметрыТеста = Новый Структура;

    VK_ПолучитьСтатистикуПостов(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ВК_СоздатьРекламнуюКампанию() Экспорт

    Параметры = ПолучитьПараметрыВК();
    Текст     = "Пост из автотеста";

    Результат = OPI_VK.СоздатьПост(Текст, Новый Массив, , , Параметры);
    ИДПоста   = Результат["response"]["post_id"];

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("VK_PostID", ИДПоста);

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VK_AdsCabinetID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VK_PostID"      , ПараметрыТеста);

    // !DISABLED! VK_СоздатьРекламнуюКампанию(ПараметрыТеста);
    // !DISABLED! VK_СоздатьРекламноеОбъявление(ПараметрыТеста);
    // !DISABLED! VK_ПриостановитьРекламноеОбъявление(ПараметрыТеста);
    VK_ПолучитьСписокРекламныхКатегорий(ПараметрыТеста);

    OPI_VK.УдалитьПост(ИДПоста, Параметры);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ВК_ОтправитьСообщение() Экспорт

    ПараметрыТеста = Новый Структура;

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VK_UserID"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VK_CommunityToken", ПараметрыТеста);

    VK_СформироватьКлавиатуру(ПараметрыТеста);
    VK_НаписатьСообщение(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ВК_ПолучитьКатегорииТоваров() Экспорт

    ПараметрыТеста = Новый Структура;

    VK_ПолучитьСписокКатегорийТоваров(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ВК_СоздатьТоварПодборку() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2", ПараметрыТеста);

    VK_СоздатьПодборкуТоваров(ПараметрыТеста);
    VK_ИзменитьПодборкуТоваров(ПараметрыТеста);
    VK_ПолучитьПодборкиПоИД(ПараметрыТеста);
    VK_ДобавитьТовар(ПараметрыТеста);
    VK_ИзменитьТовар(ПараметрыТеста);
    VK_ДобавитьТоварВПодборку(ПараметрыТеста);
    VK_УдалитьТоварИзПодборки(ПараметрыТеста);
    VK_УдалитьТовар(ПараметрыТеста);
    VK_УдалитьПодборку(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ВК_СоздатьТоварСоСвойствами() Экспорт

    Параметры = ПолучитьПараметрыВК();

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2", ПараметрыТеста);

    VK_ПолучитьОписаниеТовара(ПараметрыТеста);
    VK_СоздатьСвойствоТовара(ПараметрыТеста);
    VK_ИзменитьСвойствоТовара(ПараметрыТеста);
    VK_ДобавитьВариантСвойстваТовара(ПараметрыТеста);
    VK_ИзменитьВариантСвойстваТовара(ПараметрыТеста);
    VK_СоздатьТоварСоСвойством(ПараметрыТеста);
    VK_ПолучитьТоварыПоИД(ПараметрыТеста);
    VK_СгруппироватьТовары(ПараметрыТеста);

    OPI_VK.УдалитьТовар(ПараметрыТеста["VK_MarketItemID2"], Параметры);
    OPI_VK.УдалитьТовар(ПараметрыТеста["VK_MarketItemID3"], Параметры);

    VK_УдалитьВариантСвойстваТовара(ПараметрыТеста);
    VK_УдалитьСвойствоТовара(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_ПолучитьСписокТоваров() Экспорт

    ПараметрыТеста = Новый Структура;

    VK_ПолучитьСписокТоваров(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_ПолучитьСписокПодборок() Экспорт

    ПараметрыТеста = Новый Структура;

    VK_ПолучитьСписокПодборок(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_ПолучитьСписокСвойств() Экспорт

    ПараметрыТеста = Новый Структура;

    VK_ПолучитьСписокСвойств(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_ПолучитьСписокЗаказов() Экспорт

    ПараметрыТеста = Новый Структура;

    VK_ПолучитьСписокЗаказов(ПараметрыТеста);

КонецПроцедуры

Процедура ВК_ЗагрузитьВидео() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video", ПараметрыТеста);

    VK_ЗагрузитьВидеоНаСервер(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область YandexDisk

Процедура ЯДиск_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_ClientID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_ClientSecret", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_RefreshToken", ПараметрыТеста);

    YandexDisk_ПолучитьКодПодтверждения(ПараметрыТеста);
    YandexDisk_ПреобразоватьКодВТокен(ПараметрыТеста);
    YandexDisk_ОбновитьТокен(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_ПолучитьИнформациюОДиске() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);

    YandexDisk_ПолучитьИнформациюОДиске(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_СоздатьПапку() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);

    YandexDisk_СоздатьПапку(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_ЗагрузитьПоАдресуПолучитьОбъект() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    YandexDisk_ЗагрузитьФайлПоURL(ПараметрыТеста);
    YandexDisk_ПолучитьОбъект(ПараметрыТеста);
    YandexDisk_УдалитьОбъект(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_ЗагрузитьУдалитьФайл() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Audio"           , ПараметрыТеста);

    YandexDisk_ЗагрузитьФайлЧастями(ПараметрыТеста);
    YandexDisk_ЗагрузитьФайл(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_СоздатьКопиюОбъекта() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    Токен = ПараметрыТеста["YandexDisk_Token"];
    URL   = ПараметрыТеста["Picture"];

    ПутьОригинала = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, ПутьОригинала, URL);
    OPI_Инструменты.Пауза(35);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("YandexDisk_OriginalFilePath", ПутьОригинала);
    ПараметрыТеста.Вставить("YandexDisk_OriginalFilePath", ПутьОригинала);

    YandexDisk_СоздатьКопиюОбъекта(ПараметрыТеста);

    ПутьКопии = ПараметрыТеста["YandexDisk_CopyFilePath"];

    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьОригинала, Ложь);
    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьКопии    , Ложь);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ЯДиск_ПолучитьСсылкуНаСкачивание() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    Токен = ПараметрыТеста["YandexDisk_Token"];
    URL   = ПараметрыТеста["Picture"];

    Путь = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, Путь, URL);
    OPI_Инструменты.Пауза(35);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("YandexDisk_PathForLink", Путь);
    ПараметрыТеста.Вставить("YandexDisk_PathForLink", Путь);

    YandexDisk_ПолучитьСсылкуДляСкачивания(ПараметрыТеста);
    YandexDisk_СкачатьФайл(ПараметрыТеста);

    OPI_YandexDisk.УдалитьОбъект(Токен, Путь, Ложь);

КонецПроцедуры

Процедура ЯДиск_ПолучитьСписокФайлов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);

    YandexDisk_ПолучитьСписокФайлов(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_ПереместитьОбъект() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    Токен = ПараметрыТеста["YandexDisk_Token"];
    URL   = ПараметрыТеста["Picture"];

    ПутьОригинала = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, ПутьОригинала, URL);
    OPI_Инструменты.Пауза(35);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("YandexDisk_OriginalFilePath", ПутьОригинала);
    ПараметрыТеста.Вставить("YandexDisk_OriginalFilePath", ПутьОригинала);

    YandexDisk_ПереместитьОбъект(ПараметрыТеста);

    ПутьНового = ПараметрыТеста["YandexDisk_NewFilePath"];

    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьОригинала, Ложь);
    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьНового   , Ложь);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ЯДиск_ДействияПубличныхОбъектов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    Токен = ПараметрыТеста["YandexDisk_Token"];
    URL   = ПараметрыТеста["Picture"];

    ПутьОригинала = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, ПутьОригинала, URL);
    OPI_Инструменты.Пауза(35);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("YandexDisk_OriginalFilePath", ПутьОригинала);
    ПараметрыТеста.Вставить("YandexDisk_OriginalFilePath", ПутьОригинала);

    YandexDisk_ОпубликоватьОбъект(ПараметрыТеста);
    YandexDisk_ПолучитьСсылкуСкачиванияПубличногоОбъекта(ПараметрыТеста);
    YandexDisk_ПолучитьПубличныйОбъект(ПараметрыТеста);
    YandexDisk_СохранитьПубличныйОбъектНаДиск(ПараметрыТеста);
    YandexDisk_ОтменитьПубликациюОбъекта(ПараметрыТеста);

    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьОригинала, Ложь);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ЯДиск_ПолучитьСписокОпубликованных() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);

    YandexDisk_ПолучитьСписокОпубликованныхОбъектов(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область Viber

Процедура Вайбер_ПолучениеИнформации() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Viber_ChannelToken"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Viber_ChannelAdminID", ПараметрыТеста);

    Возврат;

    //@skip-check unreachable-statements
    // BSLLS:UnreachableCode-off

    Viber_ПолучитьИнформациюОКанале(ПараметрыТеста);
    Viber_ПолучитьДанныеПользователя(ПараметрыТеста);
    Viber_ПолучитьОнлайнПользователей(ПараметрыТеста);
    Viber_УстановитьWebhook(ПараметрыТеста);

    // BSLLS:UnreachableCode-on

КонецПроцедуры

Процедура Вайбер_ОтправкаСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Viber_ChannelToken"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Viber_ChannelAdminID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Viber_Token"         , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Viber_UserID"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"            , ПараметрыТеста);

    Viber_СформироватьКлавиатуруИзМассиваКнопок(ПараметрыТеста);

    Возврат;

    //@skip-check unreachable-statement
    // BSLLS:UnreachableCode-off

    Viber_ОтправитьТекстовоеСообщение(ПараметрыТеста);
    Viber_ОтправитьКартинку(ПараметрыТеста);
    Viber_ОтправитьФайл(ПараметрыТеста);
    Viber_ОтправитьКонтакт(ПараметрыТеста);
    Viber_ОтправитьЛокацию(ПараметрыТеста);
    Viber_ОтправитьСсылку(ПараметрыТеста);

    // BSLLS:UnreachableCode-on

КонецПроцедуры

#КонецОбласти

#Область GoogleWorkspace

Процедура ГВ_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientSecret", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Code"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Refresh"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ServiceData" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Access_Token"       , ПараметрыТеста);

    GoogleWorkspace_СформироватьСсылкуПолученияКода(ПараметрыТеста);
    GoogleWorkspace_ПолучитьТокенПоКоду(ПараметрыТеста);
    GoogleWorkspace_ОбновитьТокен(ПараметрыТеста);
    GoogleWorkspace_ПолучитьТокенServiceАккаунта(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область GoogleCalendar

Процедура ГК_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientSecret", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Code"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Refresh"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ServiceData" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Access_Token"       , ПараметрыТеста);

    GoogleCalendar_СформироватьСсылкуПолученияКода(ПараметрыТеста);
    GoogleCalendar_ПолучитьТокенПоКоду(ПараметрыТеста);
    GoogleCalendar_ОбновитьТокен(ПараметрыТеста);
    GoogleCalendar_ПолучитьТокенServiceАккаунта(ПараметрыТеста);

КонецПроцедуры

Процедура ГК_ПолучитьСписокКалендарей() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);

    GoogleCalendar_ПолучитьСписокКалендарей(ПараметрыТеста);

КонецПроцедуры

Процедура ГК_СоздатьУдалитьКалендарь() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);

    GoogleCalendar_СоздатьКалендарь(ПараметрыТеста);
    GoogleCalendar_ИзменитьМетаданныеКалендаря(ПараметрыТеста);
    GoogleCalendar_ПолучитьМетаданныеКалендаря(ПараметрыТеста);
    GoogleCalendar_ДобавитьКалендарьВСписок(ПараметрыТеста);
    GoogleCalendar_ИзменитьКалендарьСписка(ПараметрыТеста);
    GoogleCalendar_ПолучитьКалендарьСписка(ПараметрыТеста);
    GoogleCalendar_ОчиститьОсновнойКалендарь(ПараметрыТеста);
    GoogleCalendar_УдалитьКалендарьИзСписка(ПараметрыТеста);
    GoogleCalendar_УдалитьКалендарь(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ГК_СоздатьУдалитьСобытие() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_NewCalendarID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_CalendarID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2"            , ПараметрыТеста);

    GoogleCalendar_СоздатьКалендарь(ПараметрыТеста);
    GoogleCalendar_СоздатьСобытие(ПараметрыТеста);
    GoogleCalendar_ИзменитьСобытие(ПараметрыТеста);
    GoogleCalendar_ПолучитьСобытие(ПараметрыТеста);
    GoogleCalendar_ПереместитьСобытие(ПараметрыТеста);
    GoogleCalendar_ПолучитьСписокСобытий(ПараметрыТеста);
    GoogleCalendar_ПолучитьОписаниеСобытия(ПараметрыТеста);
    GoogleCalendar_УдалитьСобытие(ПараметрыТеста);
    GoogleCalendar_УдалитьКалендарь(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

#КонецОбласти

#Область GoogleDrive

Процедура ГД_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientSecret", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Code"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Refresh"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ServiceData" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Access_Token"       , ПараметрыТеста);

    GoogleDrive_СформироватьСсылкуПолученияКода(ПараметрыТеста);
    GoogleDrive_ПолучитьТокенПоКоду(ПараметрыТеста);
    GoogleDrive_ОбновитьТокен(ПараметрыТеста);
    GoogleDrive_ПолучитьТокенServiceАккаунта(ПараметрыТеста);

КонецПроцедуры

Процедура ГД_ПолучитьСписокКаталогов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);

    GoogleDrive_ПолучитьСписокКаталогов(ПараметрыТеста);
    GoogleDrive_ПолучитьИнформациюОбОбъекте(ПараметрыТеста);

КонецПроцедуры

Процедура ГД_ЗагрузитьУдалитьФайл() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GD_Catalog"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Big"         , ПараметрыТеста);

    ПараметрыТеста.Вставить("МассивУдаляемых", Новый Массив);

    GoogleDrive_ЗагрузитьФайл(ПараметрыТеста);
    GoogleDrive_СкопироватьОбъект(ПараметрыТеста);
    GoogleDrive_СкачатьФайл(ПараметрыТеста);
    GoogleDrive_ОбновитьФайл(ПараметрыТеста);
    GoogleDrive_ПолучитьСписокФайлов(ПараметрыТеста);
    GoogleDrive_УдалитьОбъект(ПараметрыТеста);
    GoogleDrive_ПолучитьОписаниеФайла(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ГД_СоздатьУдалитьКомментарий() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GD_Catalog"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"     , ПараметрыТеста);

    ПараметрыТеста.Вставить("МассивУдаляемых", Новый Массив);

    GoogleDrive_ЗагрузитьФайл(ПараметрыТеста);

    GoogleDrive_СоздатьКомментарий(ПараметрыТеста);
    GoogleDrive_ПолучитьКомментарий(ПараметрыТеста);
    GoogleDrive_ПолучитьСписокКомментариев(ПараметрыТеста);
    GoogleDrive_УдалитьКомментарий(ПараметрыТеста);

    GoogleDrive_УдалитьОбъект(ПараметрыТеста);

КонецПроцедуры

Процедура ГД_СоздатьКаталог() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GD_Catalog"  , ПараметрыТеста);

    GoogleDrive_СоздатьПапку(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область GoogleSheets

Процедура ГТ_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientSecret", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Code"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Refresh"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ServiceData" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Access_Token"       , ПараметрыТеста);

    GoogleSheets_СформироватьСсылкуПолученияКода(ПараметрыТеста);
    GoogleSheets_ПолучитьТокенПоКоду(ПараметрыТеста);
    GoogleSheets_ОбновитьТокен(ПараметрыТеста);
    GoogleSheets_ПолучитьТокенServiceАккаунта(ПараметрыТеста);

КонецПроцедуры

Процедура ГТ_СоздатьТаблицу() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);

    GoogleSheets_СоздатьКнигу(ПараметрыТеста);
    GoogleSheets_ПолучитьКнигу(ПараметрыТеста);
    GoogleSheets_КопироватьЛист(ПараметрыТеста);
    GoogleSheets_ДобавитьЛист(ПараметрыТеста);
    GoogleSheets_УдалитьЛист(ПараметрыТеста);
    GoogleSheets_ИзменитьНаименованиеКниги(ПараметрыТеста);
    GoogleSheets_ПолучитьТаблицу(ПараметрыТеста);

    OPI_GoogleDrive.УдалитьОбъект(ПараметрыТеста["Google_Token"], ПараметрыТеста["GS_Spreadsheet"]);
    OPI_GoogleDrive.УдалитьОбъект(ПараметрыТеста["Google_Token"], ПараметрыТеста["GS_Spreadsheet2"]);

КонецПроцедуры

Процедура ГТ_ЗаполнитьОчиститьЯчейки() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);

    GoogleSheets_СоздатьКнигу(ПараметрыТеста);
    GoogleSheets_УстановитьЗначенияЯчеек(ПараметрыТеста);
    GoogleSheets_ПолучитьЗначенияЯчеек(ПараметрыТеста);
    GoogleSheets_ОчиститьЯчейки(ПараметрыТеста);

    OPI_GoogleDrive.УдалитьОбъект(ПараметрыТеста["Google_Token"], ПараметрыТеста["GS_Spreadsheet"]);
    OPI_GoogleDrive.УдалитьОбъект(ПараметрыТеста["Google_Token"], ПараметрыТеста["GS_Spreadsheet2"]);

КонецПроцедуры

#КонецОбласти

#Область Twitter

Процедура Твиттер_ДанныеАккаунта() Экспорт

    ПараметрыТеста = Новый Структура;

    Twitter_ПолучитьТокен(ПараметрыТеста);
    Twitter_ПолучитьСсылкуАвторизации(ПараметрыТеста);
    // !DISABLED! Twitter_ОбновитьТокен(ПараметрыТеста);

КонецПроцедуры

Процедура Твиттер_Твиты() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GIF"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video"   , ПараметрыТеста);

    Twitter_СоздатьТекстовыйТвит(ПараметрыТеста);
    Twitter_ЗагрузитьМассивВложений(ПараметрыТеста);
    Twitter_СоздатьТвитВидео(ПараметрыТеста);
    Twitter_СоздатьТвитКартинки(ПараметрыТеста);
    Twitter_СоздатьТвитГифки(ПараметрыТеста);
    Twitter_СоздатьТвитОпрос(ПараметрыТеста);
    Twitter_СоздатьПроизвольныйТвит(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область Notion

Процедура НоушнАпи_СоздатьСтраницу() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_Parent", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2"     , ПараметрыТеста);

    Notion_СоздатьСтраницу(ПараметрыТеста);
    Notion_ПолучитьСтраницу(ПараметрыТеста);
    Notion_ИзменитьСвойстваСтраницы(ПараметрыТеста);

КонецПроцедуры

Процедура НоушнАпи_СоздатьИзменитьБазу() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_Parent", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"      , ПараметрыТеста);

    Notion_СоздатьБазуДанных(ПараметрыТеста);
    Notion_ИзменитьСвойстваБазы(ПараметрыТеста);
    Notion_ПолучитьБазуДанных(ПараметрыТеста);
    Notion_СоздатьСтраницуВБазу(ПараметрыТеста);

КонецПроцедуры

Процедура НоушнАпи_СоздатьУдалитьБлок() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_Parent", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_Block" , ПараметрыТеста);

    Notion_ВернутьБлок(ПараметрыТеста);
    Notion_СоздатьБлок(ПараметрыТеста);
    Notion_ВернутьДочерниеБлоки(ПараметрыТеста);
    Notion_УдалитьБлок(ПараметрыТеста);

КонецПроцедуры

Процедура НоушнАпи_ПолучитьПользователей() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Notion_User" , ПараметрыТеста);

    Notion_СписокПользователей(ПараметрыТеста);
    Notion_ПолучитьДанныеПользователя(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область Slack

Процедура Слак_ПолучитьИнформацию() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token", ПараметрыТеста);

    Slack_ПолучитьИнформациюОБоте(ПараметрыТеста);
    Slack_ПолучитьСписокПользователей(ПараметрыТеста);
    Slack_ПолучитьСписокРабочихОбластей(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_ОтправитьУдалитьСообщение() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Channel", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_User"   , ПараметрыТеста);

    Slack_ОтправитьСообщение(ПараметрыТеста);
    Slack_ИзменитьСообщение(ПараметрыТеста);
    Slack_ПолучитьСписокОтветовНаСообщение(ПараметрыТеста);
    Slack_ПолучитьСсылкуНаСообщение(ПараметрыТеста);
    Slack_УдалитьСообщение(ПараметрыТеста);
    Slack_ОтправитьЭфемерноеСообщение(ПараметрыТеста);
    Slack_ПолучитьСписокОтложенныхСообщений(ПараметрыТеста);
    Slack_СформироватьБлокКартинку(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_СоздатьАрхивироватьКанал() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_User" , ПараметрыТеста);

    Slack_СоздатьКанал(ПараметрыТеста);
    Slack_УстановитьТемуКанала(ПараметрыТеста);
    Slack_УстановитьЦельКанала(ПараметрыТеста);
    Slack_ПолучитьКанал(ПараметрыТеста);
    Slack_ПригласитьПользователейВКанал(ПараметрыТеста);
    Slack_ВыгнатьПользователяИзКанала(ПараметрыТеста);
    Slack_ПолучитьИсториюКанала(ПараметрыТеста);
    Slack_ПолучитьСписокПользователейКанала(ПараметрыТеста);
    Slack_ПокинутьКанал(ПараметрыТеста);
    Slack_ВступитьВКанал(ПараметрыТеста);
    Slack_ПереименоватьКанал(ПараметрыТеста);
    Slack_АрхивироватьКанал(ПараметрыТеста);
    Slack_ПолучитьСписокКаналов(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_ОткрытьЗакрытьДиалог() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_User" , ПараметрыТеста);

    Slack_ОткрытьДиалог(ПараметрыТеста);
    Slack_ЗакрытьДиалог(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_ЗагрузитьУдалитьФайл() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Channel", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"     , ПараметрыТеста);

    Slack_ПолучитьСписокФайлов(ПараметрыТеста);
    Slack_ЗагрузитьФайл(ПараметрыТеста);
    Slack_СделатьФайлПубличным(ПараметрыТеста);
    Slack_СделатьФайлПриватным(ПараметрыТеста);
    Slack_ПолучитьДанныеФайла(ПараметрыТеста);
    Slack_УдалитьФайл(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_ЗагрузитьУдалитьВФ() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Channel", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"     , ПараметрыТеста);

    Slack_ПолучитьСписокВнешнихФайлов(ПараметрыТеста);
    Slack_ДобавитьВнешнийФайл(ПараметрыТеста);
    Slack_ПолучитьВнешнийФайл(ПараметрыТеста);
    Slack_ОтправитьВнешнийФайл(ПараметрыТеста);
    Slack_УдалитьВнешнийФайл(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область Airtable

Процедура АТ_СоздатьБазу() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Workspace", ПараметрыТеста);

    Airtable_СоздатьБазу(ПараметрыТеста);
    Airtable_ПолучитьТаблицыБазы(ПараметрыТеста);
    Airtable_ПолучитьСписокБаз(ПараметрыТеста);

КонецПроцедуры

Процедура АТ_СоздатьТаблицу() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Base" , ПараметрыТеста);

    Airtable_ПолучитьПолеНомера(ПараметрыТеста);
    Airtable_ПолучитьПолеСтроковое(ПараметрыТеста);
    Airtable_ПолучитьПолеВложения(ПараметрыТеста);
    Airtable_ПолучитьПолеФлажка(ПараметрыТеста);
    Airtable_ПолучитьПолеДаты(ПараметрыТеста);
    Airtable_ПолучитьПолеТелефона(ПараметрыТеста);
    Airtable_ПолучитьПолеПочты(ПараметрыТеста);
    Airtable_ПолучитьПолеСсылки(ПараметрыТеста);
    Airtable_СоздатьТаблицу(ПараметрыТеста);
    Airtable_ИзменитьТаблицу(ПараметрыТеста);

КонецПроцедуры

Процедура АТ_СоздатьПоле() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Base" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Table", ПараметрыТеста);

    Airtable_СоздатьПоле(ПараметрыТеста);
    Airtable_ИзменитьПоле(ПараметрыТеста);

КонецПроцедуры

Процедура АТ_СоздатьУдалитьЗаписи() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Base" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Table", ПараметрыТеста);

    Airtable_СоздатьЗаписи(ПараметрыТеста);
    Airtable_ПолучитьЗапись(ПараметрыТеста);
    Airtable_СоздатьКомментарий(ПараметрыТеста);
    Airtable_ИзменитьКомментарий(ПараметрыТеста);
    Airtable_ПолучитьКомментарии(ПараметрыТеста);
    Airtable_УдалитьКомментарий(ПараметрыТеста);
    Airtable_ПолучитьСписокЗаписей(ПараметрыТеста);
    Airtable_УдалитьЗаписи(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область Dropbox

Процедура ДропБокс_ПолучитьОбновитьТокен() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Appkey"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Appsecret", ПараметрыТеста);

    Dropbox_ПолучитьСсылкуАвторизации(ПараметрыТеста);

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Code", ПараметрыТеста);

    Dropbox_ПолучитьТокен(ПараметрыТеста);

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Refresh", ПараметрыТеста);

    Dropbox_ОбновитьТокен(ПараметрыТеста);

КонецПроцедуры

Процедура ДропБокс_ЗагрузитьФайл() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Big"          , ПараметрыТеста);

    Dropbox_ЗагрузитьФайл(ПараметрыТеста);
    Dropbox_ПолучитьИнформациюОбОбъекте(ПараметрыТеста);
    Dropbox_ПолучитьСписокВерсийОбъекта(ПараметрыТеста);
    Dropbox_ВосстановитьОбъектКВерсии(ПараметрыТеста);
    Dropbox_ПолучитьПревью(ПараметрыТеста);
    Dropbox_СкачатьФайл(ПараметрыТеста);
    Dropbox_ПереместитьОбъект(ПараметрыТеста);
    Dropbox_КопироватьОбъект(ПараметрыТеста);
    Dropbox_УдалитьОбъект(ПараметрыТеста);

КонецПроцедуры

Процедура ДропБокс_СоздатьКаталог() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Token", ПараметрыТеста);

    Dropbox_СоздатьПапку(ПараметрыТеста);
    Dropbox_СкачатьПапку(ПараметрыТеста);

КонецПроцедуры

Процедура ДропБокс_ПолучитьСписокФайловПапки() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Token", ПараметрыТеста);

    Dropbox_ПолучитьСписокФайловПапки(ПараметрыТеста);

КонецПроцедуры

Процедура ДропБокс_ЗагрузитьФайлПоURL() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"     , ПараметрыТеста);

    Dropbox_ЗагрузитьФайлПоURL(ПараметрыТеста);
    Dropbox_ПолучитьСтатусЗагрузкиПоURL(ПараметрыТеста);

КонецПроцедуры

Процедура ДропБокс_СоздатьУдалитьТег() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Token", ПараметрыТеста);

    Dropbox_ДобавитьТег(ПараметрыТеста);
    Dropbox_ПолучитьСписокТегов(ПараметрыТеста);
    Dropbox_УдалитьТег(ПараметрыТеста);

КонецПроцедуры

Процедура ДропБокс_ПолучитьАккаунт() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Token", ПараметрыТеста);

    Dropbox_ПолучитьИнформациюОбАккаунте(ПараметрыТеста);
    Dropbox_ПолучитьДанныеИспользованияПространства(ПараметрыТеста);

КонецПроцедуры

Процедура ДропБокс_РаботаСДоступами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_OtherUser", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Dropbox_FileID"   , ПараметрыТеста);

    Dropbox_ДобавитьПользователейКФайлу(ПараметрыТеста);
    Dropbox_ОпубликоватьПапку(ПараметрыТеста);
    Dropbox_ДобавитьПользователейКПапке(ПараметрыТеста);
    Dropbox_ОтменитьПубликациюПапки(ПараметрыТеста);
    Dropbox_ПолучитьСтатусАсинхронногоИзменения(ПараметрыТеста);
    Dropbox_ОтменитьПубликациюФайла(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область Bitrix24

Процедура Б24_РаботаСТокеном() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_ClientID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_ClientSecret", ПараметрыТеста);

    Bitrix24_ПолучитьСсылкуАвторизацииПриложения(ПараметрыТеста);

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Code", ПараметрыТеста);

    Bitrix24_ПолучитьТокен(ПараметрыТеста);

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Refresh", ПараметрыТеста);

    Bitrix24_ОбновитьТокен(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_СерверноеВремя() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    Bitrix24_СерверноеВремя(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСНовостями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2"       , ПараметрыТеста);

    Bitrix24_СоздатьНовость(ПараметрыТеста);
    Bitrix24_ИзменитьНовость(ПараметрыТеста);
    Bitrix24_ПолучитьСписокПросмотревшихВажное(ПараметрыТеста);
    Bitrix24_ПолучитьНовости(ПараметрыТеста);
    Bitrix24_ДобавитьКомментарийНовости(ПараметрыТеста);
    Bitrix24_ДобавитьПолучателейКНовости(ПараметрыТеста);
    Bitrix24_УдалитьНовость(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСЗадачами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_UserID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"        , ПараметрыТеста);

    Bitrix24_ПолучитьСтруктуруЗадачи(ПараметрыТеста);
    Bitrix24_СоздатьЗадачу(ПараметрыТеста);
    Bitrix24_СоздатьЗависимостьЗадач(ПараметрыТеста);
    Bitrix24_УдалитьЗависимостьЗадач(ПараметрыТеста);
    Bitrix24_ИзменитьЗадачу(ПараметрыТеста);
    Bitrix24_ПолучитьЗадачу(ПараметрыТеста);
    Bitrix24_ОтключитьЗвукЗадачи(ПараметрыТеста);
    Bitrix24_ВключитьЗвукЗадачи(ПараметрыТеста);
    Bitrix24_ДобавитьЗадачуВИзбранное(ПараметрыТеста);
    Bitrix24_УбратьЗадачуИзИзбранного(ПараметрыТеста);
    Bitrix24_ДелегироватьЗадачу(ПараметрыТеста);
    Bitrix24_ОтложитьЗадачу(ПараметрыТеста);
    Bitrix24_ЗавершитьЗадачу(ПараметрыТеста);
    Bitrix24_ОтклонитьЗадачу(ПараметрыТеста);
    Bitrix24_ПринятьЗадачу(ПараметрыТеста);
    Bitrix24_ВозобновитьЗадачу(ПараметрыТеста);
    Bitrix24_НачатьВыполнениеЗадачи(ПараметрыТеста);
    Bitrix24_НачатьНаблюдатьЗаЗадачей(ПараметрыТеста);
    Bitrix24_ПрекратитьНаблюдатьЗаЗадачей(ПараметрыТеста);
    Bitrix24_ПриостановитьЗадачу(ПараметрыТеста);
    Bitrix24_ПолучитьИсториюЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьСписокЗадач(ПараметрыТеста);
    Bitrix24_ПроверитьДоступКЗадаче(ПараметрыТеста);
    Bitrix24_ДобавитьЭлементЧеклистаЗадачи(ПараметрыТеста);
    Bitrix24_ИзменитьЭлементЧеклистаЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьЧеклистЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьЭлементЧеклистаЗадачи(ПараметрыТеста);
    Bitrix24_ВыполнитьЭлементЧеклистаЗадачи(ПараметрыТеста);
    Bitrix24_ВозобновитьЭлементЧеклистаЗадачи(ПараметрыТеста);
    Bitrix24_УдалитьЭлементЧеклистаЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьПланЗадачНаДень(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруФильтраЗадач(ПараметрыТеста);

    Наименование = "Картинка задачи.jpg";
    Картинка     = ПараметрыТеста["Picture"];
    IDПриемника  = 3;

    URL = ПараметрыТеста["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ЗагрузитьФайлВХранилище(URL, Наименование, Картинка, IDПриемника);
    IDФайла   = Результат["result"]["ID"];

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("Bitrix24_TaskFileID", IDФайла);
    ПараметрыТеста.Вставить("Bitrix24_TaskFileID", IDФайла);

    Bitrix24_ДобавитьФайлВЗадачу(ПараметрыТеста);

    OPI_Bitrix24.УдалитьФайл(URL, IDФайла);

    Bitrix24_УдалитьЗадачу(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСДиском() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2"       , ПараметрыТеста);

    Bitrix24_ПолучитьСписокХранилищ(ПараметрыТеста);
    Bitrix24_ПолучитьХранилищеПриложения(ПараметрыТеста);
    Bitrix24_ПереименоватьХранилище(ПараметрыТеста);
    Bitrix24_ПолучитьХранилище(ПараметрыТеста);
    Bitrix24_ЗагрузитьФайлВХранилище(ПараметрыТеста);
    Bitrix24_ПолучитьСодержимоеХранилища(ПараметрыТеста);
    Bitrix24_ПолучитьИнформациюОФайле(ПараметрыТеста);
    Bitrix24_ПолучитьВнешнююСсылкуФайла(ПараметрыТеста);
    Bitrix24_ПереименоватьФайл(ПараметрыТеста);
    Bitrix24_ПоместитьФайлВКорзину(ПараметрыТеста);
    Bitrix24_ВосстановитьФайл(ПараметрыТеста);
    Bitrix24_СоздатьКаталогВХранилище(ПараметрыТеста);
    Bitrix24_ПереименоватьКаталог(ПараметрыТеста);
    Bitrix24_ПолучитьИнформациюОКаталоге(ПараметрыТеста);
    Bitrix24_ПолучитьВнешнююСсылкуКаталога(ПараметрыТеста);
    Bitrix24_СоздатьПодкаталог(ПараметрыТеста);
    Bitrix24_ПереместитьФайлВКаталог(ПараметрыТеста);
    Bitrix24_СкопироватьКаталог(ПараметрыТеста);
    Bitrix24_ЗагрузитьФайлВКаталог(ПараметрыТеста);
    Bitrix24_СкопироватьФайл(ПараметрыТеста);
    Bitrix24_УдалитьФайл(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруФильтраКаталога(ПараметрыТеста);
    Bitrix24_ПолучитьДочерниеЭлементыКаталога(ПараметрыТеста);
    Bitrix24_ПереместитьКаталог(ПараметрыТеста);
    Bitrix24_ПоместитьКаталогВКорзину(ПараметрыТеста);
    Bitrix24_ВосстановитьКаталог(ПараметрыТеста);
    Bitrix24_УдалитьКаталог(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСКомментариями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();
    Час         = 3600;
    Сутки       = 24;
    Исполнитель = 1;

    СтруктураЗадачи = Новый Структура;
    СтруктураЗадачи.Вставить("TITLE"         , "Новая задача");
    СтруктураЗадачи.Вставить("DESCRIPTION"   , "Новое описание задачи");
    СтруктураЗадачи.Вставить("PRIORITY"      , "2");
    СтруктураЗадачи.Вставить("DEADLINE"      , ТекущаяДата + Час * Сутки);
    СтруктураЗадачи.Вставить("RESPONSIBLE_ID", Исполнитель);

    URL = ПараметрыТеста["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьЗадачу(URL, СтруктураЗадачи);
    IDЗадачи  = Результат["result"]["task"]["id"];

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("Bitrix24_CommentsTaskID", IDЗадачи);
    ПараметрыТеста.Вставить("Bitrix24_CommentsTaskID", IDЗадачи);

    Bitrix24_ДобавитьКомментарийЗадачи(ПараметрыТеста);
    Bitrix24_ИзменитьКомментарийЗадачи(ПараметрыТеста);
    // !DISABLED! Bitrix24_СоздатьРезультатИзКомментария(ПараметрыТеста);
    // !DISABLED! Bitrix24_ПолучитьСписокРезультатов(ПараметрыТеста);
    // !DISABLED! Bitrix24_УдалитьРезультатИзКомментария(ПараметрыТеста);
    // !DISABLED! Bitrix24_ПолучитьСписокКомментариевЗадачи(ПараметрыТеста);
    // !DISABLED! Bitrix24_ПолучитьКомменатрийЗадачи(ПараметрыТеста);
    // !DISABLED! Bitrix24_УдалитьКомментарийЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруКомментария(ПараметрыТеста);

    OPI_Bitrix24.УдалитьЗадачу(URL, IDЗадачи);

КонецПроцедуры

Процедура Б24_УчетРабочегоВремени() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();
    Час         = 3600;
    Сутки       = 24;
    Исполнитель = 1;

    СтруктураЗадачи = Новый Структура;
    СтруктураЗадачи.Вставить("TITLE"         , "Новая задача");
    СтруктураЗадачи.Вставить("DESCRIPTION"   , "Новое описание задачи");
    СтруктураЗадачи.Вставить("PRIORITY"      , "2");
    СтруктураЗадачи.Вставить("DEADLINE"      , ТекущаяДата + Час * Сутки);
    СтруктураЗадачи.Вставить("RESPONSIBLE_ID", Исполнитель);

    URL = ПараметрыТеста["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьЗадачу(URL, СтруктураЗадачи);
    IDЗадачи  = Результат["result"]["task"]["id"];

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("Bitrix24_ElapsedTaskID", IDЗадачи);
    ПараметрыТеста.Вставить("Bitrix24_ElapsedTaskID", IDЗадачи);

    Bitrix24_ДобавитьТрудозатратыЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьТрудозатратыЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьСписокТрудозатратЗадачи(ПараметрыТеста);
    Bitrix24_ИзменитьТрудозатратыЗадачи(ПараметрыТеста);
    Bitrix24_УдалитьТрудозатратыЗадачи(ПараметрыТеста);
    Bitrix24_НачатьУчетВремени(ПараметрыТеста);
    Bitrix24_ПриостановитьУчетВремени(ПараметрыТеста);
    Bitrix24_ПолучитьСтатусУчетаВремени(ПараметрыТеста);
    Bitrix24_ЗавершитьУчетВремени(ПараметрыТеста);
    Bitrix24_ПолучитьНастройкиУчетаВремени(ПараметрыТеста);

    OPI_Bitrix24.УдалитьЗадачу(URL, IDЗадачи);

КонецПроцедуры

Процедура Б24_Канбан() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();
    Час         = 3600;
    Сутки       = 24;
    Исполнитель = 1;

    СтруктураЗадачи = Новый Структура;
    СтруктураЗадачи.Вставить("TITLE"         , "Новая задача");
    СтруктураЗадачи.Вставить("DESCRIPTION"   , "Новое описание задачи");
    СтруктураЗадачи.Вставить("PRIORITY"      , "2");
    СтруктураЗадачи.Вставить("DEADLINE"      , ТекущаяДата + Час * Сутки);
    СтруктураЗадачи.Вставить("RESPONSIBLE_ID", Исполнитель);

    URL = ПараметрыТеста["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьЗадачу(URL, СтруктураЗадачи);
    IDЗадачи  = Результат["result"]["task"]["id"];

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("Bitrix24_KanbanTaskID", IDЗадачи);
    ПараметрыТеста.Вставить("Bitrix24_KanbanTaskID", IDЗадачи);

    Bitrix24_ДобавитьСтадиюКанбана(ПараметрыТеста);
    Bitrix24_ПолучитьСтадииКанбана(ПараметрыТеста);
    Bitrix24_ПеренестиЗадачуВСтадиюКанбана(ПараметрыТеста);
    Bitrix24_ИзменитьСтадиюКанбана(ПараметрыТеста);

    OPI_Bitrix24.УдалитьЗадачу(URL, IDЗадачи);

    Bitrix24_УдалитьСтадиюКанбана(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСЧатами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"       , ПараметрыТеста);

    Bitrix24_ПолучитьСтатусПользователя(ПараметрыТеста);
    Bitrix24_УстановитьСтатусПользователя(ПараметрыТеста);
    Bitrix24_ПолучитьПользователей(ПараметрыТеста);
    Bitrix24_СоздатьЧат(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

    Bitrix24_ПолучитьСписокПользователейЧата(ПараметрыТеста);
    Bitrix24_ИсключитьПользователяИзЧата(ПараметрыТеста);
    Bitrix24_ДобавитьПользователейВЧат(ПараметрыТеста);
    Bitrix24_ИзменитьЗаголовокЧата(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

    Bitrix24_ИзменитьЦветЧата(ПараметрыТеста);
    Bitrix24_ИзменитьКартинкуЧата(ПараметрыТеста);
    Bitrix24_ОтключитьУведомленияЧата(ПараметрыТеста);
    Bitrix24_ВключитьУведомленияЧата(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

    Bitrix24_ПолучитьСписокСообщенийЧата(ПараметрыТеста);
    Bitrix24_ОтметитьСообщениеКакПрочитанное(ПараметрыТеста);
    Bitrix24_ОтметитьСообщениеКакНепрочитанное(ПараметрыТеста);
    Bitrix24_ПолучитьДиалог(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

    Bitrix24_ПолучитьСписокПользователейДиалога(ПараметрыТеста);
    Bitrix24_ОтправитьУведомлениеОВводе(ПараметрыТеста);
    Bitrix24_ОтправитьСообщение(ПараметрыТеста);
    Bitrix24_ИзменитьСообщение(ПараметрыТеста);
    Bitrix24_ПолучитьБлокКартинки(ПараметрыТеста);
    Bitrix24_ПолучитьБлокФайла(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

    Bitrix24_УстановитьРеакциюНаСообщение(ПараметрыТеста);
    Bitrix24_УдалитьСообщение(ПараметрыТеста);
    Bitrix24_ПолучитьКаталогФайловЧата(ПараметрыТеста);
    Bitrix24_ОтправитьФайл(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

    Bitrix24_ПрочитатьВсе(ПараметрыТеста);
    Bitrix24_СменитьВладельцаЧата(ПараметрыТеста);
    Bitrix24_ПокинутьЧат(ПараметрыТеста);

    Bitrix24_ПолучитьСтруктуруЧата(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСУведомлениями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"       , ПараметрыТеста);

    Bitrix24_СоздатьПерсональноеУведомление(ПараметрыТеста);
    Bitrix24_СоздатьСистемноеУведомление(ПараметрыТеста);
    Bitrix24_УдалитьУведомление(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСПолямиЗадач() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain"         , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token"          , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_HookTaskFieldID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_TaskFieldID"    , ПараметрыТеста);

    Bitrix24_ДобавитьПользовательскоеПолеЗадачи(ПараметрыТеста);
    Bitrix24_ИзменитьПользовательскоеПолеЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьПользовательскоеПолеЗадачи(ПараметрыТеста);
    Bitrix24_ПолучитьСписокПользовательскихПолейЗадачи(ПараметрыТеста);
    Bitrix24_УдалитьПользовательскоеПолеЗадачи(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_УправлениеПодразделениями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    Bitrix24_СоздатьПодразделение(ПараметрыТеста);
    Bitrix24_ПолучитьПодразделения(ПараметрыТеста);
    Bitrix24_ИзменитьПодразделение(ПараметрыТеста);
    Bitrix24_УдалитьПодразделение(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_УправлениеПользователями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    Bitrix24_ПолучитьТекущегоПользователя(ПараметрыТеста);
    Bitrix24_ПолучитьСтурктуруПользователя(ПараметрыТеста);
    Bitrix24_СоздатьПользователя(ПараметрыТеста);
    Bitrix24_НайтиПользователей(ПараметрыТеста);
    Bitrix24_ИзменитьПользователя(ПараметрыТеста);
    Bitrix24_ПолучитьПользователя(ПараметрыТеста);
    Bitrix24_ИзменитьСтатусПользователя(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруФильтраПользователей(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСЛидами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    Bitrix24_ПолучитьСписокЛидов(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруФильтраЛидов(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруЛида(ПараметрыТеста);
    Bitrix24_СоздатьЛид(ПараметрыТеста);
    Bitrix24_ПолучитьЛид(ПараметрыТеста);
    Bitrix24_ИзменитьЛид(ПараметрыТеста);
    Bitrix24_УдалитьЛид(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСоСделками() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    Bitrix24_ПолучитьСтруктуруФильтраСделок(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруСделки(ПараметрыТеста);
    Bitrix24_СоздатьСделку(ПараметрыТеста);
    Bitrix24_ПолучитьСделку(ПараметрыТеста);
    Bitrix24_ИзменитьСделку(ПараметрыТеста);
    Bitrix24_УдалитьСделку(ПараметрыТеста);
    Bitrix24_ПолучитьСписокСделок(ПараметрыТеста);

КонецПроцедуры

Процедура Б24_РаботаСКалендарями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_URL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Domain", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Bitrix24_Token" , ПараметрыТеста);

    Bitrix24_СоздатьКалендарь(ПараметрыТеста);
    Bitrix24_ИзменитьКалендарь(ПараметрыТеста);
    Bitrix24_ПолучитьСписокКалендарей(ПараметрыТеста);
    Bitrix24_СоздатьСобытиеКалендаря(ПараметрыТеста);
    Bitrix24_УстановитьСтатусУчастияПользователя(ПараметрыТеста);
    Bitrix24_ПолучитьСтатусУчастияПользователя(ПараметрыТеста);
    Bitrix24_ПолучитьСобытиеКалендаря(ПараметрыТеста);
    Bitrix24_ПолучитьСобытияКалендарей(ПараметрыТеста);
    Bitrix24_ИзменитьСобытиеКалендаря(ПараметрыТеста);
    Bitrix24_ПолучитьЗанятостьПользователей(ПараметрыТеста);
    Bitrix24_УдалитьСобытиеКалендаря(ПараметрыТеста);
    Bitrix24_УдалитьКалендарь(ПараметрыТеста);
    Bitrix24_ПолучитьПользовательскиеНастройкиКалендаря(ПараметрыТеста);
    Bitrix24_УстановитьПользовательскиеНастройкиКалендаря(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруКалендаря(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруНастроекКалендаря(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруПользовательскихНастроекКаледнаря(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруСобытияКалендаря(ПараметрыТеста);
    Bitrix24_ПолучитьСтруктуруФильтраСобытийКалендарей(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область VkTeams

Процедура ВКТ_ОбщиеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_Token" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_FileID", ПараметрыТеста);

    VkTeams_ПроверитьТокен(ПараметрыТеста);
    VkTeams_ПолучитьСобытия(ПараметрыТеста);
    VKTeams_ПолучитьИнформациюОФайле(ПараметрыТеста);

КонецПроцедуры

Процедура ВКТ_ОтправкаСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_ChatID"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_ChatID2"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_MessageID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"         , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Audio2"           , ПараметрыТеста);

    VkTeams_ОтправитьТекстовоеСообщение(ПараметрыТеста);
    OPI_Инструменты.Пауза(60);

    VKTeams_ОтветитьНаСобытиеКлавиатуры(ПараметрыТеста);
    VKTeams_ПереслатьСообщение(ПараметрыТеста);
    VKTeams_ОтправитьФайл(ПараметрыТеста);
    VKTeams_ПереслатьФайл(ПараметрыТеста);
    VKTeams_ИзменитьТекстСообщения(ПараметрыТеста);
    VKTeams_ЗакрепитьСообщение(ПараметрыТеста);
    VKTeams_ОткрепитьСообщение(ПараметрыТеста);
    VKTeams_УдалитьСообщение(ПараметрыТеста);
    VKTeams_ОтправитьГолосовоеСообщение(ПараметрыТеста);
    VKTeams_ПереслатьГолосовоеСообщение(ПараметрыТеста);
    VKTeams_СформироватьКнопкуДействия(ПараметрыТеста);

КонецПроцедуры

Процедура ВКТ_УправлениеЧатами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_ChatID" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("VkTeams_ChatID2", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture3"       , ПараметрыТеста);

    VKTeams_ИсключитьПользователейЧата(ПараметрыТеста);
    VKTeams_ИзменитьАватарЧата(ПараметрыТеста);
    VKTeams_ПолучитьИнформациюОЧате(ПараметрыТеста);
    VKTeams_ПолучитьАдминистраторовЧата(ПараметрыТеста);
    VKTeams_ПолучитьПользователейЧата(ПараметрыТеста);
    VKTeams_ПолучитьЗаблокированныхПользователейЧата(ПараметрыТеста);
    VKTeams_ПолучитьЗапросыВступленияЧата(ПараметрыТеста);
    VKTeams_ЗаблокироватьПользователяЧата(ПараметрыТеста);
    VKTeams_РазблокироватьПользователяЧата(ПараметрыТеста);
    VKTeams_ОдобритьЗаявкуНаВступление(ПараметрыТеста);
    VKTeams_ОтклонитьЗаявкуНаВступление(ПараметрыТеста);
    VKTeams_УстановитьЗаголовокЧата(ПараметрыТеста);
    VKTeams_УстановитьОписаниеЧата(ПараметрыТеста);
    VKTeams_УстановитьПравилаЧата(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область Neocities

Процедура НС_РаботаСФайлами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("NC_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Gif"     , ПараметрыТеста);

    Neocities_ЗагрузитьФайл(ПараметрыТеста);
    Neocities_ЗагрузитьФайлы(ПараметрыТеста);
    Neocities_ПолучитьСписокФайлов(ПараметрыТеста);
    Neocities_УдалитьВыбранныеФайлы(ПараметрыТеста);
    Neocities_СинхронизироватьКаталоги(ПараметрыТеста);

КонецПроцедуры

Процедура НС_ПолучениеДанных() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("NC_Token"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("NC_Login"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("NC_Password", ПараметрыТеста);

    Neocities_ПолучитьДанныеОСайте(ПараметрыТеста);
    Neocities_ПолучитьТокен(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область CDEK

Процедура СдэкАПИ_ОбщиеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("CDEK_Account" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("CDEK_Password", ПараметрыТеста);

    CDEK_ПолучитьТокен(ПараметрыТеста);
    CDEK_ПолучитьЧекиНаДату(ПараметрыТеста);
    CDEK_ПолучитьРеестрыПлатежейНаДату(ПараметрыТеста);
    CDEK_ПолучитьПереводыПлатежейНаДату(ПараметрыТеста);
    CDEK_ПолучитьОписаниеФильтраОфисов(ПараметрыТеста);
    CDEK_ПолучитьСписокОфисов(ПараметрыТеста);
    CDEK_ПолучитьСписокРегионов(ПараметрыТеста);

КонецПроцедуры

Процедура СдэкАПИ_РаботаСЗаказами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("CDEK_Token", ПараметрыТеста);

    CDEK_ПолучитьОписаниеЗаказа(ПараметрыТеста);
    CDEK_СоздатьЗаказ(ПараметрыТеста);

    OPI_Инструменты.Пауза(25);

    CDEK_ПолучитьЗаказ(ПараметрыТеста);
    CDEK_ПолучитьЗаказПоНомеру(ПараметрыТеста);
    CDEK_СформироватьКвитанцию(ПараметрыТеста);
    CDEK_СформироватьШтрихкод(ПараметрыТеста);
    CDEK_СоздатьПреалерт(ПараметрыТеста);

    OPI_Инструменты.Пауза(25);

    CDEK_ПолучитьКвитанцию(ПараметрыТеста);
    CDEK_ПолучитьШтрихкод(ПараметрыТеста);
    CDEK_ПолучитьПреалерт(ПараметрыТеста);
    CDEK_ПолучитьСтатусПаспортныхДанных(ПараметрыТеста);
    CDEK_ПолучитьЧекЗаказа(ПараметрыТеста);
    CDEK_ИзменитьЗаказ(ПараметрыТеста);
    CDEK_ОформитьКлиентскийВозврат(ПараметрыТеста);
    CDEK_СоздатьОтказ(ПараметрыТеста);
    CDEK_УдалитьЗаказ(ПараметрыТеста);

КонецПроцедуры

Процедура СдэкАПИ_РаботаСЗаявкамиНаВызовКурьера() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("CDEK_Token", ПараметрыТеста);

    CDEK_СоздатьЗаказ(ПараметрыТеста);

    OPI_Инструменты.Пауза(25);

    CDEK_ПолучитьОписаниеЗаявкиКурьера(ПараметрыТеста);
    CDEK_СоздатьЗаявкуНаВызовКурьера(ПараметрыТеста);
    CDEK_ПолучитьЗаявкуНаВызовКурьера(ПараметрыТеста);
    CDEK_УдалитьЗаявкуНаВызовКурьера(ПараметрыТеста);
    CDEK_ПолучитьОписаниеДоговоренности(ПараметрыТеста);

    CDEK_ПолучитьДоступныеИнтервалыДоставки(ПараметрыТеста);
    CDEK_ЗафиксироватьДоговоренностьОДоставке(ПараметрыТеста);

    OPI_Инструменты.Пауза(25);

    CDEK_ПолучитьДоговоренностьОДоставке(ПараметрыТеста);
    CDEK_УдалитьЗаказ(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область YandexMetrika

Процедура ЯМетрика_УправлениеМетками() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Metrika_Token", ПараметрыТеста);

    YandexMetrika_СоздатьМетку(ПараметрыТеста);
    YandexMetrika_ПолучитьСписокМеток(ПараметрыТеста);
    YandexMetrika_ИзменитьМетку(ПараметрыТеста);
    YandexMetrika_ПолучитьМетку(ПараметрыТеста);
    YandexMetrika_УдалитьМетку(ПараметрыТеста);

КонецПроцедуры

Процедура ЯМетрика_УправлениеСчетчиками() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Metrika_Token", ПараметрыТеста);

    YandexMetrika_ПолучитьСтруктуруСчетчика(ПараметрыТеста);
    YandexMetrika_СоздатьСчетчик(ПараметрыТеста);
    YandexMetrika_ПолучитьСчетчик(ПараметрыТеста);
    YandexMetrika_ИзменитьСчетчик(ПараметрыТеста);
    YandexMetrika_УдалитьСчетчик(ПараметрыТеста);
    YandexMetrika_ВосстановитьСчетчик(ПараметрыТеста);
    YandexMetrika_ПолучитьСписокСчетчиков(ПараметрыТеста);
    YandexMetrika_УдалитьСчетчик(ПараметрыТеста);

КонецПроцедуры

Процедура ЯМетрика_УправлениеОперациями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Metrika_Token", ПараметрыТеста);

    YandexMetrika_СоздатьСчетчик(ПараметрыТеста);
    YandexMetrika_ПолучитьСписокОпераций(ПараметрыТеста);
    YandexMetrika_УдалитьСчетчик(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область S3

Процедура AWS_ОбщиеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровS3();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        S3_ПолучитьСтруктуруДанных(ПараметрыТеста);
        S3_ОтправитьЗапросБезТела(ПараметрыТеста);
        S3_ОтправитьЗапросСТелом(ПараметрыТеста);

   КонецЦикла;

КонецПроцедуры

Процедура AWS_РаботаСБакетами() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровS3();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        S3_СоздатьБакет(ПараметрыТеста);
        S3_ПолучитьСписокБакетов(ПараметрыТеста);
        S3_ПроверитьДоступностьБакета(ПараметрыТеста);
        S3_УстановитьТегиБакета(ПараметрыТеста);
        S3_ПолучитьТегиБакета(ПараметрыТеста);
        S3_УдалитьТегиБакета(ПараметрыТеста);
        S3_УстановитьШифрованиеБакета(ПараметрыТеста);
        S3_ПолучитьШифрованиеБакета(ПараметрыТеста);
        S3_УдалитьШифрованиеБакета(ПараметрыТеста);
        S3_УстановитьНастройкиВерсионированияБакета(ПараметрыТеста);
        S3_ПолучитьНастройкийВерсионированияБакета(ПараметрыТеста);
        S3_УдалитьБакет(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура AWS_РаботаСОбъектами() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровS3();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        S3_СоздатьБакет(ПараметрыТеста);
        S3_ЗагрузитьОбъект(ПараметрыТеста);
        S3_ЗагрузитьОбъектЦеликом(ПараметрыТеста);
        S3_ИнициализироватьЗагрузкуЧастями(ПараметрыТеста);
        S3_ЗагрузитьЧастьОбъекта(ПараметрыТеста);
        S3_ЗавершитьЗагрузкуЧастями(ПараметрыТеста);
        S3_ОтменитьЗагрузкуЧастями(ПараметрыТеста);
        S3_ПолучитьОписаниеОбъекта(ПараметрыТеста);
        S3_КопироватьОбъект(ПараметрыТеста);
        S3_УстановитьТегиОбъекта(ПараметрыТеста);
        S3_ПолучитьТегиОбъекта(ПараметрыТеста);
        S3_УдалитьТегиОбъекта(ПараметрыТеста);
        S3_ПолучитьСписокОбъектов(ПараметрыТеста);
        S3_ПолучитьСписокВерсийОбъектов(ПараметрыТеста);
        S3_ПолучитьОбъект(ПараметрыТеста);
        S3_ПолучитьСсылкуСкачиванияОбъекта(ПараметрыТеста);
        S3_УдалитьОбъект(ПараметрыТеста);
        S3_УдалитьБакет(ПараметрыТеста);
        S3_ПолучитьСсылкуЗагрузкиОбъекта(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область TCP

Процедура TC_Клиент() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("TCP_Address"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("TCP_AddressTLS", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Proxy_User"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Proxy_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Socks5_IP"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Socks5_Port"   , ПараметрыТеста);

    TCP_ОткрытьСоединение(ПараметрыТеста);
    TCP_ЗакрытьСоединение(ПараметрыТеста);
    TCP_ПрочитатьДвоичныеДанные(ПараметрыТеста);
    TCP_ОтправитьДвоичныеДанные(ПараметрыТеста);
    TCP_ПрочитатьСтроку(ПараметрыТеста);
    TCP_ОтправитьСтроку(ПараметрыТеста);
    TCP_ОбработатьЗапрос(ПараметрыТеста);
    TCP_ПолучитьНастройкиTLS(ПараметрыТеста);
    TCP_ПолучитьПоследнююОшибку(ПараметрыТеста);
    TCP_ПолучитьНастройкиПрокси(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область SQLite

Процедура SQLL_ОсновныеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;

    База = ПолучитьИмяВременногоФайла("sqlite");
    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("SQLite_DB", База);
    OPI_Инструменты.ДобавитьПоле("SQLite_DB", База, "Строка", ПараметрыТеста);

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("SQLite_Ext"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("SQLite_ExtLinux", ПараметрыТеста);

    SQLite_ОткрытьСоединение(ПараметрыТеста);
    SQLite_ЗакрытьСоединение(ПараметрыТеста);
    SQLite_ВыполнитьЗапросSQL(ПараметрыТеста);
    SQLite_ЭтоКоннектор(ПараметрыТеста);
    SQLite_ПодключитьРасширение(ПараметрыТеста);

    OPI_Инструменты.УдалитьФайлВПопытке(База, "Ошибка удаления файла базы");

КонецПроцедуры

Процедура SQLL_ORM() Экспорт

    ПараметрыТеста = Новый Структура;

    База = ПолучитьИмяВременногоФайла("sqlite");

    Соединение = OPI_SQLite.ОткрытьСоединение(База);
    ПараметрыТеста.Вставить("SQLite_DB", Соединение);

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture", ПараметрыТеста);

    SQLite_СоздатьТаблицу(ПараметрыТеста);
    SQLite_ДобавитьЗаписи(ПараметрыТеста);
    SQLite_ПолучитьЗаписи(ПараметрыТеста);
    SQLite_ОбновитьЗаписи(ПараметрыТеста);
    SQLite_УдалитьЗаписи(ПараметрыТеста);
    SQLite_ПолучитьИнформациюОТаблице(ПараметрыТеста);
    SQLite_ДобавитьКолонкуТаблицы(ПараметрыТеста);
    SQLite_УдалитьКолонкуТаблицы(ПараметрыТеста);
    SQLite_ГарантироватьТаблицу(ПараметрыТеста);
    SQLite_ОчиститьТаблицу(ПараметрыТеста);
    SQLite_УдалитьТаблицу(ПараметрыТеста);
    SQLite_ПолучитьСтруктуруФильтраЗаписей(ПараметрыТеста);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("SQLite_DB", База);
    OPI_Инструменты.ДобавитьПоле("SQLite_DB", База, "Строка", ПараметрыТеста);

    SQLite_СоздатьТаблицу(ПараметрыТеста);
    SQLite_ДобавитьЗаписи(ПараметрыТеста);
    SQLite_ПолучитьЗаписи(ПараметрыТеста);
    SQLite_ОбновитьЗаписи(ПараметрыТеста);
    SQLite_УдалитьЗаписи(ПараметрыТеста);
    SQLite_ПолучитьИнформациюОТаблице(ПараметрыТеста);
    SQLite_ДобавитьКолонкуТаблицы(ПараметрыТеста);
    SQLite_УдалитьКолонкуТаблицы(ПараметрыТеста);
    SQLite_ГарантироватьТаблицу(ПараметрыТеста);
    SQLite_ОчиститьТаблицу(ПараметрыТеста);
    SQLite_УдалитьТаблицу(ПараметрыТеста);
    SQLite_ПолучитьСтруктуруФильтраЗаписей(ПараметрыТеста);

    OPI_Инструменты.УдалитьФайлВПопытке(База, "Ошибка удаления файла базы");

КонецПроцедуры

#КонецОбласти

#Область PostgreSQL

Процедура Postgres_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровPostgres();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        PostgreSQL_СформироватьСтрокуПодключения(ПараметрыТеста);
        PostgreSQL_ОткрытьСоединение(ПараметрыТеста);
        PostgreSQL_ЗакрытьСоединение(ПараметрыТеста);
        PostgreSQL_ЭтоКоннектор(ПараметрыТеста);
        PostgreSQL_ВыполнитьЗапросSQL(ПараметрыТеста);
        PostgreSQL_ПолучитьНастройкиTLS(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура Postgres_ORM() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровPostgres();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        PostgreSQL_СоздатьБазуДанных(ПараметрыТеста);
        PostgreSQL_СоздатьТаблицу(ПараметрыТеста);
        PostgreSQL_ДобавитьЗаписи(ПараметрыТеста);
        PostgreSQL_ПолучитьЗаписи(ПараметрыТеста);
        PostgreSQL_ОбновитьЗаписи(ПараметрыТеста);
        PostgreSQL_УдалитьЗаписи(ПараметрыТеста);
        PostgreSQL_ОчиститьТаблицу(ПараметрыТеста);
        PostgreSQL_ПолучитьИнформациюОТаблице(ПараметрыТеста);
        PostgreSQL_ДобавитьКолонкуТаблицы(ПараметрыТеста);
        PostgreSQL_УдалитьКолонкуТаблицы(ПараметрыТеста);
        PostgreSQL_ГарантироватьТаблицу(ПараметрыТеста);
        PostgreSQL_УдалитьТаблицу(ПараметрыТеста);
        PostgreSQL_ОтключитьВсеСоединенияБазыДанных(ПараметрыТеста);
        PostgreSQL_УдалитьБазуДанных(ПараметрыТеста);
        PostgreSQL_ПолучитьСтруктуруФильтраЗаписей(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область MySQL

Процедура MYS_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровMySQL();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        MySQL_СформироватьСтрокуПодключения(ПараметрыТеста);
        MySQL_ОткрытьСоединение(ПараметрыТеста);
        MySQL_ЗакрытьСоединение(ПараметрыТеста);
        MySQL_ЭтоКоннектор(ПараметрыТеста);
        MySQL_ВыполнитьЗапросSQL(ПараметрыТеста);
        MySQL_ПолучитьНастройкиTLS(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура MYS_ORM() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровMySQL();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        MySQL_СоздатьБазуДанных(ПараметрыТеста);
        MySQL_СоздатьТаблицу(ПараметрыТеста);
        MySQL_ДобавитьЗаписи(ПараметрыТеста);
        MySQL_ПолучитьЗаписи(ПараметрыТеста);
        MySQL_ОбновитьЗаписи(ПараметрыТеста);
        MySQL_УдалитьЗаписи(ПараметрыТеста);
        MySQL_ОчиститьТаблицу(ПараметрыТеста);
        MySQL_ПолучитьИнформациюОТаблице(ПараметрыТеста);
        MySQL_ДобавитьКолонкуТаблицы(ПараметрыТеста);
        MySQL_УдалитьКолонкуТаблицы(ПараметрыТеста);
        MySQL_ГарантироватьТаблицу(ПараметрыТеста);
        MySQL_УдалитьТаблицу(ПараметрыТеста);
        MySQL_УдалитьБазуДанных(ПараметрыТеста);
        MySQL_ПолучитьСтруктуруФильтраЗаписей(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область GreenAPI

Процедура GAPI_Аккаунт() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_TestGroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);

    GreenAPI_АрхивироватьЧат(ПараметрыТеста);
    GreenAPI_РазархивироватьЧат(ПараметрыТеста);
    GreenAPI_СформироватьПараметрыДоступа(ПараметрыТеста);
    GreenAPI_ПолучитьНастройкиИнстанса(ПараметрыТеста);
    GreenAPI_ПолучитьИнформациюОбАккаунте(ПараметрыТеста);
    GreenAPI_ПолучитьСтруктуруНастроекИнстанса(ПараметрыТеста);
    GreenAPI_УстановитьНастройкиИнстанса(ПараметрыТеста);
    GreenAPI_ПолучитьСостояниеИнстанса(ПараметрыТеста);
    GreenAPI_УстановитьКартинкуПрофиля(ПараметрыТеста);
    // !DISABLED! GreenAPI_ПерезапуститьИнстанс(ПараметрыТеста);
    // !DISABLED! GreenAPI_ПолучитьКодАвторизации(ПараметрыТеста);
    // !DISABLED! GreenAPI_РазлогинитьИнстанс(ПараметрыТеста);
    // !DISABLED! GreenAPI_ПолучитьQR(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_УправлениеГруппами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"            , ПараметрыТеста);

    GreenAPI_СоздатьГруппу(ПараметрыТеста);
    GreenAPI_ПолучитьИнформациюОГруппе(ПараметрыТеста);
    GreenAPI_ИзменитьИмяГруппы(ПараметрыТеста);
    GreenAPI_УстановитьКартинкуГруппы(ПараметрыТеста);
    GreenAPI_ДобавитьУчастникаВГруппу(ПараметрыТеста);
    GreenAPI_ИсключитьУчастникаГруппы(ПараметрыТеста);
    GreenAPI_НазначитьПраваАдминистратора(ПараметрыТеста);
    GreenAPI_ОтозватьПраваАдминистратора(ПараметрыТеста);
    GreenAPI_ПокинутьГруппу(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_ОтправкаСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_TestGroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video"               , ПараметрыТеста);

    GreenAPI_ОтправитьТекстовоеСообщение(ПараметрыТеста);
    GreenAPI_ОтправитьФайл(ПараметрыТеста);
    GreenAPI_ОтправитьФайлПоURL(ПараметрыТеста);
    GreenAPI_ОтправитьОпрос(ПараметрыТеста);
    GreenAPI_ОтправитьЛокацию(ПараметрыТеста);
    GreenAPI_ОтправитьКонтакт(ПараметрыТеста);
    GreenAPI_ПереслатьСообщения(ПараметрыТеста);
    GreenAPI_ПолучитьОписаниеЛокации(ПараметрыТеста);
    GreenAPI_ПолучитьОписаниеКонтакта(ПараметрыТеста);
    GreenAPI_ИзменитьТекстСообщения(ПараметрыТеста);
    GreenAPI_УдалитьСообщение(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_ПолучениеУведомлений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"           , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"         , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_FileMessageID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_TestGroupID"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_DownloadMessageID", ПараметрыТеста);

    GreenAPI_ПолучитьУведомление(ПараметрыТеста);
    GreenAPI_УстановитьОтметкуПрочтения(ПараметрыТеста);
    // !DISABLED! GreenAPI_СкачатьФайлСообщения(ПараметрыТеста);
    GreenAPI_УдалитьУведомлениеИзОчереди(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_ОчередьСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"  , ПараметрыТеста);

    GreenAPI_ПолучитьОчередьСообщений(ПараметрыТеста);
    GreenAPI_ОчиститьОчередьСообщений(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_ЖурналыСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_TestGroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MessageID"  , ПараметрыТеста);

    GreenAPI_ПолучитьИсториюЧата(ПараметрыТеста);
    GreenAPI_ПолучитьСообщение(ПараметрыТеста);
    GreenAPI_ПолучитьЖурналВходящихСообщений(ПараметрыТеста);
    GreenAPI_ПолучитьЖурналИсходящихСообщений(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область RCON

Процедура RC_ВыполнениеКоманд() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RCON_URL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RCON_Password", ПараметрыТеста);

    RCON_СформироватьПараметрыСоединения(ПараметрыТеста);
    RCON_ОткрытьСоединение(ПараметрыТеста);
    RCON_ВыполнитьКоманду(ПараметрыТеста);
    RCON_ЭтоКоннектор(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область Ollama

Процедура OLLM_ОбработкаЗапросов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_URL"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_Token", ПараметрыТеста);

    Ollama_СкачатьМодель(ПараметрыТеста);
    Ollama_ПолучитьВерсию(ПараметрыТеста);
    Ollama_ПолучитьОтвет(ПараметрыТеста);
    Ollama_ПолучитьОтветВКонтексте(ПараметрыТеста);
    Ollama_ПолучитьПредставления(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруПараметровЗапроса(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруПараметровВКонтексте(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруСообщенияКонтекста(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруПараметровПредставлений(ПараметрыТеста);

КонецПроцедуры

Процедура OLLM_РаботаСМоделями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_URL"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_Token", ПараметрыТеста);

    Ollama_СкачатьМодель(ПараметрыТеста);
    Ollama_ЗагрузитьМодельВПамять(ПараметрыТеста);
    Ollama_ВыгрузитьМодельИзПамяти(ПараметрыТеста);
    Ollama_СоздатьМодель(ПараметрыТеста);
    Ollama_ПолучитьИнформациюОМодели(ПараметрыТеста);
    Ollama_ПолучитьСписокМоделей(ПараметрыТеста);
    Ollama_ПолучитьСписокЗапущенныхМоделей(ПараметрыТеста);
    Ollama_КопироватьМодель(ПараметрыТеста);
    Ollama_ОтправитьМодель(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруНастроекМодели(ПараметрыТеста);
    Ollama_УдалитьМодель(ПараметрыТеста);

КонецПроцедуры

Процедура OLLM_РаботаСBlob() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_URL"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"     , ПараметрыТеста);

    Ollama_ОтправитьBlob(ПараметрыТеста);
    Ollama_ПроверитьBlob(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область HTTP

Процедура HTTP_Инициализация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("HTTP_URL"  , ПараметрыТеста);

    HTTPКлиент_Инициализировать(ПараметрыТеста);
    HTTPКлиент_УстановитьURL(ПараметрыТеста);
    HTTPКлиент_УстановитьПараметрыURL(ПараметрыТеста);
    HTTPКлиент_УстановитьФайлОтвета(ПараметрыТеста);
    HTTPКлиент_УстановитьТипДанных(ПараметрыТеста);
    HTTPКлиент_ПолучитьЛог(ПараметрыТеста);
    HTTPКлиент_УстановитьПрокси(ПараметрыТеста);
    HTTPКлиент_УстановитьТаймаут(ПараметрыТеста);

КонецПроцедуры

Процедура HTTP_УстановкаТела() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("HTTP_URL", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);

    HTTPКлиент_УстановитьДвоичноеТело(ПараметрыТеста);
    HTTPКлиент_УстановитьСтроковоеТело(ПараметрыТеста);
    HTTPКлиент_УстановитьJsonТело(ПараметрыТеста);
    HTTPКлиент_УстановитьFormТело(ПараметрыТеста);
    HTTPКлиент_НачатьЗаписьТелаMultipart(ПараметрыТеста);
    HTTPКлиент_ДобавитьПолеMultipartFormData(ПараметрыТеста);
    HTTPКлиент_ДобавитьФайлMultipartFormData(ПараметрыТеста);
    HTTPКлиент_ДобавитьДанныеRelated(ПараметрыТеста);

КонецПроцедуры

Процедура HTTP_Настройки() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("HTTP_URL", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);

    HTTPКлиент_ИспользоватьКодировку(ПараметрыТеста);
    HTTPКлиент_ИспользоватьСжатиеGzip(ПараметрыТеста);
    HTTPКлиент_ИспользоватьПоляТелаВOAuth(ПараметрыТеста);
    HTTPКлиент_ИспользоватьКодированиеURL(ПараметрыТеста);
    HTTPКлиент_РазделятьМассивыВURL(ПараметрыТеста);
    HTTPКлиент_МаксимумПереадресаций(ПараметрыТеста);
    HTTPКлиент_МаксимумПопыток(ПараметрыТеста);
    HTTPКлиент_ВернутьНастройки(ПараметрыТеста);

КонецПроцедуры

Процедура HTTP_УстановкаЗаголовков() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("HTTP_URL", ПараметрыТеста);

    HTTPКлиент_УстановитьЗаголовки(ПараметрыТеста);
    HTTPКлиент_ДобавитьЗаголовок(ПараметрыТеста);

КонецПроцедуры

Процедура HTTP_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("HTTP_URL", ПараметрыТеста);

    HTTPКлиент_ДобавитьBasicАвторизацию(ПараметрыТеста);
    HTTPКлиент_ДобавитьBearerАвторизацию(ПараметрыТеста);
    HTTPКлиент_ДобавитьAWS4Авторизацию(ПараметрыТеста);
    HTTPКлиент_ДобавитьOAuthV1Авторизацию(ПараметрыТеста);
    HTTPКлиент_УстановитьАлгоритмOAuthV1(ПараметрыТеста);

КонецПроцедуры

Процедура HTTP_ОбработкаЗапроса() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("HTTP_URL", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);

    HTTPКлиент_ОбработатьЗапрос(ПараметрыТеста);
    HTTPКлиент_ВыполнитьЗапрос(ПараметрыТеста);
    HTTPКлиент_ВернутьЗапрос(ПараметрыТеста);
    HTTPКлиент_ВернутьСоединение(ПараметрыТеста);
    HTTPКлиент_ОтправитьДанныеЧастями(ПараметрыТеста);
    HTTPКлиент_ОтправитьЧасть(ПараметрыТеста);

КонецПроцедуры

Процедура HTTP_ПолучениеОтвета() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("HTTP_URL", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);

    HTTPКлиент_ВернутьОтвет(ПараметрыТеста);
    HTTPКлиент_ВернутьОтветКакJSONКоллекцию(ПараметрыТеста);
    HTTPКлиент_ВернутьОтветКакДвоичныеДанные(ПараметрыТеста);
    HTTPКлиент_ВернутьОтветКакСтроку(ПараметрыТеста);
    HTTPКлиент_ВернутьИмяФайлаТелаОтвета(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область OpenAI

Процедура OAI_ОбработкаЗапросов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_URL"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_Token2" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_URL2"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_File"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"       , ПараметрыТеста);

    OpenAI_ПолучитьОтвет(ПараметрыТеста);
    OpenAI_ПолучитьПредставления(ПараметрыТеста);
    OpenAI_ПолучитьСтруктуруСообщения(ПараметрыТеста);
    OpenAI_ПолучитьСтруктуруСообщенияКартинки(ПараметрыТеста);
    OpenAI_ПолучитьКартинки(ПараметрыТеста);
    OpenAI_ПолучитьСообщениеАссистента(ПараметрыТеста);
    OpenAI_ПолучитьСообщениеПользователя(ПараметрыТеста);
    OpenAI_ПолучитьСообщениеСистемы(ПараметрыТеста);

КонецПроцедуры

Процедура OAI_Ассистенты() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_URL"    , ПараметрыТеста);

    OpenAI_СоздатьАссистента(ПараметрыТеста);
    OpenAI_ПолучитьАссистента(ПараметрыТеста);
    OpenAI_ПолучитьСписокАссистентов(ПараметрыТеста);
    OpenAI_УдалитьАссистента(ПараметрыТеста);

КонецПроцедуры

Процедура OAI_РаботаСФайлами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_URL"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"       , ПараметрыТеста);

    OpenAI_ЗагрузитьФайл(ПараметрыТеста);
    OpenAI_ПолучитьИнформациюОФайле(ПараметрыТеста);
    OpenAI_ПолучитьСписокФайлов(ПараметрыТеста);
    OpenAI_СкачатьФайл(ПараметрыТеста);
    OpenAI_УдалитьФайл(ПараметрыТеста);

КонецПроцедуры

Процедура OAI_РаботаСАудио() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_URL"    , ПараметрыТеста);

    OpenAI_СгенерироватьРечь(ПараметрыТеста);
    OpenAI_СоздатьТранскрипцию(ПараметрыТеста);

КонецПроцедуры

Процедура OAI_РаботаСМоделями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("OpenAI_URL"    , ПараметрыТеста);

    OpenAI_ПолучитьСписокМоделей(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область MSSQL

Процедура MSS_ОсновныеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("PG_IP"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("PG_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("SQL2"       , ПараметрыТеста);

    MSSQL_СформироватьСтрокуПодключения(ПараметрыТеста);
    MSSQL_ОткрытьСоединение(ПараметрыТеста);
    MSSQL_ЗакрытьСоединение(ПараметрыТеста);
    MSSQL_ЭтоКоннектор(ПараметрыТеста);
    MSSQL_ВыполнитьЗапросSQL(ПараметрыТеста);
    MSSQL_ПолучитьНастройкиTLS(ПараметрыТеста);

КонецПроцедуры

Процедура MSS_ORM() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("PG_IP"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("PG_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"    , ПараметрыТеста);

    MSSQL_СоздатьБазуДанных(ПараметрыТеста);
    MSSQL_СоздатьТаблицу(ПараметрыТеста);
    MSSQL_ДобавитьЗаписи(ПараметрыТеста);
    MSSQL_ПолучитьЗаписи(ПараметрыТеста);
    MSSQL_ОбновитьЗаписи(ПараметрыТеста);
    MSSQL_УдалитьЗаписи(ПараметрыТеста);
    MSSQL_ОчиститьТаблицу(ПараметрыТеста);
    MSSQL_ПолучитьИнформациюОТаблице(ПараметрыТеста);
    MSSQL_ДобавитьКолонкуТаблицы(ПараметрыТеста);
    MSSQL_УдалитьКолонкуТаблицы(ПараметрыТеста);
    MSSQL_ГарантироватьТаблицу(ПараметрыТеста);
    MSSQL_УдалитьТаблицу(ПараметрыТеста);
    MSSQL_УдалитьБазуДанных(ПараметрыТеста);
    MSSQL_ПолучитьСтруктуруФильтраЗаписей(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область FTP

Процедура FT_РаботаСДиректориями() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровFTP();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        FTP_ОчиститьДиректорию(ПараметрыТеста);
        FTP_СоздатьНовуюДиректорию(ПараметрыТеста);
        FTP_ПолучитьТекущийКаталог(ПараметрыТеста);
        FTP_ИзменитьТекущийКаталог(ПараметрыТеста);
        FTP_ПолучитьСписокОбъектов(ПараметрыТеста);
        FTP_УдалитьДиректорию(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура FT_РаботаСФайлами() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровFTP();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        FTP_ЗагрузитьФайл(ПараметрыТеста);
        FTP_СохранитьФайл(ПараметрыТеста);
        FTP_ПолучитьДанныеФайла(ПараметрыТеста);
        FTP_УдалитьФайл(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура FT_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровFTP();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        FTP_ОткрытьСоединение(ПараметрыТеста);
        FTP_ПолучитьПриветственноеСообщение(ПараметрыТеста);
        FTP_ПолучитьСписокРасширенийПротокола(ПараметрыТеста);
        FTP_ПолучитьКонфигурациюСоединения(ПараметрыТеста);
        FTP_ЗакрытьСоединение(ПараметрыТеста);
        FTP_ЭтоКоннектор(ПараметрыТеста);
        FTP_ПолучитьНастройкиСоединения(ПараметрыТеста);
        FTP_ПолучитьНастройкиПрокси(ПараметрыТеста);
        FTP_ПолучитьНастройкиTLS(ПараметрыТеста);
        FTP_ПолучитьРазмерОбъекта(ПараметрыТеста);
        FTP_ИзменитьПуть(ПараметрыТеста);
        FTP_ВыполнитьНестандартнуюКоманду(ПараметрыТеста);
        FTP_ВыполнитьПроизвольнуюКоманду(ПараметрыТеста);
        FTP_Пинг(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ReportPortal

Процедура RPortal_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_URL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_Login"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_UserID"  , ПараметрыТеста);

    ReportPortal_ПолучитьВременныйТокен(ПараметрыТеста);
    ReportPortal_ПолучитьПостоянныйТокен(ПараметрыТеста);
    ReportPortal_УдалитьПостоянныйТокен(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область SSH

Процедура SShell_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровSSH();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        SSH_ОткрытьСоединение(ПараметрыТеста);
        SSH_ПолучитьКонфигурациюСоединения(ПараметрыТеста);
        SSH_ВыполнитьКоманду(ПараметрыТеста);
        SSH_ЗакрытьСоединение(ПараметрыТеста);
        SSH_ЭтоКоннектор(ПараметрыТеста);
        SSH_ПолучитьНастройкиЛогинПароль(ПараметрыТеста);
        SSH_ПолучитьНастройкиПриватныйКлюч(ПараметрыТеста);
        SSH_ПолучитьНастройкиЧерезАгента(ПараметрыТеста);
        SSH_ПолучитьНастройкиПрокси(ПараметрыТеста);

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(МассивВариантов[0]["SSH_Key"], "Ошибка удаления файла после теста");

КонецПроцедуры

#КонецОбласти

#Область SFTP

Процедура SF_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровSSH();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        SFTP_ОткрытьСоединение(ПараметрыТеста);
        SFTP_ПолучитьКонфигурациюСоединения(ПараметрыТеста);
        SFTP_ЭтоКоннектор(ПараметрыТеста);
        SFTP_ЗакрытьСоединение(ПараметрыТеста);
        SFTP_ПолучитьНастройкиЛогинПароль(ПараметрыТеста);
        SFTP_ПолучитьНастройкиПриватныйКлюч(ПараметрыТеста);
        SFTP_ПолучитьНастройкиЧерезАгента(ПараметрыТеста);
        SFTP_ПолучитьНастройкиПрокси(ПараметрыТеста);

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(МассивВариантов[0]["SSH_Key"], "Ошибка удаления файла после теста");

КонецПроцедуры

Процедура SF_РаботаСДиректориями() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровSSH();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        SFTP_ПолучитьТекущийКаталог(ПараметрыТеста);
        SFTP_ПолучитьСписокОбъектов(ПараметрыТеста);
        SFTP_СоздатьНовуюДиректорию(ПараметрыТеста);
        SFTP_УдалитьДиректорию(ПараметрыТеста);

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(МассивВариантов[0]["SSH_Key"], "Ошибка удаления файла после теста");

КонецПроцедуры

Процедура SF_РаботаСФайлами() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровSSH();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        SFTP_ЗагрузитьФайл(ПараметрыТеста);
        SFTP_ПолучитьИнформациюОФайле(ПараметрыТеста);
        SFTP_ПолучитьДанныеФайла(ПараметрыТеста);
        SFTP_СохранитьФайл(ПараметрыТеста);
        SFTP_ИзменитьПуть(ПараметрыТеста);
        SFTP_УдалитьФайл(ПараметрыТеста);

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(МассивВариантов[0]["SSH_Key"], "Ошибка удаления файла после теста");

КонецПроцедуры

#КонецОбласти

#Область GreenMax

Процедура GMax_Аккаунт() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Phone"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_AccountID"  , ПараметрыТеста);
    //OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_TestGroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);

    GreenMax_СформироватьПараметрыДоступа(ПараметрыТеста);
    // !DISABLED! GreenMax_РазлогинитьИнстанс(ПараметрыТеста);
    // !DISABLED! GreenMax_ПолучитьКодАвторизации(ПараметрыТеста);
    // !DISABLED! GreenMax_ОтправитьКодАвторизации(ПараметрыТеста);
    GreenMax_ПолучитьСостояниеИнстанса(ПараметрыТеста);
    GreenMax_ПолучитьНастройкиИнстанса(ПараметрыТеста);
    GreenMax_УстановитьНастройкиИнстанса(ПараметрыТеста);
    GreenMax_ПолучитьСтруктуруНастроекИнстанса(ПараметрыТеста);
    GreenMax_УстановитьКартинкуПрофиля(ПараметрыТеста);
    GreenMax_ПолучитьИнформациюОбАккаунте(ПараметрыТеста);
    GreenMax_ПроверитьАккаунт(ПараметрыТеста);
    GreenMax_ПолучитьСписокКонтактов(ПараметрыТеста);
    GreenMax_ПолучитьИнформациюОКонтакте(ПараметрыТеста);
    GreenMax_ПолучитьСписокЧатов(ПараметрыТеста);
    GreenMax_ПолучитьАватарЧата(ПараметрыТеста);
    GreenMax_ПерезапуститьИнстанс(ПараметрыТеста);

КонецПроцедуры

Процедура GMax_РаботаСГруппами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Phone"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MainGroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture3"            , ПараметрыТеста);

    GreenMax_ПолучитьСписокКонтактов(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_СоздатьГруппу(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ПолучитьИнформациюОГруппе(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ИзменитьИмяГруппы(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ИзменитьНастройкиГруппы(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_НазначитьПраваАдминистратора(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ОтозватьПраваАдминистратора(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_УдалитьУчастникаГруппы(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ДобавитьУчастникаГруппы(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_УстановитьКартинкуГруппы(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ВыйтиИзГруппы(ПараметрыТеста);
    GreenMax_ПолучитьСтруктуруНастроекГруппы(ПараметрыТеста);

КонецПроцедуры

Процедура GMax_ОтправкаСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Phone"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video"               , ПараметрыТеста);

    GreenMax_ПолучитьСписокКонтактов(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_СоздатьГруппу(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ОтправитьТекстовоеСообщение(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ОтправитьФайл(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ОтправитьФайлПоURL(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_УдалитьУчастникаГруппы(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ВыйтиИзГруппы(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);

КонецПроцедуры

Процедура GMax_Уведомления() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Phone"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_AccountID"  , ПараметрыТеста);

    GreenMax_ПолучитьУведомление(ПараметрыТеста);
    GreenMax_УдалитьУведомление(ПараметрыТеста);

КонецПроцедуры

Процедура GMax_ИсторияСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Phone"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MainGroupID", ПараметрыТеста);

    GreenMax_ОтметитьСообщенияКакПрочитанные(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ПолучитьИсториюСообщенийЧата(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ПолучитьСообщениеЧата(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ПолучитьЖурналВходящихСообщений(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ПолучитьЖурналИсходящихСообщений(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);

КонецПроцедуры

Процедура GMax_Очереди() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_Phone"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenMax_MainGroupID", ПараметрыТеста);

    GreenMax_ПолучитьКоличествоСообщенийКОтправке(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ПолучитьОчередьСообщенийКОтправке(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ОчиститьОчередьСообщенийКОтправке(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ПолучитьКоличествоВходящихУведомлений(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);
    GreenMax_ОчиститьОчередьВходящихУведомлений(ПараметрыТеста);
    OPI_Инструменты.Пауза(1);

КонецПроцедуры

#КонецОбласти

#Область MongoDB

Процедура Mongo_ОсновныеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Port"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_User"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_DB"      , ПараметрыТеста);

    MongoDB_СформироватьСтрокуПодключения(ПараметрыТеста);
    MongoDB_ОткрытьСоединение(ПараметрыТеста);
    MongoDB_ЗакрытьСоединение(ПараметрыТеста);
    MongoDB_ЭтоКоннектор(ПараметрыТеста);
    MongoDB_ВыполнитьКоманду(ПараметрыТеста);

КонецПроцедуры

Процедура Mongo_РаботаСБазами() Экспорт

    ПараметрыТеста = Новый Структура;

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Port"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_User"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_DB"      , ПараметрыТеста);

    MongoDB_ПолучитьБазуДанных(ПараметрыТеста);
    MongoDB_ПолучитьСписокБаз(ПараметрыТеста);
    MongoDB_УдалитьБазуДанных(ПараметрыТеста);

КонецПроцедуры

Процедура Mongo_РаботаСКоллекциями() Экспорт

    ПараметрыТеста = Новый Структура;

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Port"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_User"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_DB"      , ПараметрыТеста);

    MongoDB_СоздатьКоллекцию(ПараметрыТеста);
    MongoDB_ПолучитьСписокКоллекций(ПараметрыТеста);
    MongoDB_УдалитьКоллекцию(ПараметрыТеста);

КонецПроцедуры

Процедура Mongo_РаботаСДокументами() Экспорт

    ПараметрыТеста = Новый Структура;

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Port"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_User"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_DB"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    MongoDB_ВставитьДокументы(ПараметрыТеста);
    MongoDB_ПолучитьДокументы(ПараметрыТеста);
    MongoDB_ПолучитьКурсор(ПараметрыТеста);
    MongoDB_ПолучитьПакетДокументов(ПараметрыТеста);
    MongoDB_ОбновитьДокументы(ПараметрыТеста);
    MongoDB_УдалитьДокументы(ПараметрыТеста);
    MongoDB_ПолучитьСтруктуруОбновленияДокументов(ПараметрыТеста);
    MongoDB_ПолучитьСтруктуруУдаленияДокументов(ПараметрыТеста);

КонецПроцедуры

Процедура Mongo_УправлениеПользователями() Экспорт

    ПараметрыТеста = Новый Структура;

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Port"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_User"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_DB"      , ПараметрыТеста);

    MongoDB_СоздатьПользователя(ПараметрыТеста);
    MongoDB_ИзменитьПользователя(ПараметрыТеста);
    MongoDB_ПолучитьПользователей(ПараметрыТеста);
    MongoDB_ПолучитьПользователейБазы(ПараметрыТеста);
    MongoDB_УдалитьПользователя(ПараметрыТеста);

КонецПроцедуры

Процедура Mongo_УправлениеРолями() Экспорт

    ПараметрыТеста = Новый Структура;

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Port"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_User"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("MongoDB_DB"      , ПараметрыТеста);

    MongoDB_СоздатьРоль(ПараметрыТеста);
    MongoDB_ПолучитьРоли(ПараметрыТеста);
    MongoDB_НазначитьРоли(ПараметрыТеста);
    MongoDB_СнятьРоли(ПараметрыТеста);
    MongoDB_ИзменитьРоль(ПараметрыТеста);
    MongoDB_УдалитьРоль(ПараметрыТеста);
    MongoDB_ПолучитьСтруктуруПривелегииРоли(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#Область GRPC

Процедура GR_ОсновныеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Address"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_AddressNoTls", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Proto"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoTS"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoImport" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"         , ПараметрыТеста);

    GRPC_ОткрытьСоединение(ПараметрыТеста);
    GRPC_ЗакрытьСоединение(ПараметрыТеста);
    GRPC_ЭтоКоннектор(ПараметрыТеста);
    GRPC_УстановитьМетаданные(ПараметрыТеста);
    GRPC_ВызватьМетод(ПараметрыТеста);
    GRPC_ПолучитьНастройкиTls(ПараметрыТеста);
    GRPC_ПолучитьПараметрыСоединения(ПараметрыТеста);

КонецПроцедуры

Процедура GR_Интроспекция() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Address"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Proto"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoImport", ПараметрыТеста);

    GRPC_ПолучитьСписокСервисов(ПараметрыТеста);
    GRPC_ПолучитьСписокМетодов(ПараметрыТеста);
    GRPC_ПолучитьМетод(ПараметрыТеста);

КонецПроцедуры

Процедура GR_Стриминг() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Address"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_AddressNoTls", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_Proto"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoTS"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GRPC_ProtoImport" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"         , ПараметрыТеста);

    GRPC_ИнициализироватьСерверныйПоток(ПараметрыТеста);
    GRPC_ИнициализироватьКлиентскийПоток(ПараметрыТеста);
    GRPC_ИнициализироватьДвунаправленныйПоток(ПараметрыТеста);
    GRPC_ОтправитьСообщение(ПараметрыТеста);
    GRPC_ПолучитьСообщение(ПараметрыТеста);
    GRPC_ЗакрытьПоток(ПараметрыТеста);
    GRPC_ОбработатьСерверныйПоток(ПараметрыТеста);
    GRPC_ОбработатьКлиентскийПоток(ПараметрыТеста);
    GRPC_ОбработатьДвунаправленныйПоток(ПараметрыТеста);
    GRPC_ЗавершитьОтправку(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыВК()

    Параметры   = Новый Структура;
    НомерГруппы = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("VK_GroupID");

    Параметры.Вставить("access_token", OPI_ПолучениеДанныхТестов.ПолучитьПараметр("VK_Token"));
    Параметры.Вставить("owner_id"    , "-" + НомерГруппы);
    Параметры.Вставить("app_id"      , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("VK_AppID"));
    Параметры.Вставить("group_id"    , НомерГруппы);

    Возврат Параметры;

КонецФункции

Функция ПолучитьПараметрыАвторизацииТвиттер()

    Параметры = Новый Соответствие;

    ТокенСервера = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Access_Token");

    URL = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_TokenURL");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьBearerАвторизацию(ТокенСервера) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    Токен = Результат["data"];

    Параметры.Вставить("redirect_uri"      , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_Redirect"));
    Параметры.Вставить("client_id"         , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_ClinetID"));
    Параметры.Вставить("client_secret"     , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_ClientSecret"));
    Параметры.Вставить("access_token"      , Токен);
    Параметры.Вставить("refresh_token"     , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_Refresh"));
    Параметры.Вставить("oauth_token"       , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_OAuthToken"));
    Параметры.Вставить("oauth_token_secret", OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_OAuthSecret"));

    Параметры.Вставить("oauth_consumer_key"   , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_OAuthConsumerKey"));
    Параметры.Вставить("oauth_consumer_secret", OPI_ПолучениеДанныхТестов.ПолучитьПараметр(
        "Twitter_OAuthConsumerSecret"));

    Возврат Параметры;

КонецФункции

//@skip-check method-too-many-params
Процедура Обработать(Знач Результат
    , Знач Библиотека
    , Знач Метод
    , Знач Вариант = ""
    , ДопПараметр1 = Неопределено
    , ДопПараметр2 = Неопределено
    , ДопПараметр3 = Неопределено)

    CLITestsMark = 0;

    Константы.ЭтоТестыCLI.Установить(CLITestsMark); // !OPI
    // !OInt УстановитьПеременнуюСреды("OINT_TESTS_CLI", CLITestsMark);

    OPI_ПолучениеДанныхТестов.ОбработатьРезультатТестирования(Результат
        , Метод
        , Библиотека
        , Вариант
        , ДопПараметр1
        , ДопПараметр2
        , ДопПараметр3);

КонецПроцедуры

#Область АтомарныеТесты

#Область Telegram

Процедура Telegram_ПолучитьИнформациюБота(ПараметрыФункции)

    Токен     = ПараметрыФункции["Telegram_Token"];
    Результат = OPI_Telegram.ПолучитьИнформациюБота(Токен);

    // END

    Обработать(Результат, "Telegram", "ПолучитьИнформациюБота");

КонецПроцедуры

Процедура Telegram_ПолучитьОбновления(ПараметрыФункции)

    Токен     = ПараметрыФункции["Telegram_Token"];
    Результат = OPI_Telegram.ПолучитьОбновления(Токен);

    // END

    Обработать(Результат, "Telegram", "ПолучитьОбновления");

КонецПроцедуры

Процедура Telegram_УстановитьWebhook(ПараметрыФункции)

    Токен = ПараметрыФункции["Telegram_Token"];
    URL   = ПараметрыФункции["Telegram_URL"];

    Результат = OPI_Telegram.УстановитьWebhook(Токен, URL);

    // END

    Обработать(Результат, "Telegram", "УстановитьWebhook");

КонецПроцедуры

Процедура Telegram_УдалитьWebhook(ПараметрыФункции)

    Токен     = ПараметрыФункции["Telegram_Token"];
    Результат = OPI_Telegram.УдалитьWebhook(Токен);

    // END

    Обработать(Результат, "Telegram", "УдалитьWebhook");

КонецПроцедуры

Процедура Telegram_ОтправитьТекстовоеСообщение(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Текст    = ПараметрыФункции["String"];

    МассивКнопокКлавиатуры = Новый Массив;
    МассивКнопокКлавиатуры.Добавить("Кнопка1");
    МассивКнопокКлавиатуры.Добавить("Кнопка2");

    // С клавиатурой, в чат
    Клавиатура = OPI_Telegram.СформироватьКлавиатуруПоМассивуКнопок(МассивКнопокКлавиатуры, Истина);
    Результат  = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDЧата, Текст, Клавиатура);

    Обработать(Результат, "Telegram", "ОтправитьТекстовоеСообщение", , ПараметрыФункции, Текст); // SKIP

    // Простое, в канал
    Результат = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDКанала, Текст);

    // END

    Обработать(Результат, "Telegram", "ОтправитьТекстовоеСообщение", "Канал", ПараметрыФункции, Текст);

    Текст     = "<b>Текст html %F0%9F%93%9E 10%</b>";
    Результат = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDКанала, Текст, , "HTML");

    Обработать(Результат, "Telegram", "ОтправитьТекстовоеСообщение", "HTML");

    Текст     = "%F0%9F%A4%BC";
    Результат = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDЧата, Текст);

    Обработать(Результат, "Telegram", "ОтправитьТекстовоеСообщение", "Emoji");

    Текст     = "Текст %F0%9F%A5%9D и emoji \(10%\)";
    Результат = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDКанала, Текст, , "MarkdownV2");

    Обработать(Результат, "Telegram", "ОтправитьТекстовоеСообщение", "Текст + Emoji");

    Клавиатура = OPI_Инструменты.JsonВСтруктуру(Клавиатура, Ложь);
    Результат  = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDЧата, Текст, Клавиатура);

    Обработать(Результат, "Telegram", "ОтправитьТекстовоеСообщение", "Клавиатура структура");

    Текст = "%F0%9F%94%A5 *Новый релиз\!*
    |
    |%F0%9F%8F%B0 *Репозиторий*: [240596448/devtools](https://github.com/240596448/devtools)
    |%F0%9F%94%A2 *Версия*: \{0.6.0}
    |%F0%9F%93%85 *Дата релиза*: 6 декабря 2025 г.
    |
    |>*AI сводка*
    |>Devtools - это инструмент для автоматизации работы с конфигурациями\расширениями 1С:Предприятия и интеграции с Git. Приложение позволяет выгружать и загружать объекты, а также синхронизировать изменения между Git и хранилищем 1С. В релизе 0.6.0 реализованы оптимизация логики работы и добавлено логирование, что способствует стабильности и упрощает анализ работы приложения.
    |
    |
    |_Не забывайте ставить %E2%AD%90 понравившимся проектам_";

    Результат = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDЧата, Текст , , "MarkdownV2");

    Обработать(Результат, "Telegram", "ОтправитьТекстовоеСообщение", "Сложный");

КонецПроцедуры

Процедура Telegram_СформироватьКлавиатуруПоМассивуКнопок(ПараметрыФункции)

    МассивКнопок = Новый Массив;
    МассивКнопок.Добавить("Кнопка1");
    МассивКнопок.Добавить("Кнопка2");
    МассивКнопок.Добавить("Кнопка3");

    Результат = OPI_Telegram.СформироватьКлавиатуруПоМассивуКнопок(МассивКнопок);

    // END

    Обработать(Результат, "Telegram", "СформироватьКлавиатуруПоМассивуКнопок");

КонецПроцедуры

Процедура Telegram_ОтправитьКартинку(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Текст    = ПараметрыФункции["String"];
    Картинка = ПараметрыФункции["Picture"];

    КартинкаПуть = ПолучитьИмяВременногоФайла("png");
    КопироватьФайл(Картинка, КартинкаПуть);

    КартинкаДД = Новый ДвоичныеДанные(КартинкаПуть);

    // В чат, по URL
    Результат = OPI_Telegram.ОтправитьКартинку(Токен, IDЧата, Текст, Картинка);

    Обработать(Результат, "Telegram", "ОтправитьКартинку", , ПараметрыФункции, Текст);       // SKIP

    // В канал, на диске
    Результат = OPI_Telegram.ОтправитьКартинку(Токен, IDКанала, Текст, КартинкаПуть);

    Обработать(Результат, "Telegram", "ОтправитьКартинку", "Путь", ПараметрыФункции, Текст); // SKIP

    // В канал, из двоичных данных
    Результат = OPI_Telegram.ОтправитьКартинку(Токен, IDКанала, Текст, КартинкаДД);

    // END

    Обработать(Результат, "Telegram", "ОтправитьКартинку", "Двоичные", ПараметрыФункции, Текст);

    МассивКнопок = Новый Массив;
    МассивКнопок.Добавить("Кнопка1");
    МассивКнопок.Добавить("Кнопка2");
    МассивКнопок.Добавить("Кнопка3");

    Клавиатура = OPI_Telegram.СформироватьКлавиатуруПоМассивуКнопок(МассивКнопок, Истина);
    Результат  = OPI_Telegram.ОтправитьКартинку(Токен, IDЧата, Текст, Картинка, Клавиатура);

    Обработать(Результат, "Telegram", "ОтправитьКартинку", "Клавиатура", ПараметрыФункции, Текст);

    Клавиатура = OPI_Инструменты.JsonВСтруктуру(Клавиатура);
    Результат  = OPI_Telegram.ОтправитьКартинку(Токен, IDКанала, Текст, Картинка, Клавиатура);

    Обработать(Результат, "Telegram", "ОтправитьКартинку", "Клавиатура коллекция", ПараметрыФункции, Текст);

    Текст     = "Текст %F0%9F%A5%9D и emoji \(10%\)";
    Результат = OPI_Telegram.ОтправитьКартинку(Токен, IDКанала, Текст, Картинка, , "MarkdownV2");

    Обработать(Результат, "Telegram", "ОтправитьКартинку", "Текст + Emoji");

    Текст = "%F0%9F%94%A5 *Новый релиз\!*
    |
    |%F0%9F%8F%B0 *Репозиторий*: [240596448/devtools](https://github.com/240596448/devtools)
    |%F0%9F%94%A2 *Версия*: \{0.6.0}
    |%F0%9F%93%85 *Дата релиза*: 6 декабря 2025 г.
    |
    |>*AI сводка*
    |>Devtools - это инструмент для автоматизации работы с конфигурациями\расширениями 1С:Предприятия и интеграции с Git. Приложение позволяет выгружать и загружать объекты, а также синхронизировать изменения между Git и хранилищем 1С. В релизе 0.6.0 реализованы оптимизация логики работы и добавлено логирование, что способствует стабильности и упрощает анализ работы приложения.
    |
    |
    |_Не забывайте ставить %E2%AD%90 понравившимся проектам_";

    Результат = OPI_Telegram.ОтправитьКартинку(Токен, IDЧата, Текст , Картинка, , "MarkdownV2");

    Обработать(Результат, "Telegram", "ОтправитьКартинку", "Сложный");

    OPI_Инструменты.УдалитьФайлВПопытке(КартинкаПуть, "Не удалось удалить временный файл после теста!");

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура Telegram_ОтправитьВидео(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Текст    = ПараметрыФункции["String"];
    Видео    = ПараметрыФункции["Video"];

    ВидеоПуть = ПолучитьИмяВременногоФайла("mp4");
    КопироватьФайл(Видео, ВидеоПуть);

    ВидеоДД = Новый ДвоичныеДанные(ВидеоПуть);

    // В чат, по URL
    Результат = OPI_Telegram.ОтправитьВидео(Токен, IDЧата, Текст, Видео);

    Обработать(Результат, "Telegram", "ОтправитьВидео", , ПараметрыФункции, Текст); // SKIP

    // В канал, на диске
    Результат = OPI_Telegram.ОтправитьВидео(Токен, IDКанала, Текст, ВидеоПуть);

    Обработать(Результат, "Telegram", "ОтправитьВидео", "Путь", ПараметрыФункции, Текст); // SKIP

    // В канал, из двоичных данных
    Результат = OPI_Telegram.ОтправитьВидео(Токен, IDКанала, Текст, ВидеоДД);

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(ВидеоПуть, "Не удалось удалить временный файл после теста!");
    Обработать(Результат, "Telegram", "ОтправитьВидео", "Двоичные", ПараметрыФункции, Текст);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура Telegram_ОтправитьАудио(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Текст    = ПараметрыФункции["String"];
    Аудио    = ПараметрыФункции["Audio"];

    АудиоПуть = ПолучитьИмяВременногоФайла("mp3");
    КопироватьФайл(Аудио, АудиоПуть);

    АудиоДД = Новый ДвоичныеДанные(АудиоПуть);

    // В чат, по URL
    Результат = OPI_Telegram.ОтправитьАудио(Токен, IDЧата, Текст, Аудио);

    Обработать(Результат, "Telegram", "ОтправитьАудио", , ПараметрыФункции, Текст); // SKIP

    // В канал, на диске
    Результат = OPI_Telegram.ОтправитьАудио(Токен, IDКанала, Текст, АудиоПуть);

    Обработать(Результат, "Telegram", "ОтправитьАудио", "Путь", ПараметрыФункции, Текст); // SKIP

    // В канал, из двоичных данных
    Результат = OPI_Telegram.ОтправитьАудио(Токен, IDКанала, Текст, АудиоДД);

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(АудиоПуть, "Не удалось удалить временный файл после теста!");
    Обработать(Результат, "Telegram", "ОтправитьАудио", "Двоичные", ПараметрыФункции, Текст);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура Telegram_ОтправитьДокумент(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Текст    = ПараметрыФункции["String"];
    Документ = ПараметрыФункции["Document"];

    ДокументПуть = ПолучитьИмяВременногоФайла("docx");
    КопироватьФайл(Документ, ДокументПуть);

    ДокументДД = Новый ДвоичныеДанные(ДокументПуть);

    // В чат, по URL
    Результат = OPI_Telegram.ОтправитьДокумент(Токен, IDЧата, Текст, Документ);

    Обработать(Результат, "Telegram", "ОтправитьДокумент", , ПараметрыФункции, Текст); // SKIP

    // В чат, по URL, с указанием имени файла
    Результат = OPI_Telegram.ОтправитьДокумент(Токен, IDЧата, Текст, Документ, , , "customname.docx");

    Обработать(Результат, "Telegram", "ОтправитьДокумент", "С именем", ПараметрыФункции, Текст); // SKIP

    // В канал, на диске
    Результат = OPI_Telegram.ОтправитьДокумент(Токен, IDКанала, Текст, ДокументПуть);

    Обработать(Результат, "Telegram", "ОтправитьДокумент", "Путь", ПараметрыФункции, Текст); // SKIP

    // В канал, из двоичных данных, с указанием имени файла
    Результат = OPI_Telegram.ОтправитьДокумент(Токен, IDКанала, Текст, ДокументДД, , , "customname.docx");

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(ДокументПуть, "Не удалось удалить временный файл после теста!");
    Обработать(Результат, "Telegram", "ОтправитьДокумент", "Двоичные", ПараметрыФункции, Текст);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура Telegram_ОтправитьГифку(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Текст    = ПараметрыФункции["String"];
    Гифка    = ПараметрыФункции["GIF"];

    ГифкаПуть = ПолучитьИмяВременногоФайла("gif");
    КопироватьФайл(Гифка, ГифкаПуть);

    ГифкаДД = Новый ДвоичныеДанные(ГифкаПуть);

    // В чат, по URL
    Результат = OPI_Telegram.ОтправитьГифку(Токен, IDЧата, Текст, Гифка);

    Обработать(Результат, "Telegram", "ОтправитьГифку", , ПараметрыФункции, Текст); // SKIP

    // В канал, на диске
    Результат = OPI_Telegram.ОтправитьГифку(Токен, IDКанала, Текст, ГифкаПуть);

    Обработать(Результат, "Telegram", "ОтправитьГифку", "Путь", ПараметрыФункции, Текст); // SKIP

    // В канал, из двоичных данных
    Результат = OPI_Telegram.ОтправитьГифку(Токен, IDКанала, Текст, ГифкаДД);

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(ГифкаПуть, "Не удалось удалить временный файл после теста!");
    Обработать(Результат, "Telegram", "ОтправитьГифку", "Двоичные", ПараметрыФункции, Текст);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура Telegram_ОтправитьМедиагруппу(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    Текст    = ПараметрыФункции["String"];
    Картинка = ПараметрыФункции["Picture"];
    Видео    = ПараметрыФункции["Video"];

    КартинкаПуть = ПолучитьИмяВременногоФайла("png");
    КопироватьФайл(Картинка, КартинкаПуть);

    ВидеоПуть = ПолучитьИмяВременногоФайла("mp4");
    КопироватьФайл(Видео, ВидеоПуть);

    ВидеоДД = Новый ДвоичныеДанные(ВидеоПуть);

    Медиагруппа = Новый Соответствие;
    Медиагруппа.Вставить(КартинкаПуть, "photo");
    Медиагруппа.Вставить(ВидеоДД     , "video");

    Результат = OPI_Telegram.ОтправитьМедиагруппу(Токен, IDЧата, Текст, Медиагруппа);

    // END

    Обработать(Результат, "Telegram", "ОтправитьМедиагруппу");

    ДокументURL  = ПараметрыФункции["Document"];
    ДокументПуть = ПолучитьИмяВременногоФайла("docx");
    IDКанала     = ПараметрыФункции["Telegram_ChannelID"];

    КопироватьФайл(ДокументURL, ДокументПуть);

    МедиаГруппа = Новый Соответствие;
    Медиагруппа.Вставить(ДокументURL , "document");
    Медиагруппа.Вставить(ДокументПуть, "document");

    Результат = OPI_Telegram.ОтправитьМедиагруппу(Токен, IDКанала, Текст, Медиагруппа);

    OPI_Инструменты.УдалитьФайлВПопытке(ВидеоПуть   , "Не удалось удалить временный файл после теста!");
    OPI_Инструменты.УдалитьФайлВПопытке(КартинкаПуть, "Не удалось удалить временный файл после теста!");
    OPI_Инструменты.УдалитьФайлВПопытке(ДокументПуть, "Не удалось удалить временный файл после теста!");

    Обработать(Результат, "Telegram", "ОтправитьМедиагруппу", "Документы");

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура Telegram_ОтправитьМестоположение(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Ширина   = ПараметрыФункции["Lat"];
    Долгота  = ПараметрыФункции["Long"];

    Результат = OPI_Telegram.ОтправитьМестоположение(Токен, IDЧата, Ширина, Долгота);

    Обработать(Результат, "Telegram", "ОтправитьМестоположение"); // SKIP

    Результат = OPI_Telegram.ОтправитьМестоположение(Токен, IDКанала, Ширина, Долгота);

    // END

    Обработать(Результат, "Telegram", "ОтправитьМестоположение", "Канал");

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура Telegram_ОтправитьКонтакт(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Имя      = ПараметрыФункции["Name"];
    Фамилия  = ПараметрыФункции["Surname"];
    Телефон  = ПараметрыФункции["Phone"];

    Результат = OPI_Telegram.ОтправитьКонтакт(Токен, IDЧата, Имя, Фамилия, Телефон);

    Обработать(Результат, "Telegram", "ОтправитьКонтакт", , Имя); // SKIP

    Результат = OPI_Telegram.ОтправитьКонтакт(Токен, IDКанала, Имя, Фамилия, Телефон);

    // END

    Обработать(Результат, "Telegram", "ОтправитьКонтакт", "Канал", Имя);

КонецПроцедуры

Процедура Telegram_ОтправитьОпрос(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDЧата   = ПараметрыФункции["Telegram_ChatID"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];
    Вопрос   = "Какой ваш любимый цвет?";

    МассивОтветов = Новый Массив;
    МассивОтветов.Добавить("Красный");
    МассивОтветов.Добавить("Желтый");
    МассивОтветов.Добавить("Зеленый");
    МассивОтветов.Добавить("Синий");

    Результат = OPI_Telegram.ОтправитьОпрос(Токен, IDЧата, Вопрос, МассивОтветов, Ложь);

    Обработать(Результат, "Telegram", "ОтправитьОпрос", , Вопрос); // SKIP

    Результат = OPI_Telegram.ОтправитьОпрос(Токен, IDКанала, Вопрос, МассивОтветов, Истина);

    Обработать(Результат, "Telegram", "ОтправитьОпрос", "Канал", Вопрос); // SKIP

    // END

    СтрочныйМассив = "['Красный', 'Желтый','Зеленый' ,'Синий']";

    Результат = OPI_Telegram.ОтправитьОпрос(Токен, IDКанала, Вопрос, СтрочныйМассив, Истина);

    Обработать(Результат, "Telegram", "ОтправитьОпрос", "Вопросы строкой", Вопрос);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура Telegram_СкачатьФайл(ПараметрыФункции)

    IDФайла = ПараметрыФункции["Telegram_FileID"];
    Токен   = ПараметрыФункции["Telegram_Token"];

    Результат = OPI_Telegram.СкачатьФайл(Токен, IDФайла);

    // END

    Обработать(Результат, "Telegram", "СкачатьФайл");

КонецПроцедуры

Процедура Telegram_ПереслатьСообщение(ПараметрыФункции)

    Токен       = ПараметрыФункции["Telegram_Token"];
    IDЧата      = ПараметрыФункции["Telegram_ChatID"];
    IDКанала    = ПараметрыФункции["Telegram_ChannelID"];
    IDСообщения = ПараметрыФункции["Telegram_ChannelMessageID"];

    Результат = OPI_Telegram.ПереслатьСообщение(Токен, IDСообщения, IDКанала, IDЧата);

    // END

    Обработать(Результат, "Telegram", "ПереслатьСообщение", , IDСообщения);

КонецПроцедуры

Процедура Telegram_Бан(ПараметрыФункции)

    Токен          = ПараметрыФункции["Telegram_Token"];
    IDПользователя = ПараметрыФункции["Telegram_ChatID"];
    IDКанала       = ПараметрыФункции["Telegram_ChannelID"];

    Результат = OPI_Telegram.Бан(Токен, IDКанала, IDПользователя);

    // END

    Обработать(Результат, "Telegram", "Бан");

КонецПроцедуры

Процедура Telegram_Разбан(ПараметрыФункции)

    Токен          = ПараметрыФункции["Telegram_Token"];
    IDПользователя = ПараметрыФункции["Telegram_ChatID"];
    IDКанала       = ПараметрыФункции["Telegram_ChannelID"];

    Результат = OPI_Telegram.Разбан(Токен, IDКанала, IDПользователя);

    // END

    Обработать(Результат, "Telegram", "Разбан");

КонецПроцедуры

Процедура Telegram_СоздатьСсылкуПриглашение(ПараметрыФункции)

    Токен       = ПараметрыФункции["Telegram_Token"];
    IDКанала    = ПараметрыФункции["Telegram_ChannelID"];
    Сутки       = 86400;
    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();

    Заголовок     = "Ссылка " + Строка(ТекущаяДата);
    Истечение     = ТекущаяДата + Сутки;
    UnixИстечение = OPI_Инструменты.UNIXTime(Истечение);

    Результат = OPI_Telegram.СоздатьСсылкуПриглашение(Токен, IDКанала, Заголовок, Истечение, 200);

    // END

    Обработать(Результат, "Telegram", "СоздатьСсылкуПриглашение", , Заголовок, UnixИстечение);

КонецПроцедуры

Процедура Telegram_ЗакрепитьСообщение(ПараметрыФункции)

    Токен       = ПараметрыФункции["Telegram_Token"];
    IDКанала    = ПараметрыФункции["Telegram_ChannelID"];
    IDСообщения = ПараметрыФункции["Telegram_ChannelMessageID"];

    Результат = OPI_Telegram.ЗакрепитьСообщение(Токен, IDКанала, IDСообщения);

    // END

    Обработать(Результат, "Telegram", "ЗакрепитьСообщение");

КонецПроцедуры

Процедура Telegram_ОткрепитьСообщение(ПараметрыФункции)

    Токен       = ПараметрыФункции["Telegram_Token"];
    IDКанала    = ПараметрыФункции["Telegram_ChannelID"];
    IDСообщения = ПараметрыФункции["Telegram_ChannelMessageID"];

    Результат = OPI_Telegram.ОткрепитьСообщение(Токен, IDКанала, IDСообщения);

    // END

    Обработать(Результат, "Telegram", "ОткрепитьСообщение");

КонецПроцедуры

Процедура Telegram_ПолучитьЧислоУчастников(ПараметрыФункции)

    Токен    = ПараметрыФункции["Telegram_Token"];
    IDКанала = ПараметрыФункции["Telegram_ChannelID"];

    Результат = OPI_Telegram.ПолучитьЧислоУчастников(Токен, IDКанала);

    // END

    Обработать(Результат, "Telegram", "ПолучитьЧислоУчастников");

КонецПроцедуры

Процедура Telegram_ПолучитьСписокИконокАватаров(ПараметрыФункции)

    Токен     = ПараметрыФункции["Telegram_Token"];
    Результат = OPI_Telegram.ПолучитьСписокИконокАватаров(Токен);

    // END

    Обработать(Результат, "Telegram", "ПолучитьСписокИконокАватаров");

КонецПроцедуры

Процедура Telegram_СоздатьТемуФорума(ПараметрыФункции)

    Токен  = ПараметрыФункции["Telegram_Token"];
    Чат    = ПараметрыФункции["Telegram_ForumID"];
    Иконка = "5357419403325481346";
    Имя    = "Тестовая тема " + Строка(Новый УникальныйИдентификатор);

    Результат = OPI_Telegram.СоздатьТемуФорума(Токен, Чат, Имя, Иконка);

    // END

    Обработать(Результат, "Telegram", "СоздатьТемуФорума", , ПараметрыФункции, Имя, Иконка);

    ЧатТема = Чат + "*" + ПараметрыФункции["Telegram_TopicID"];
    Текст   = ПараметрыФункции["String"];

    Результат = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, ЧатТема, Текст);

    Обработать(Результат, "Telegram", "СоздатьТемуФорума", "Сообщение", ПараметрыФункции, Текст);

КонецПроцедуры

Процедура Telegram_ИзменитьТемуФорума(ПараметрыФункции)

    Токен      = ПараметрыФункции["Telegram_Token"];
    Чат        = ПараметрыФункции["Telegram_ForumID"];
    Тема       = ПараметрыФункции["Telegram_TopicID"];
    НовоеИмя   = "Новый тестовый заголовок";
    НовяИконка = "5310132165583840589";

    Результат = OPI_Telegram.ИзменитьТемуФорума(Токен, Чат, Тема, НовоеИмя, НовяИконка);

    // END

    Обработать(Результат, "Telegram", "ИзменитьТемуФорума");

КонецПроцедуры

Процедура Telegram_ЗакрытьТемуФорума(ПараметрыФункции)

    Токен = ПараметрыФункции["Telegram_Token"];
    Чат   = ПараметрыФункции["Telegram_ForumID"];
    Тема  = ПараметрыФункции["Telegram_TopicID"];

    OPI_Telegram.ОткрытьТемуФорума(Токен, Чат); // SKIP

    Результат = OPI_Telegram.ЗакрытьТемуФорума(Токен, Чат); // Закрывает главную тему

    Обработать(Результат, "Telegram", "ЗакрытьТемуФорума", "Главная"); // SKIP

    Результат = OPI_Telegram.ЗакрытьТемуФорума(Токен, Чат, Тема);

    // END

    Обработать(Результат, "Telegram", "ЗакрытьТемуФорума");

КонецПроцедуры

Процедура Telegram_ОткрытьТемуФорума(ПараметрыФункции)

    Токен = ПараметрыФункции["Telegram_Token"];
    Чат   = ПараметрыФункции["Telegram_ForumID"];
    Тема  = ПараметрыФункции["Telegram_TopicID"];

    Результат = OPI_Telegram.ОткрытьТемуФорума(Токен, Чат); // Открывает главную тему

    Обработать(Результат, "Telegram", "ОткрытьТемуФорума", "Главная"); // SKIP

    Результат = OPI_Telegram.ОткрытьТемуФорума(Токен, Чат, Тема);

    // END

    Обработать(Результат, "Telegram", "ОткрытьТемуФорума");

КонецПроцедуры

Процедура Telegram_УдалитьТемуФорума(ПараметрыФункции)

    Токен = ПараметрыФункции["Telegram_Token"];
    Чат   = ПараметрыФункции["Telegram_ForumID"];
    Тема  = ПараметрыФункции["Telegram_TopicID"];

    Результат = OPI_Telegram.УдалитьТемуФорума(Токен, Чат, Тема);

    // END

    Обработать(Результат, "Telegram", "УдалитьТемуФорума");

КонецПроцедуры

Процедура Telegram_ОчиститьСписокЗакрепленныхСообщенийТемы(ПараметрыФункции)

    Токен = ПараметрыФункции["Telegram_Token"];
    Чат   = ПараметрыФункции["Telegram_ForumID"];
    Тема  = ПараметрыФункции["Telegram_TopicID"];

    Результат = OPI_Telegram.ОчиститьСписокЗакрепленныхСообщенийТемы(Токен, Чат);

    Обработать(Результат, "Telegram", "ОчиститьСписокЗакрепленныхСообщенийТемы", "Главная"); // SKIP

    // END

    Обработать(Результат, "Telegram", "ОчиститьСписокЗакрепленныхСообщенийТемы");

КонецПроцедуры

Процедура Telegram_СкрытьГлавнуюТемуФорума(ПараметрыФункции)

    Токен = ПараметрыФункции["Telegram_Token"];
    Чат   = ПараметрыФункции["Telegram_ForumID"];

    Результат = OPI_Telegram.СкрытьГлавнуюТемуФорума(Токен, Чат);

    // END

    Обработать(Результат, "Telegram", "СкрытьГлавнуюТемуФорума");

КонецПроцедуры

Процедура Telegram_ПоказатьГлавнуюТемуФорума(ПараметрыФункции)

    Токен = ПараметрыФункции["Telegram_Token"];
    Чат   = ПараметрыФункции["Telegram_ForumID"];

    Результат = OPI_Telegram.ПоказатьГлавнуюТемуФорума(Токен, Чат);

    // END

    Обработать(Результат, "Telegram", "ПоказатьГлавнуюТемуФорума");

КонецПроцедуры

Процедура Telegram_ИзменитьИмяГлавнойТемыФорума(ПараметрыФункции)

    Заголовок = "Новое имя главной темы " + Строка(Новый УникальныйИдентификатор);
    Токен     = ПараметрыФункции["Telegram_Token"];
    Чат       = ПараметрыФункции["Telegram_ForumID"];

    Результат = OPI_Telegram.ИзменитьИмяГлавнойТемыФорума(Токен, Чат, Заголовок);

    // END

    Обработать(Результат, "Telegram", "ИзменитьИмяГлавнойТемыФорума");

КонецПроцедуры

Процедура Telegram_УдалитьСообщение(ПараметрыФункции)

    Токен       = ПараметрыФункции["Telegram_Token"];
    IDЧата      = ПараметрыФункции["Telegram_ChannelID"];
    IDСообщения = ПараметрыФункции["Telegram_ChannelMessageID"];

    Результат = OPI_Telegram.УдалитьСообщение(Токен, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "Telegram", "УдалитьСообщение");

КонецПроцедуры

Процедура Telegram_ЗаменитьТекстСообщения(ПараметрыФункции)

    Токен       = ПараметрыФункции["Telegram_Token"];
    IDЧата      = ПараметрыФункции["Telegram_ChannelID"];
    IDСообщения = ПараметрыФункции["Telegram_ChannelMessageID"];
    Текст       = "Новый текст сообщения";

    Результат = OPI_Telegram.ЗаменитьТекстСообщения(Токен, IDЧата, IDСообщения, Текст);

    // END

    Обработать(Результат, "Telegram", "ЗаменитьТекстСообщения", , Текст);

    Результат = OPI_Telegram.ЗаменитьТекстСообщения(Токен, IDЧата, IDСообщения, "<b>Полужирный текст</b>", "HTML");

    Обработать(Результат, "Telegram", "ЗаменитьТекстСообщения", "Разметка", "Полужирный текст");

КонецПроцедуры

Процедура Telegram_ЗаменитьКлавиатуруСообщения(ПараметрыФункции)

    Токен       = ПараметрыФункции["Telegram_Token"];
    IDЧата      = ПараметрыФункции["Telegram_ChatID"];
    IDСообщения = ПараметрыФункции["Telegram_MessageID"];

    МассивКнопок = Новый Массив;
    МассивКнопок.Добавить("Новая кнопка 1");
    МассивКнопок.Добавить("Новая кнопка 2");
    МассивКнопок.Добавить("Новая кнопка 3");

    Клавиатура = OPI_Telegram.СформироватьКлавиатуруПоМассивуКнопок(МассивКнопок, Истина, Ложь);

    Результат = OPI_Telegram.ЗаменитьКлавиатуруСообщения(Токен, IDЧата, IDСообщения, Клавиатура);

    // END

    Обработать(Результат, "Telegram", "ЗаменитьКлавиатуруСообщения", , Клавиатура);

КонецПроцедуры

Процедура Telegram_ЗаменитьОписаниеСообщения(ПараметрыФункции)

    Токен       = ПараметрыФункции["Telegram_Token"];
    IDЧата      = ПараметрыФункции["Telegram_ChatID"];
    IDСообщения = ПараметрыФункции["Telegram_PicMessageID"];

    Описание  = "Новое описание картинки";
    Результат = OPI_Telegram.ЗаменитьОписаниеСообщения(Токен, IDЧата, IDСообщения, Описание);

    // END

    Обработать(Результат, "Telegram", "ЗаменитьОписаниеСообщения", , Описание);

КонецПроцедуры

#КонецОбласти

#Область VK

Процедура VK_СоздатьСсылкуПолученияТокена(ПараметрыФункции)

    Приложение = ПараметрыФункции["VK_AppID"];
    Результат  = OPI_VK.СоздатьСсылкуПолученияТокена(Приложение);

    // END

    Обработать(Результат, "VK", "СоздатьСсылкуПолученияТокена");

КонецПроцедуры

Процедура VK_ПолучитьПараметрыАвторизации(ПараметрыФункции)

    IDГруппы     = ПараметрыФункции["VK_GroupID"];
    IDПриложения = ПараметрыФункции["VK_AppID"];
    Токен        = ПараметрыФункции["VK_Token"];

    Результат = OPI_VK.ПолучитьПараметрыАвторизации(IDГруппы, IDПриложения, Токен);

    // END

    Обработать(Результат, "VK", "ПолучитьПараметрыАвторизации");

КонецПроцедуры

Процедура VK_СоздатьПост(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Текст     = "Пост из автотеста";
    URL       = "https://github.com/Bayselonarrend/OpenIntegrations";

    Картинка  = ПараметрыФункции["Picture"];  // URL, Путь или Двоичные данные
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Путь или Двоичные данные

    ИВФ = ПолучитьИмяВременногоФайла("png");
    КопироватьФайл(Картинка2, ИВФ);

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка);
    МассивКартинок.Добавить(ИВФ);

    Результат = OPI_VK.СоздатьПост(Текст, МассивКартинок, Истина, URL, Параметры);

    Обработать(Результат, "VK", "СоздатьПост", , Параметры); // SKIP

    ИДПоста = Результат["response"]["post_id"]; // SKIP
    OPI_VK.УдалитьПост(ИДПоста, Параметры);     // SKIP

    Результат = OPI_VK.СоздатьПост(Текст, Картинка, Ложь, , Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьПост", "Картинка", Параметры);

    ИДПоста = Результат["response"]["post_id"];
    OPI_VK.УдалитьПост(ИДПоста, Параметры);

    Результат = OPI_VK.СоздатьПост(Текст, ИВФ, Истина, URL, Параметры);

    Обработать(Результат, "VK", "СоздатьПост", "Путь", ПараметрыФункции);

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура VK_УдалитьПост(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    ИДПоста   = ПараметрыФункции["VK_PostID"];

    Результат = OPI_VK.УдалитьПост(ИДПоста, Параметры);

    // END

    Обработать(Результат, "VK", "УдалитьПост");

КонецПроцедуры

Процедура VK_СоздатьСоставнойПост(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Текст     = "Пост из автотеста";
    URL       = "https://github.com/Bayselonarrend/OpenIntegrations";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    Видео    = ПараметрыФункции["Video"];   // URL, Путь или Двоичные данные

    ИВФ = ПолучитьИмяВременногоФайла("png");
    КопироватьФайл(Картинка, ИВФ);

    ЗагрузкаКартинки = OPI_VK.ЗагрузитьФотоНаСервер(ИВФ, Параметры)["response"][0];
    ЗагрузкаВидео    = OPI_VK.ЗагрузитьВидеоНаСервер(Видео, "Новое видео", , , Параметры);

    ВладелецКартинки = OPI_Инструменты.ЧислоВСтроку(ЗагрузкаКартинки["owner_id"]);
    ВладелецВидео    = OPI_Инструменты.ЧислоВСтроку(ЗагрузкаВидео["owner_id"]);

    IDКартинки = OPI_Инструменты.ЧислоВСтроку(ЗагрузкаКартинки["id"]);
    IDВидео    = OPI_Инструменты.ЧислоВСтроку(ЗагрузкаВидео["video_id"]);

    МассивВложений = Новый Массив;
    МассивВложений.Добавить("photo" + ВладелецКартинки + "_" + IDКартинки);
    МассивВложений.Добавить("video" + ВладелецВидео + "_" + IDВидео);

    Результат = OPI_VK.СоздатьСоставнойПост(Текст, МассивВложений, Ложь, URL, Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьСоставнойПост");
    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура VK_СоздатьОпрос(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Вопрос    = "Какой ваш любимый цвет?";

    МассивВариантов = Новый Массив;
    МассивВариантов.Добавить("Красный");
    МассивВариантов.Добавить("Желтый");
    МассивВариантов.Добавить("Зеленый");

    Результат = OPI_VK.СоздатьОпрос(Вопрос, МассивВариантов, , "Текст поста", Параметры);

    Обработать(Результат, "VK", "СоздатьОпрос", "Текст"); // SKIP

    // С картинкой

    Картинка = ПараметрыФункции["Picture"];  // URL, Путь к файлу или Двоичные данные

    Результат = OPI_VK.СоздатьОпрос(Вопрос, МассивВариантов, Картинка, , Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьОпрос");

    ИДПоста = Результат["response"]["post_id"];
    OPI_VK.УдалитьПост(ИДПоста, Параметры);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура VK_СоздатьАльбом(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Имя       = "Альбом из автотеста";
    Описание  = "Новый альбом из автотеста";

    Результат = OPI_VK.СоздатьАльбом(Имя, Описание, Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьАльбом", , ПараметрыФункции, Описание);

КонецПроцедуры

Процедура VK_СохранитьКартинкуВАльбом(ПараметрыФункции)

    Параметры        = ПолучитьПараметрыВК();
    ОписаниеКартинки = "Картинка автотест";
    ИДАльбома        = ПараметрыФункции["VK_AlbumID"];

    Картинка = ПараметрыФункции["Picture"];       // URL, Путь к файлу или Двоичные данные

    Результат = OPI_VK.СохранитьКартинкуВАльбом(ИДАльбома, Картинка, ОписаниеКартинки, Параметры);

    // END

    Обработать(Результат, "VK", "СохранитьКартинкуВАльбом", , ПараметрыФункции, ОписаниеКартинки, ИДАльбома);

КонецПроцедуры

Процедура VK_УдалитьКартинку(ПараметрыФункции)

    Параметры  = ПолучитьПараметрыВК();
    ИДКартинки = ПараметрыФункции["VK_PictureID"];

    Результат = OPI_VK.УдалитьКартинку(ИДКартинки, Параметры);

    // END

    Обработать(Результат, "VK", "УдалитьКартинку");

КонецПроцедуры

Процедура VK_УдалитьАльбом(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    ИДАльбома = ПараметрыФункции["VK_AlbumID"];

    Результат = OPI_VK.УдалитьАльбом(ИДАльбома, Параметры);

    // END

    Обработать(Результат, "VK", "УдалитьАльбом");

КонецПроцедуры

Процедура VK_СоздатьИсторию(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    URL       = "https://github.com/Bayselonarrend/OpenIntegrations";

    Картинка = ПараметрыФункции["Picture"];       // URL, Путь к файлу или Двоичные данные
    ИВФ      = ПолучитьИмяВременногоФайла("png");
    КопироватьФайл(Картинка, ИВФ);
    Картинка = Новый ДвоичныеДанные(ИВФ);

    Результат = OPI_VK.СоздатьИсторию(Картинка, URL, Параметры);

    Обработать(Результат, "VK", "СоздатьИсторию"); // SKIP

    // END

    Результат = OPI_VK.СоздатьИсторию(ИВФ, , Параметры);

    Обработать(Результат, "VK", "СоздатьИсторию", "Путь");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура VK_СоздатьОбсуждение(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Название  = "Обсуждаем: какой цвет лучше?";
    Сообщение = "Красный, желтый, синий или какой-то другой?";

    Результат = OPI_VK.СоздатьОбсуждение(Название, Сообщение, Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьОбсуждение", , ПараметрыФункции);

КонецПроцедуры

Процедура VK_ЗакрытьОбсуждение(ПараметрыФункции)

    Параметры    = ПолучитьПараметрыВК();
    ИДОбсуждения = ПараметрыФункции["VK_ConvID"];
    Результат    = OPI_VK.ЗакрытьОбсуждение(ИДОбсуждения, Ложь, Параметры);

    // END

    Обработать(Результат, "VK", "ЗакрытьОбсуждение");

КонецПроцедуры

Процедура VK_ОткрытьОбсуждение(ПараметрыФункции)

    Параметры    = ПолучитьПараметрыВК();
    ИДОбсуждения = ПараметрыФункции["VK_ConvID"];
    Результат    = OPI_VK.ОткрытьОбсуждение(ИДОбсуждения, Параметры);

    // END

    Обработать(Результат, "VK", "ОткрытьОбсуждение");

КонецПроцедуры

Процедура VK_НаписатьВОбсуждение(ПараметрыФункции)

    Параметры    = ПолучитьПараметрыВК();
    ИДОбсуждения = ПараметрыФункции["VK_ConvID"];
    Сообщение    = "Мне больше нравится желтый";

    Результат = OPI_VK.НаписатьВОбсуждение(ИДОбсуждения, Сообщение, Параметры);

    // END

    Обработать(Результат, "VK", "НаписатьВОбсуждение");

КонецПроцедуры

Процедура VK_ПоставитьЛайк(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    IDПоста   = ПараметрыФункции["VK_PostID"];

    Результат = OPI_VK.ПоставитьЛайк(IDПоста, , Параметры);

    // END

    Обработать(Результат, "VK", "ПоставитьЛайк");

КонецПроцедуры

Процедура VK_СделатьРепост(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    IDПоста   = 2571;
    IDСтены   = -218704372;

    Результат = OPI_VK.СделатьРепост(IDПоста, IDСтены, , , Параметры);

    // END

    Обработать(Результат, "VK", "СделатьРепост", , ПараметрыФункции);

КонецПроцедуры

Процедура VK_НаписатьКомментарий(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Текст     = "Новый комментарий";
    IDПоста   = ПараметрыФункции["VK_PostID"];
    IDСтены   = Параметры["owner_id"];

    Результат = OPI_VK.НаписатьКомментарий(IDПоста, IDСтены, Текст, Параметры);

    // END

    Обработать(Результат, "VK", "НаписатьКомментарий");

КонецПроцедуры

Процедура VK_ПолучитьСтатистику(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    ТекущаяДата   = OPI_Инструменты.ПолучитьТекущуюДату();
    ДатаНачала    = НачалоДня(ТекущаяДата);
    ДатаОкончания = КонецДня(ДатаНачала);

    Результат = OPI_VK.ПолучитьСтатистику(ДатаНачала, ДатаОкончания, Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьСтатистику");

КонецПроцедуры

Процедура VK_ПолучитьСтатистикуПостов(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    МассивПостов = Новый Массив;
    МассивПостов.Добавить(214);
    МассивПостов.Добавить(215);

    Результат = OPI_VK.ПолучитьСтатистикуПостов(МассивПостов, Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьСтатистикуПостов");

КонецПроцедуры

Процедура VK_СоздатьРекламнуюКампанию(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    IDКабинета   = ПараметрыФункции["VK_AdsCabinetID"];
    Наименование = "Новая кампания";

    Результат = OPI_VK.СоздатьРекламнуюКампанию(IDКабинета, Наименование, Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьРекламнуюКампанию", , ПараметрыФункции);

КонецПроцедуры

Процедура VK_СоздатьРекламноеОбъявление(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    НомерКампании  = ПараметрыФункции["VK_AdsCampaignID"];
    ДневнойЛимит   = 150;
    НомерКатегории = 126;
    IDПоста        = ПараметрыФункции["VK_PostID"];
    IDКабинета     = ПараметрыФункции["VK_AdsCabinetID"];

    Результат = OPI_VK.СоздатьРекламноеОбъявление(НомерКампании
        , ДневнойЛимит
        , НомерКатегории
        , IDПоста
        , IDКабинета
        , Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьРекламноеОбъявление", , ПараметрыФункции);

КонецПроцедуры

Процедура VK_ПриостановитьРекламноеОбъявление(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    IDКабинета   = ПараметрыФункции["VK_AdsCabinetID"];
    IDОбъявления = ПараметрыФункции["VK_AdsPostID"];

    Результат = OPI_VK.ПриостановитьРекламноеОбъявление(IDКабинета, IDОбъявления, Параметры);

    // END

    Обработать(Результат, "VK", "ПриостановитьРекламноеОбъявление");

КонецПроцедуры

Процедура VK_СформироватьКлавиатуру(ПараметрыФункции)

    МассивКнопок = Новый Массив;
    МассивКнопок.Добавить("Button 1");
    МассивКнопок.Добавить("Button 2");

    Результат = OPI_VK.СформироватьКлавиатуру(МассивКнопок);

    // END

    Обработать(Результат, "VK", "СформироватьКлавиатуру");

КонецПроцедуры

Процедура VK_НаписатьСообщение(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Текст          = "Сообщение из автотеста";
    IDПользователя = ПараметрыФункции["VK_UserID"];
    Communitytoken = ПараметрыФункции["VK_CommunityToken"];

    МассивКнопок = Новый Массив;
    МассивКнопок.Добавить("Button 1");
    МассивКнопок.Добавить("Button 2");

    Клавиатура = OPI_VK.СформироватьКлавиатуру(МассивКнопок);
    Результат  = OPI_VK.НаписатьСообщение(Текст, IDПользователя, Communitytoken, Клавиатура, Параметры);

    // END

    Обработать(Результат, "VK", "НаписатьСообщение");

КонецПроцедуры

Процедура VK_ПолучитьСписокКатегорийТоваров(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Результат = OPI_VK.ПолучитьСписокКатегорийТоваров(Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьСписокКатегорийТоваров");

КонецПроцедуры

Процедура VK_СоздатьПодборкуТоваров(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Название = "Тестовая подборка";
    Картинка = ПараметрыФункции["Picture"];
    Основная = Истина;
    Скрытая  = Ложь;

    Результат = OPI_VK.СоздатьПодборкуТоваров(Название, Картинка, Основная, Скрытая, Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьПодборкуТоваров", , ПараметрыФункции);

КонецПроцедуры

Процедура VK_ИзменитьПодборкуТоваров(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Название = "Измененная подборка";
    Подборка = ПараметрыФункции["VK_MarketAlbumID"];

    Результат = OPI_VK.ИзменитьПодборкуТоваров(Название, Подборка, , , , Параметры);

    // END

    Обработать(Результат, "VK", "ИзменитьПодборкуТоваров");

КонецПроцедуры

Процедура VK_ПолучитьПодборкиПоИД(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Подборка  = ПараметрыФункции["VK_MarketAlbumID"];

    Результат = OPI_VK.ПолучитьПодборкиПоИД(Подборка, Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьПодборкиПоИД");

КонецПроцедуры

Процедура VK_ДобавитьТовар(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Картинка1 = ПараметрыФункции["Picture"];  // URL, Двоичные или Путь к файлу
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Двоичные или Путь к файлу
    Подборка  = ПараметрыФункции["VK_MarketAlbumID"];

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка1);
    МассивКартинок.Добавить(Картинка2);

    ОписаниеТовара = Новый Соответствие;
    ОписаниеТовара.Вставить("Имя"               , "Тестовый товар");
    ОписаниеТовара.Вставить("Описание"          , "Описание товара");
    ОписаниеТовара.Вставить("Категория"         , "20173");
    ОписаниеТовара.Вставить("Цена"              , 1);
    ОписаниеТовара.Вставить("СтараяЦена"        , 15);
    ОписаниеТовара.Вставить("ОсновноеФото"      , Картинка1);
    ОписаниеТовара.Вставить("URL"               , "https://github.com/Bayselonarrend/OpenIntegrations");
    ОписаниеТовара.Вставить("ДополнительныеФото", МассивКартинок);
    ОписаниеТовара.Вставить("ГлавныйВГруппе"    , Истина);
    ОписаниеТовара.Вставить("Ширина"            , 20);
    ОписаниеТовара.Вставить("Высота"            , 30);
    ОписаниеТовара.Вставить("Глубина"           , 40);
    ОписаниеТовара.Вставить("Вес"               , 100);
    ОписаниеТовара.Вставить("SKU"               , "12345");
    ОписаниеТовара.Вставить("ДоступныйОстаток"  , "10");

    Результат = OPI_VK.ДобавитьТовар(ОписаниеТовара, Подборка, Параметры);

    // END

    Обработать(Результат, "VK", "ДобавитьТовар", , ПараметрыФункции);

КонецПроцедуры

Процедура VK_ИзменитьТовар(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Товар = ПараметрыФункции["VK_MarketItemID"];

    ОписаниеТовара = Новый Соответствие;
    ОписаниеТовара.Вставить("Имя", "Тестовый товар измененный");

    Результат = OPI_VK.ИзменитьТовар(Товар, ОписаниеТовара, , Параметры);

    // END

    Обработать(Результат, "VK", "ИзменитьТовар");

КонецПроцедуры

Процедура VK_ДобавитьТоварВПодборку(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Товар    = ПараметрыФункции["VK_MarketItemID"];
    Подборка = ПараметрыФункции["VK_MarketAlbumID"];

    Результат = OPI_VK.ДобавитьТоварВПодборку(Товар, Подборка, Параметры);

    // END

    Обработать(Результат, "VK", "ДобавитьТоварВПодборку");

КонецПроцедуры

Процедура VK_УдалитьТоварИзПодборки(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Товар    = ПараметрыФункции["VK_MarketItemID"];
    Подборка = ПараметрыФункции["VK_MarketAlbumID"];

    Результат = OPI_VK.УдалитьТоварИзПодборки(Товар, Подборка, Параметры);

    // END

    Обработать(Результат, "VK", "УдалитьТоварИзПодборки");

КонецПроцедуры

Процедура VK_УдалитьТовар(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Товар = ПараметрыФункции["VK_MarketItemID"];

    Результат = OPI_VK.УдалитьТовар(Товар, Параметры);

    // END

    Обработать(Результат, "VK", "УдалитьТовар");

КонецПроцедуры

Процедура VK_УдалитьПодборку(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Подборка = ПараметрыФункции["VK_MarketAlbumID"];

    Результат = OPI_VK.УдалитьПодборку(Подборка, Параметры);

    // END

    Обработать(Результат, "VK", "УдалитьПодборку");

КонецПроцедуры

Процедура VK_СоздатьСвойствоТовара(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Название = "Цвет";

    Результат = OPI_VK.СоздатьСвойствоТовара(Название, Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьСвойствоТовара", , ПараметрыФункции);

КонецПроцедуры

Процедура VK_ИзменитьСвойствоТовара(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Название = "Цвет (изм.)";
    Свойство = ПараметрыФункции["VK_PropID"];

    Результат = OPI_VK.ИзменитьСвойствоТовара(Название, Свойство, Параметры);

    // END

    Обработать(Результат, "VK", "ИзменитьСвойствоТовара");

КонецПроцедуры

Процедура VK_ДобавитьВариантСвойстваТовара(ПараметрыФункции)

    Счетчик   = 1; // SKIP
    Параметры = ПолучитьПараметрыВК();

    Свойство        = ПараметрыФункции["VK_PropID"];
    МассивВариантов = Новый Массив;
    МассивВариантов.Добавить("Желтый");
    МассивВариантов.Добавить("Синий");
    МассивВариантов.Добавить("Красный");

    Для Каждого Значение Из МассивВариантов Цикл

        Результат = OPI_VK.ДобавитьВариантСвойстваТовара(Значение, Свойство, Параметры);

        Обработать(Результат, "VK", "ДобавитьВариантСвойстваТовара", , ПараметрыФункции, Счетчик);  // SKIP

        Счетчик = Счетчик + 1; // SKIP

    КонецЦикла;

    // END

КонецПроцедуры

Процедура VK_ИзменитьВариантСвойстваТовара(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Свойство = ПараметрыФункции["VK_PropID"];
    Вариант  = ПараметрыФункции["VK_PropVarID1"];
    Значение = "Новое имя варианта";

    Результат = OPI_VK.ИзменитьВариантСвойстваТовара(Значение, Свойство, Вариант, Параметры);

    // END

    Обработать(Результат, "VK", "ИзменитьВариантСвойстваТовара");

КонецПроцедуры

Процедура VK_СоздатьТоварСоСвойством(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Картинка1        = ПараметрыФункции["Picture"];
    Картинка2        = ПараметрыФункции["Picture2"];
    ВариантСвойства1 = ПараметрыФункции["VK_PropVarID1"];
    ВариантСвойства2 = ПараметрыФункции["VK_PropVarID2"];

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка1);
    МассивКартинок.Добавить(Картинка2);

    Товар = Новый Соответствие;
    Товар.Вставить("Имя"               , "Тестовый товар (со свойством)");
    Товар.Вставить("Описание"          , "Описание товара");
    Товар.Вставить("Категория"         , "20173");
    Товар.Вставить("Цена"              , 1);
    Товар.Вставить("СтараяЦена"        , 15);
    Товар.Вставить("ОсновноеФото"      , Картинка1);
    Товар.Вставить("URL"               , "https://github.com/Bayselonarrend/OpenIntegrations");
    Товар.Вставить("ДополнительныеФото", МассивКартинок);
    Товар.Вставить("ГлавныйВГруппе"    , Истина);
    Товар.Вставить("Ширина"            , 20);
    Товар.Вставить("Высота"            , 30);
    Товар.Вставить("Глубина"           , 40);
    Товар.Вставить("Вес"               , 100);
    Товар.Вставить("SKU"               , 12345);
    Товар.Вставить("ДоступныйОстаток"  , "10");
    Товар.Вставить("ЗначенияСвойств"   , ВариантСвойства1);

    Результат = OPI_VK.ДобавитьТовар(Товар, , Параметры);

    // END

    Обработать(Результат, "VK", "СоздатьТоварСоСвойством", "Первый", ПараметрыФункции, 2);

    Товар.Вставить("Имя"            , "Тестовый товар (другой)");
    Товар.Вставить("ЗначенияСвойств", ВариантСвойства2);

    Результат = OPI_VK.ДобавитьТовар(Товар, , Параметры);

    Обработать(Результат, "VK", "СоздатьТоварСоСвойством", "Второй", ПараметрыФункции, 3);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура VK_ПолучитьТоварыПоИД(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Товар1 = ПараметрыФункции["VK_MarketItemID2"];
    Товар2 = ПараметрыФункции["VK_MarketItemID3"];

    МассивТоваров = Новый Массив;
    МассивТоваров.Добавить(Товар1);
    МассивТоваров.Добавить(Товар2);

    Результат = OPI_VK.ПолучитьТоварыПоИД(МассивТоваров, Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьТоварыПоИД");

КонецПроцедуры

Процедура VK_СгруппироватьТовары(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Товар1 = ПараметрыФункции["VK_MarketItemID2"];
    Товар2 = ПараметрыФункции["VK_MarketItemID3"];

    МассивТоваров = Новый Массив;
    МассивТоваров.Добавить(Товар1);
    МассивТоваров.Добавить(Товар2);

    Результат = OPI_VK.СгруппироватьТовары(МассивТоваров, , Параметры);

    // END

    Обработать(Результат, "VK", "СгруппироватьТовары");

КонецПроцедуры

Процедура VK_УдалитьВариантСвойстваТовара(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Вариант = ПараметрыФункции["VK_PropVarID1"];

    Результат = OPI_VK.УдалитьВариантСвойстваТовара(Вариант, Параметры);

    // END

    Обработать(Результат, "VK", "УдалитьВариантСвойстваТовара");

КонецПроцедуры

Процедура VK_УдалитьСвойствоТовара(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Свойство = ПараметрыФункции["VK_PropID"];

    Результат = OPI_VK.УдалитьСвойствоТовара(Свойство, Параметры);

    // END

    Обработать(Результат, "VK", "УдалитьСвойствоТовара");

КонецПроцедуры

Процедура VK_ПолучитьСписокТоваров(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Результат = OPI_VK.ПолучитьСписокТоваров( , Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьСписокТоваров");

КонецПроцедуры

Процедура VK_ПолучитьСписокПодборок(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Результат = OPI_VK.ПолучитьСписокПодборок(Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьСписокПодборок");

КонецПроцедуры

Процедура VK_ПолучитьСписокСвойств(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Результат = OPI_VK.ПолучитьСписокСвойств(Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьСписокСвойств");

КонецПроцедуры

Процедура VK_ПолучитьСписокЗаказов(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();
    Результат = OPI_VK.ПолучитьСписокЗаказов(Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьСписокЗаказов");

КонецПроцедуры

Процедура VK_ЗагрузитьВидеоНаСервер(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Видео        = ПараметрыФункции["Video"]; // URL, Двоичные данные или Путь к файлу
    Наименование = "Новое видео";
    Описание     = "Описание видео";

    Результат = OPI_VK.ЗагрузитьВидеоНаСервер(Видео, Наименование, Описание, , Параметры);

    // END

    Обработать(Результат, "VK", "ЗагрузитьВидеоНаСервер");

КонецПроцедуры

Процедура VK_ЗагрузитьФотоНаСервер(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Картинка = ПараметрыФункции["Picture"]; // URL, Двоичные данные или Путь к файлу
    Вид      = "Пост";

    Результат = OPI_VK.ЗагрузитьФотоНаСервер(Картинка, Параметры, Вид);

    // END

    Обработать(Результат, "VK", "ЗагрузитьФотоНаСервер");

КонецПроцедуры

Процедура VK_СократитьСсылку(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Результат = OPI_VK.СократитьСсылку("https://github.com/Bayselonarrend/OpenIntegrations", Параметры);

    // END

    Обработать(Результат, "VK", "СократитьСсылку");

КонецПроцедуры

Процедура VK_ПолучитьСписокРекламныхКатегорий(ПараметрыФункции)

    Параметры = ПолучитьПараметрыВК();

    Результат = OPI_VK.ПолучитьСписокРекламныхКатегорий(Параметры);

    // END

    Обработать(Результат, "VK", "ПолучитьСписокРекламныхКатегорий");

КонецПроцедуры

Процедура VK_ПолучитьОписаниеТовара(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_VK.ПолучитьОписаниеТовара(Пустая);

    // END

    Обработать(Результат, "VK", "ПолучитьОписаниеТовара");

КонецПроцедуры

#КонецОбласти

#Область YandexDisk

Процедура YandexDisk_ПолучитьКодПодтверждения(ПараметрыФункции)

    ClientID = ПараметрыФункции["YandexDisk_ClientID"];

    Результат = OPI_YandexDisk.ПолучитьКодПодтверждения(ClientID);

    // END

    Обработать(Результат, "YandexDisk", "ПолучитьКодПодтверждения");

КонецПроцедуры

Процедура YandexDisk_ПреобразоватьКодВТокен(ПараметрыФункции)

    ClientID      = ПараметрыФункции["YandexDisk_ClientID"];
    ClientSecret  = ПараметрыФункции["YandexDisk_ClientSecret"];
    КодУстройства = "12345678";

    Результат = OPI_YandexDisk.ПреобразоватьКодВТокен(ClientID, ClientSecret, КодУстройства);

    // END

    Обработать(Результат, "YandexDisk", "ПреобразоватьКодВТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура YandexDisk_ОбновитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["YandexDisk_ClientID"];
    ClientSecret = ПараметрыФункции["YandexDisk_ClientSecret"];
    RefreshToken = ПараметрыФункции["YandexDisk_RefreshToken"];

    Результат = OPI_YandexDisk.ОбновитьТокен(ClientID, ClientSecret, RefreshToken);

    // END

    Обработать(Результат, "YandexDisk", "ОбновитьТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура YandexDisk_ПолучитьИнформациюОДиске(ПараметрыФункции)

    Токен     = ПараметрыФункции["YandexDisk_Token"];
    Результат = OPI_YandexDisk.ПолучитьИнформациюОДиске(Токен);

    // END

    Обработать(Результат, "YandexDisk", "ПолучитьИнформациюОДиске");

КонецПроцедуры

Процедура YandexDisk_СоздатьПапку(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = "/" + Строка(Новый УникальныйИдентификатор);

    Результат = OPI_YandexDisk.СоздатьПапку(Токен, Путь);

    // END

    Обработать(Результат, "YandexDisk", "СоздатьПапку", , Токен, Путь);

    OPI_YandexDisk.УдалитьОбъект(Токен, Путь, Ложь);

КонецПроцедуры

Процедура YandexDisk_ЗагрузитьФайлПоURL(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Адрес = ПараметрыФункции["Picture"];
    Путь  = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    Результат = OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, Путь, Адрес);

    // END

    Обработать(Результат, "YandexDisk", "ЗагрузитьФайлПоURL", , ПараметрыФункции, Путь);

КонецПроцедуры

Процедура YandexDisk_ПолучитьОбъект(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_FileByURLPath"];

    Результат = OPI_YandexDisk.ПолучитьОбъект(Токен, Путь);

    // END

    Обработать(Результат, "YandexDisk", "ПолучитьОбъект", , Путь);

КонецПроцедуры

Процедура YandexDisk_УдалитьОбъект(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_FileByURLPath"];

    Результат = OPI_YandexDisk.УдалитьОбъект(Токен, Путь, Ложь);

    // END

    Обработать(Результат, "YandexDisk", "УдалитьОбъект");

КонецПроцедуры

Процедура YandexDisk_ЗагрузитьФайл(ПараметрыФункции)

    Путь1 = "/" + Строка(Новый УникальныйИдентификатор) + ".png";
    Путь2 = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    Токен    = ПараметрыФункции["YandexDisk_Token"];
    Картинка = ПараметрыФункции["Picture"]; // URL

    ИВФ = ПолучитьИмяВременногоФайла("png"); // Путь
    КопироватьФайл(Картинка, ИВФ);

    Результат = OPI_YandexDisk.ЗагрузитьФайл(Токен, Путь1, Картинка, Истина);

    Обработать(Результат, "YandexDisk", "ЗагрузитьФайл", "URL"); // SKIP

    OPI_YandexDisk.УдалитьОбъект(Токен, Путь1, Ложь); // SKIP

    Результат = OPI_YandexDisk.ЗагрузитьФайл(Токен, Путь2, ИВФ, Истина);

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

    Обработать(Результат, "YandexDisk", "ЗагрузитьФайл");

    OPI_YandexDisk.УдалитьОбъект(Токен, Путь2, Ложь); // SKIP

КонецПроцедуры

Процедура YandexDisk_СоздатьКопиюОбъекта(ПараметрыФункции)

    Токен    = ПараметрыФункции["YandexDisk_Token"];
    Оригинал = ПараметрыФункции["YandexDisk_OriginalFilePath"];
    Путь     = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    Результат = OPI_YandexDisk.СоздатьКопиюОбъекта(Токен, Оригинал, Путь, Истина);

    // END

    Обработать(Результат, "YandexDisk", "СоздатьКопиюОбъекта", , ПараметрыФункции, Путь);

КонецПроцедуры

Процедура YandexDisk_ПолучитьСсылкуДляСкачивания(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_PathForLink"];

    Результат = OPI_YandexDisk.ПолучитьСсылкуДляСкачивания(Токен, Путь);

    // END

    Обработать(Результат, "YandexDisk", "ПолучитьСсылкуДляСкачивания");

КонецПроцедуры

Процедура YandexDisk_СкачатьФайл(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_PathForLink"];

    Результат = OPI_YandexDisk.СкачатьФайл(Токен, Путь);

    // END

    Обработать(Результат, "YandexDisk", "СкачатьФайл");

КонецПроцедуры

Процедура YandexDisk_ПолучитьСписокФайлов(ПараметрыФункции)

    Токен            = ПараметрыФункции["YandexDisk_Token"];
    Количество       = 2;
    СмещениеОтНачала = 1;
    ОтборПоТипу      = "image";

    Результат = OPI_YandexDisk.ПолучитьСписокФайлов(Токен, Количество, СмещениеОтНачала, ОтборПоТипу);

    // END

    Обработать(Результат, "YandexDisk", "ПолучитьСписокФайлов", , Количество, СмещениеОтНачала);

КонецПроцедуры

Процедура YandexDisk_ПереместитьОбъект(ПараметрыФункции)

    Токен    = ПараметрыФункции["YandexDisk_Token"];
    Оригинал = ПараметрыФункции["YandexDisk_OriginalFilePath"];
    Путь     = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    Результат = OPI_YandexDisk.ПереместитьОбъект(Токен, Оригинал, Путь, Истина);

    // END

    Обработать(Результат, "YandexDisk", "ПереместитьОбъект", , ПараметрыФункции, Путь);

КонецПроцедуры

Процедура YandexDisk_ПолучитьСписокОпубликованныхОбъектов(ПараметрыФункции)

    Токен            = ПараметрыФункции["YandexDisk_Token"];
    Количество       = 2;
    СмещениеОтНачала = 1;

    Результат = OPI_YandexDisk.ПолучитьСписокОпубликованныхОбъектов(Токен, Количество, СмещениеОтНачала);

    // END

    Обработать(Результат, "YandexDisk", "ПолучитьСписокОпубликованныхОбъектов", , Количество, СмещениеОтНачала);

КонецПроцедуры

Процедура YandexDisk_ОпубликоватьОбъект(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_OriginalFilePath"];

    Результат = OPI_YandexDisk.ОпубликоватьОбъект(Токен, Путь);

    // END

    Обработать(Результат, "YandexDisk", "ОпубликоватьОбъект", , ПараметрыФункции, Путь);

КонецПроцедуры

Процедура YandexDisk_ПолучитьСсылкуСкачиванияПубличногоОбъекта(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    URL   = ПараметрыФункции["YandexDisk_PublicURL"];

    Результат = OPI_YandexDisk.ПолучитьСсылкуСкачиванияПубличногоОбъекта(Токен, URL);

    // END

    Обработать(Результат, "YandexDisk", "ПолучитьСсылкуСкачиванияПубличногоОбъекта");

КонецПроцедуры

Процедура YandexDisk_ПолучитьПубличныйОбъект(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    URL   = ПараметрыФункции["YandexDisk_PublicURL"];

    Результат = OPI_YandexDisk.ПолучитьПубличныйОбъект(Токен, URL);

    // END

    Обработать(Результат, "YandexDisk", "ПолучитьПубличныйОбъект");

КонецПроцедуры

Процедура YandexDisk_СохранитьПубличныйОбъектНаДиск(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    URL   = ПараметрыФункции["YandexDisk_PublicURL"];

    Результат = OPI_YandexDisk.СохранитьПубличныйОбъектНаДиск(Токен, URL);

    // END

    Обработать(Результат, "YandexDisk", "СохранитьПубличныйОбъектНаДиск");

КонецПроцедуры

Процедура YandexDisk_ОтменитьПубликациюОбъекта(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_OriginalFilePath"];

    Результат = OPI_YandexDisk.ОтменитьПубликациюОбъекта(Токен, Путь);

    // END

    Обработать(Результат, "YandexDisk", "ОтменитьПубликациюОбъекта", , Путь);

КонецПроцедуры

Процедура YandexDisk_ЗагрузитьФайлЧастями(ПараметрыФункции)

    Путь = "/song.mp3";

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Файл  = ПараметрыФункции["Audio"]; // URL, Двоичные или Путь к файлу

    РазмерЧасти = 1048576; // 1 MB

    Результат = OPI_YandexDisk.ЗагрузитьФайлЧастями(Токен, Путь, Файл, РазмерЧасти, Истина);

    // END

    Обработать(Результат, "YandexDisk", "ЗагрузитьФайлЧастями", , Файл);

    Результат = OPI_YandexDisk.СкачатьФайл(Токен, Путь);

    Обработать(Результат, "YandexDisk", "ЗагрузитьФайлЧастями", "Скачивание", Файл);

    Результат = OPI_YandexDisk.УдалитьОбъект(Токен, Путь, Ложь);

    Обработать(Результат, "YandexDisk", "ЗагрузитьФайлЧастями", "Удаление");

КонецПроцедуры

#КонецОбласти

#Область Viber

Процедура Viber_УстановитьWebhook(ПараметрыФункции)

    Токен = ПараметрыФункции["Viber_ChannelToken"];
    URL   = "http://api.athenaeum.digital/hs/viber";

    Результат = OPI_Viber.УстановитьWebhook(Токен, URL);

    // END

    Обработать(Результат, "Viber", "УстановитьWebhook");

КонецПроцедуры

Процедура Viber_ПолучитьИнформациюОКанале(ПараметрыФункции)

    Токен     = ПараметрыФункции["Viber_ChannelToken"];
    Результат = OPI_Viber.ПолучитьИнформациюОКанале(Токен);

    // END

    Обработать(Результат, "Viber", "ПолучитьИнформациюОКанале");

КонецПроцедуры

Процедура Viber_ПолучитьДанныеПользователя(ПараметрыФункции)

    Токен          = ПараметрыФункции["Viber_ChannelToken"];
    IDПользователя = ПараметрыФункции["Viber_ChannelAdminID"];

    Результат = OPI_Viber.ПолучитьДанныеПользователя(Токен, IDПользователя);

    // END

    Обработать(Результат, "Viber", "ПолучитьДанныеПользователя");

КонецПроцедуры

Процедура Viber_ПолучитьОнлайнПользователей(ПараметрыФункции)

    Токен          = ПараметрыФункции["Viber_ChannelToken"];
    IDПользователя = ПараметрыФункции["Viber_ChannelAdminID"];

    Результат = OPI_Viber.ПолучитьОнлайнПользователей(Токен, IDПользователя);

    // END

    Обработать(Результат, "Viber", "ПолучитьОнлайнПользователей");

КонецПроцедуры

Процедура Viber_СформироватьКлавиатуруИзМассиваКнопок(ПараметрыФункции)

    МассивКнопок = Новый Массив;
    МассивКнопок.Добавить("Кнопка 1");
    МассивКнопок.Добавить("Кнопка 2");
    МассивКнопок.Добавить("Кнопка 3");

    Результат = OPI_Viber.СформироватьКлавиатуруИзМассиваКнопок(МассивКнопок);

    // END

    Обработать(Результат, "Viber", "СформироватьКлавиатуруИзМассиваКнопок");

КонецПроцедуры

Процедура Viber_ОтправитьТекстовоеСообщение(ПараметрыФункции)

    Текст = "Тестовое сообщение";

    IDПользователя = ПараметрыФункции["Viber_UserID"];
    Токен          = ПараметрыФункции["Viber_Token"];
    ОтправкаВКанал = Ложь;

    МассивКнопок = Новый Массив;
    МассивКнопок.Добавить("Кнопка 1");
    МассивКнопок.Добавить("Кнопка 2");
    МассивКнопок.Добавить("Кнопка 3");

    Клавиатура = OPI_Viber.СформироватьКлавиатуруИзМассиваКнопок(МассивКнопок);

    Результат = OPI_Viber.ОтправитьТекстовоеСообщение(Токен, Текст, IDПользователя, ОтправкаВКанал, Клавиатура);

    Обработать(Результат, "Viber", "ОтправитьТекстовоеСообщение"); // SKIP

    IDПользователя = ПараметрыФункции["Viber_ChannelAdminID"];
    Токен          = ПараметрыФункции["Viber_ChannelToken"];
    ОтправкаВКанал = Истина;

    Результат = OPI_Viber.ОтправитьТекстовоеСообщение(Токен, Текст, IDПользователя, ОтправкаВКанал, Клавиатура);

    // END

    Обработать(Результат, "Viber", "ОтправитьТекстовоеСообщение", "Канал");

КонецПроцедуры

Процедура Viber_ОтправитьКартинку(ПараметрыФункции)

    Описание = "Тестовое сообщение";
    URL      = ПараметрыФункции["Picture"];

    IDПользователя = ПараметрыФункции["Viber_UserID"];
    Токен          = ПараметрыФункции["Viber_Token"];
    ОтправкаВКанал = Ложь;

    Результат = OPI_Viber.ОтправитьКартинку(Токен, URL, IDПользователя, ОтправкаВКанал, Описание);

    Обработать(Результат, "Viber", "ОтправитьКартинку"); // SKIP

    IDПользователя = ПараметрыФункции["Viber_ChannelAdminID"];
    Токен          = ПараметрыФункции["Viber_ChannelToken"];
    ОтправкаВКанал = Истина;

    Результат = OPI_Viber.ОтправитьКартинку(Токен, URL, IDПользователя, ОтправкаВКанал, Описание);

    // END

    Обработать(Результат, "Viber", "ОтправитьКартинку", "Канал");

КонецПроцедуры

Процедура Viber_ОтправитьФайл(ПараметрыФункции)

    Расширение = "docx";
    URL        = ПараметрыФункции["Document"];

    IDПользователя = ПараметрыФункции["Viber_UserID"];
    Токен          = ПараметрыФункции["Viber_Token"];
    ОтправкаВКанал = Ложь;

    Результат = OPI_Viber.ОтправитьФайл(Токен, URL, IDПользователя, ОтправкаВКанал, Расширение);

    Обработать(Результат, "Viber", "ОтправитьФайл"); // SKIP

    IDПользователя = ПараметрыФункции["Viber_ChannelAdminID"];
    Токен          = ПараметрыФункции["Viber_ChannelToken"];
    ОтправкаВКанал = Истина;

    Результат = OPI_Viber.ОтправитьФайл(Токен, URL, IDПользователя, ОтправкаВКанал, Расширение);

    // END

    Обработать(Результат, "Viber", "ОтправитьФайл", "Канал");

КонецПроцедуры

Процедура Viber_ОтправитьКонтакт(ПараметрыФункции)

    Имя     = "Петр Петров";
    Телефон = "+123456789";

    IDПользователя = ПараметрыФункции["Viber_UserID"];
    Токен          = ПараметрыФункции["Viber_Token"];
    ОтправкаВКанал = Ложь;

    Результат = OPI_Viber.ОтправитьКонтакт(Токен, Имя, Телефон, IDПользователя, ОтправкаВКанал);

    Обработать(Результат, "Viber", "ОтправитьКонтакт"); // SKIP

    IDПользователя = ПараметрыФункции["Viber_ChannelAdminID"];
    Токен          = ПараметрыФункции["Viber_ChannelToken"];
    ОтправкаВКанал = Истина;

    Результат = OPI_Viber.ОтправитьКонтакт(Токен, Имя, Телефон, IDПользователя, ОтправкаВКанал);

    // END

    Обработать(Результат, "Viber", "ОтправитьКонтакт", "Канал");

КонецПроцедуры

Процедура Viber_ОтправитьЛокацию(ПараметрыФункции)

    Широта  = "48.87373649724122";
    Долгота = "2.2954639195323967";

    IDПользователя = ПараметрыФункции["Viber_UserID"];
    Токен          = ПараметрыФункции["Viber_Token"];
    ОтправкаВКанал = Ложь;

    Результат = OPI_Viber.ОтправитьЛокацию(Токен, Широта, Долгота, IDПользователя, ОтправкаВКанал);

    Обработать(Результат, "Viber", "ОтправитьЛокацию"); // SKIP

    IDПользователя = ПараметрыФункции["Viber_ChannelAdminID"];
    Токен          = ПараметрыФункции["Viber_ChannelToken"];
    ОтправкаВКанал = Истина;

    Результат = OPI_Viber.ОтправитьЛокацию(Токен, Широта, Долгота, IDПользователя, ОтправкаВКанал);

    // END

    Обработать(Результат, "Viber", "ОтправитьЛокацию", "Канал");

КонецПроцедуры

Процедура Viber_ОтправитьСсылку(ПараметрыФункции)

    URL = "https://github.com/Bayselonarrend/OpenIntegrations";

    IDПользователя = ПараметрыФункции["Viber_UserID"];
    Токен          = ПараметрыФункции["Viber_Token"];
    ОтправкаВКанал = Ложь;

    Результат = OPI_Viber.ОтправитьСсылку(Токен, URL, IDПользователя, ОтправкаВКанал);

    Обработать(Результат, "Viber", "ОтправитьСсылку"); // SKIP

    IDПользователя = ПараметрыФункции["Viber_ChannelAdminID"];
    Токен          = ПараметрыФункции["Viber_ChannelToken"];
    ОтправкаВКанал = Истина;

    Результат = OPI_Viber.ОтправитьСсылку(Токен, URL, IDПользователя, ОтправкаВКанал);

    // END

    Обработать(Результат, "Viber", "ОтправитьСсылку", "Канал");

КонецПроцедуры

#КонецОбласти

#Область GoogleWorkspace

Процедура GoogleWorkspace_СформироватьСсылкуПолученияКода(ПараметрыФункции)

    ClientID  = ПараметрыФункции["Google_ClientID"];
    Результат = OPI_GoogleWorkspace.СформироватьСсылкуПолученияКода(ClientID);

    // END

    Обработать(Результат, "GoogleWorkspace", "СформироватьСсылкуПолученияКода");

КонецПроцедуры

Процедура GoogleWorkspace_ПолучитьТокенПоКоду(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    Code         = ПараметрыФункции["Google_Code"];

    Результат = OPI_GoogleWorkspace.ПолучитьТокенПоКоду(ClientID, ClientSecret, Code);

    // END

    Обработать(Результат, "GoogleWorkspace", "ПолучитьТокенПоКоду");

КонецПроцедуры

Процедура GoogleWorkspace_ОбновитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    RefreshToken = ПараметрыФункции["Google_Refresh"];

    Результат = OPI_GoogleWorkspace.ОбновитьТокен(ClientID, ClientSecret, RefreshToken);

    // END

    Обработать(Результат, "GoogleWorkspace", "ОбновитьТокен");

КонецПроцедуры

Процедура GoogleWorkspace_ПолучитьТокенServiceАккаунта(ПараметрыФункции)

    Данные = ПараметрыФункции["Google_ServiceData"]; // URL, двоичные данные, файл или коллекция

    Токен  = ПараметрыФункции["Access_Token"];  // SKIP
    Данные = OPI_ЗапросыHTTP                    // SKIP
        .НовыйЗапрос()                          // SKIP
        .Инициализировать(Данные)               // SKIP
        .ДобавитьBearerАвторизацию(Токен)       // SKIP
        .ОбработатьЗапрос("GET")                // SKIP
        .ВернутьОтветКакДвоичныеДанные();       // SKIP

    ОбластиДействия = Новый Массив;
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/calendar");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/drive");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/spreadsheets");

    Результат = OPI_GoogleWorkspace.ПолучитьТокенServiceАккаунта(Данные, ОбластиДействия);

    // END

    Обработать(Результат, "GoogleWorkspace", "ПолучитьТокенServiceАккаунта");

КонецПроцедуры

#КонецОбласти

#Область GoogleCalendar

Процедура GoogleCalendar_СформироватьСсылкуПолученияКода(ПараметрыФункции)

    ClientID  = ПараметрыФункции["Google_ClientID"];
    Результат = OPI_GoogleCalendar.СформироватьСсылкуПолученияКода(ClientID);

    // END

    Обработать(Результат, "GoogleCalendar", "СформироватьСсылкуПолученияКода");

КонецПроцедуры

Процедура GoogleCalendar_ПолучитьТокенПоКоду(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    Code         = ПараметрыФункции["Google_Code"];

    Результат = OPI_GoogleCalendar.ПолучитьТокенПоКоду(ClientID, ClientSecret, Code);

    // END

    Обработать(Результат, "GoogleCalendar", "ПолучитьТокенПоКоду");

КонецПроцедуры

Процедура GoogleCalendar_ОбновитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    RefreshToken = ПараметрыФункции["Google_Refresh"];

    Результат = OPI_GoogleCalendar.ОбновитьТокен(ClientID, ClientSecret, RefreshToken);

    // END

    Обработать(Результат, "GoogleCalendar", "ОбновитьТокен");

КонецПроцедуры

Процедура GoogleCalendar_ПолучитьТокенServiceАккаунта(ПараметрыФункции)

    Данные = ПараметрыФункции["Google_ServiceData"]; // URL, двоичные данные, файл или коллекция

    Токен  = ПараметрыФункции["Access_Token"];  // SKIP
    Данные = OPI_ЗапросыHTTP                    // SKIP
        .НовыйЗапрос()                          // SKIP
        .Инициализировать(Данные)               // SKIP
        .ДобавитьBearerАвторизацию(Токен)       // SKIP
        .ОбработатьЗапрос("GET")                // SKIP
        .ВернутьОтветКакДвоичныеДанные();       // SKIP

    ОбластиДействия = Новый Массив;
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/calendar");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/drive");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/spreadsheets");

    Результат = OPI_GoogleCalendar.ПолучитьТокенServiceАккаунта(Данные, ОбластиДействия);

    // END

    Обработать(Результат, "GoogleCalendar", "ПолучитьТокенServiceАккаунта");

КонецПроцедуры

Процедура GoogleCalendar_ПолучитьСписокКалендарей(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Результат = OPI_GoogleCalendar.ПолучитьСписокКалендарей(Токен);

    // END

    Обработать(Результат, "GoogleCalendar", "ПолучитьСписокКалендарей");

КонецПроцедуры

Процедура GoogleCalendar_СоздатьКалендарь(ПараметрыФункции)

    Токен        = ПараметрыФункции["Google_Token"];
    Наименование = "Тестовый календарь";

    Результат = OPI_GoogleCalendar.СоздатьКалендарь(Токен, Наименование);

    // END

    Обработать(Результат, "GoogleCalendar", "СоздатьКалендарь", , ПараметрыФункции, Наименование);

КонецПроцедуры

Процедура GoogleCalendar_ИзменитьМетаданныеКалендаря(ПараметрыФункции)

    Токен        = ПараметрыФункции["Google_Token"];
    Календарь    = ПараметрыФункции["Google_NewCalendarID"];
    Наименование = "Новое наименование";
    Описание     = "Новое описание";

    Результат = OPI_GoogleCalendar.ИзменитьМетаданныеКалендаря(Токен, Календарь, Наименование, Описание);

    // END

    Обработать(Результат, "GoogleCalendar", "ИзменитьМетаданныеКалендаря", , Наименование, Описание);

КонецПроцедуры

Процедура GoogleCalendar_ПолучитьМетаданныеКалендаря(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];

    Результат = OPI_GoogleCalendar.ПолучитьМетаданныеКалендаря(Токен, Календарь);

    // END

    Наименование = "Новое наименование";
    Описание     = "Новое описание";

    Обработать(Результат, "GoogleCalendar", "ПолучитьМетаданныеКалендаря", , Наименование, Описание);

КонецПроцедуры

Процедура GoogleCalendar_ДобавитьКалендарьВСписок(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];

    Результат = OPI_GoogleCalendar.ДобавитьКалендарьВСписок(Токен, Календарь);

    // END

    Наименование = "Новое наименование";
    Описание     = "Новое описание";

    Обработать(Результат, "GoogleCalendar", "ДобавитьКалендарьВСписок", , Наименование, Описание);

КонецПроцедуры

Процедура GoogleCalendar_ИзменитьКалендарьСписка(ПараметрыФункции)

    Токен              = ПараметрыФункции["Google_Token"];
    Календарь          = ПараметрыФункции["Google_NewCalendarID"];
    ОсновнойЦвет       = "#000000";
    ДополнительныйЦвет = "#ffd800";
    Скрытый            = Ложь;

    Результат = OPI_GoogleCalendar.ИзменитьКалендарьСписка(Токен, Календарь, ОсновнойЦвет, ДополнительныйЦвет, Скрытый);

    // END

    Обработать(Результат, "GoogleCalendar", "ИзменитьКалендарьСписка", , ОсновнойЦвет, ДополнительныйЦвет);

КонецПроцедуры

Процедура GoogleCalendar_ПолучитьКалендарьСписка(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];

    Результат = OPI_GoogleCalendar.ПолучитьКалендарьСписка(Токен, Календарь);

    // END

    ОсновнойЦвет       = "#000000";
    ДополнительныйЦвет = "#ffd800";

    Обработать(Результат, "GoogleCalendar", "ПолучитьКалендарьСписка", , ОсновнойЦвет, ДополнительныйЦвет);

КонецПроцедуры

Процедура GoogleCalendar_ОчиститьОсновнойКалендарь(ПараметрыФункции)

    Токен = ПараметрыФункции["Google_Token"];

    Результат = OPI_GoogleCalendar.ОчиститьОсновнойКалендарь(Токен);

    // END

    Обработать(Результат, "GoogleCalendar", "ОчиститьОсновнойКалендарь");

КонецПроцедуры

Процедура GoogleCalendar_УдалитьКалендарьИзСписка(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];

    Результат = OPI_GoogleCalendar.УдалитьКалендарьИзСписка(Токен, Календарь);

    // END

    Обработать(Результат, "GoogleCalendar", "УдалитьКалендарьИзСписка");

КонецПроцедуры

Процедура GoogleCalendar_УдалитьКалендарь(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];

    Результат = OPI_GoogleCalendar.УдалитьКалендарь(Токен, Календарь);

    // END

    Обработать(Результат, "GoogleCalendar", "УдалитьКалендарь");

КонецПроцедуры

Процедура GoogleCalendar_СоздатьСобытие(ПараметрыФункции)

    ТекущаяДата  = OPI_Инструменты.ПолучитьТекущуюДату();
    Токен        = ПараметрыФункции["Google_Token"];
    Календарь    = ПараметрыФункции["Google_NewCalendarID"];
    Наименование = "Новое событие";
    Описание     = "Описание тестового события";
    Час          = 3600;

    Картинка1 = ПараметрыФункции["Picture"];  // URL, Двоичные или Путь к файлу
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Двоичные или Путь к файлу
    Вложения  = Новый Соответствие;

    Вложения.Вставить("Картинка1", Картинка1);
    Вложения.Вставить("Картинка2", Картинка2);

    ОписаниеСобытия = Новый Соответствие;
    ОписаниеСобытия.Вставить("Описание"               , Описание);
    ОписаниеСобытия.Вставить("Заголовок"              , Наименование);
    ОписаниеСобытия.Вставить("МестоПроведения"        , "В офисе");
    ОписаниеСобытия.Вставить("ДатаНачала"             , ТекущаяДата);
    ОписаниеСобытия.Вставить("ДатаОкончания"          , ОписаниеСобытия["ДатаНачала"] + Час);
    ОписаниеСобытия.Вставить("МассивURLФайловВложений", Вложения);
    ОписаниеСобытия.Вставить("ОтправлятьУведомления"  , Истина);

    Результат = OPI_GoogleCalendar.СоздатьСобытие(Токен, Календарь, ОписаниеСобытия);

    // END

    Обработать(Результат, "GoogleCalendar", "СоздатьСобытие", , ПараметрыФункции, Наименование, Описание);

КонецПроцедуры

Процедура GoogleCalendar_ИзменитьСобытие(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];
    Событие   = ПараметрыФункции["Google_EventID"];
    Описание  = "Новое описание события";

    ОписаниеСобытия = Новый Соответствие;
    ОписаниеСобытия.Вставить("Описание", Описание);

    Результат = OPI_GoogleCalendar.ИзменитьСобытие(Токен, Календарь, ОписаниеСобытия, Событие);

    // END

    Наименование = "Новое событие";

    Обработать(Результат, "GoogleCalendar", "ИзменитьСобытие", , Наименование, Описание);

КонецПроцедуры

Процедура GoogleCalendar_ПолучитьСобытие(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];
    Событие   = ПараметрыФункции["Google_EventID"];

    Результат = OPI_GoogleCalendar.ПолучитьСобытие(Токен, Календарь, Событие);

    // END

    Наименование = "Новое событие";
    Описание     = "Новое описание события";

    Обработать(Результат, "GoogleCalendar", "ПолучитьСобытие", , Наименование, Описание);

КонецПроцедуры

Процедура GoogleCalendar_ПереместитьСобытие(ПараметрыФункции)

    Токен   = ПараметрыФункции["Google_Token"];
    Событие = ПараметрыФункции["Google_EventID"];

    КалендарьИсточник = ПараметрыФункции["Google_NewCalendarID"];
    КалендарьПриемник = ПараметрыФункции["Google_CalendarID"];

    Результат = OPI_GoogleCalendar.ПереместитьСобытие(Токен, КалендарьИсточник, КалендарьПриемник, Событие);

    // END

    Наименование = "Новое событие";
    Описание     = "Новое описание события";

    Обработать(Результат, "GoogleCalendar", "ПереместитьСобытие", , Наименование, Описание);

    OPI_GoogleCalendar.ПереместитьСобытие(Токен, КалендарьПриемник, КалендарьИсточник, Событие);

КонецПроцедуры

Процедура GoogleCalendar_УдалитьСобытие(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];
    Событие   = ПараметрыФункции["Google_EventID"];

    Результат = OPI_GoogleCalendar.УдалитьСобытие(Токен, Календарь, Событие);

    // END

    Обработать(Результат, "GoogleCalendar", "УдалитьСобытие");

КонецПроцедуры

Процедура GoogleCalendar_ПолучитьСписокСобытий(ПараметрыФункции)

    Токен     = ПараметрыФункции["Google_Token"];
    Календарь = ПараметрыФункции["Google_NewCalendarID"];

    Результат = OPI_GoogleCalendar.ПолучитьСписокСобытий(Токен, Календарь);

    // END

    Обработать(Результат, "GoogleCalendar", "ПолучитьСписокСобытий");

КонецПроцедуры

Процедура GoogleCalendar_ПолучитьОписаниеСобытия(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_GoogleCalendar.ПолучитьОписаниеСобытия(Пустая);

    // END

    Обработать(Результат, "GoogleCalendar", "ПолучитьОписаниеСобытия");

КонецПроцедуры

#КонецОбласти

#Область GoogleDrive

Процедура GoogleDrive_СформироватьСсылкуПолученияКода(ПараметрыФункции)

    ClientID  = ПараметрыФункции["Google_ClientID"];
    Результат = OPI_GoogleDrive.СформироватьСсылкуПолученияКода(ClientID);

    // END

    Обработать(Результат, "GoogleDrive", "СформироватьСсылкуПолученияКода");

КонецПроцедуры

Процедура GoogleDrive_ПолучитьТокенПоКоду(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    Code         = ПараметрыФункции["Google_Code"];

    Результат = OPI_GoogleDrive.ПолучитьТокенПоКоду(ClientID, ClientSecret, Code);

    // END

    Обработать(Результат, "GoogleDrive", "ПолучитьТокенПоКоду");

КонецПроцедуры

Процедура GoogleDrive_ОбновитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    RefreshToken = ПараметрыФункции["Google_Refresh"];

    Результат = OPI_GoogleDrive.ОбновитьТокен(ClientID, ClientSecret, RefreshToken);

    // END

    Обработать(Результат, "GoogleDrive", "ОбновитьТокен");

КонецПроцедуры

Процедура GoogleDrive_ПолучитьТокенServiceАккаунта(ПараметрыФункции)

    Данные = ПараметрыФункции["Google_ServiceData"]; // URL, двоичные данные, файл или коллекция

    Токен  = ПараметрыФункции["Access_Token"];  // SKIP
    Данные = OPI_ЗапросыHTTP                    // SKIP
        .НовыйЗапрос()                          // SKIP
        .Инициализировать(Данные)               // SKIP
        .ДобавитьBearerАвторизацию(Токен)       // SKIP
        .ОбработатьЗапрос("GET")                // SKIP
        .ВернутьОтветКакДвоичныеДанные();       // SKIP

    ОбластиДействия = Новый Массив;
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/calendar");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/drive");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/spreadsheets");

    Результат = OPI_GoogleDrive.ПолучитьТокенServiceАккаунта(Данные, ОбластиДействия);

    // END

    Обработать(Результат, "GoogleDrive", "ПолучитьТокенServiceАккаунта");

КонецПроцедуры

Процедура GoogleDrive_ПолучитьСписокКаталогов(ПараметрыФункции)

    Имя   = "Тестовая папка";
    Токен = ПараметрыФункции["Google_Token"];

    Результат = OPI_GoogleDrive.ПолучитьСписокКаталогов(Токен, Имя, Истина);

    // END

    Обработать(Результат, "GoogleDrive", "ПолучитьСписокКаталогов", , ПараметрыФункции);

КонецПроцедуры

Процедура GoogleDrive_ПолучитьИнформациюОбОбъекте(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_Catalog"];

    Результат = OPI_GoogleDrive.ПолучитьИнформациюОбОбъекте(Токен, Идентификатор);

    // END

    Обработать(Результат, "GoogleDrive", "ПолучитьИнформациюОбОбъекте");

КонецПроцедуры

Процедура GoogleDrive_ЗагрузитьФайл(ПараметрыФункции)

    Токен    = ПараметрыФункции["Google_Token"];
    Каталог  = ПараметрыФункции["GD_Catalog"];
    Картинка = ПараметрыФункции["Picture"];      // URL, Двоичные данные или Путь к файлу

    Пустая   = Ложь;
    Описание = OPI_GoogleDrive.ПолучитьОписаниеФайла(Пустая);

    Описание.Вставить("Родитель", Каталог);

    Результат = OPI_GoogleDrive.ЗагрузитьФайл(Токен, Картинка, Описание);

    // END

    Обработать(Результат, "GoogleDrive", "ЗагрузитьФайл", , ПараметрыФункции, Описание);

    Если Не OPI_Инструменты.ЭтоOneScript() И ПараметрыФункции.Свойство("Big")  Тогда

        БольшойФайл = ПараметрыФункции["Big"];
        Описание.Вставить("Имя", "big.rar");

        Результат = OPI_GoogleDrive.ЗагрузитьФайл(Токен, БольшойФайл, Описание);

        Обработать(Результат, "GoogleDrive", "ЗагрузитьФайл", "Большой", ПараметрыФункции, Описание);

        Результат = OPI_GoogleDrive.СкачатьФайл(Токен, Результат["id"]);

        Обработать(Результат, "GoogleDrive", "ЗагрузитьФайл", "Проверка", ПараметрыФункции, Описание);

    КонецЕсли;

КонецПроцедуры

Процедура GoogleDrive_СкопироватьОбъект(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];
    НовоеИмя      = "Скопированный файл.jpeg";
    НовыйРодитель = "root";

    Результат = OPI_GoogleDrive.СкопироватьОбъект(Токен, Идентификатор, НовоеИмя, НовыйРодитель);

    // END

    Обработать(Результат, "GoogleDrive", "СкопироватьОбъект", , ПараметрыФункции, НовоеИмя);

КонецПроцедуры

Процедура GoogleDrive_СкачатьФайл(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];

    Результат = OPI_GoogleDrive.СкачатьФайл(Токен, Идентификатор);

    // END

    Обработать(Результат, "GoogleDrive", "СкачатьФайл", , ПараметрыФункции);

КонецПроцедуры

Процедура GoogleDrive_ОбновитьФайл(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    НовоеИмя      = "Обновленный файл.jpg";
    Идентификатор = ПараметрыФункции["GD_File"];
    Файл          = ПараметрыФункции["Picture2"]; // URL, Двоичные данные или Путь к файлу

    Результат = OPI_GoogleDrive.ОбновитьФайл(Токен, Идентификатор, Файл, НовоеИмя);

    // END

    Обработать(Результат, "GoogleDrive", "ОбновитьФайл", , НовоеИмя);

КонецПроцедуры

Процедура GoogleDrive_ПолучитьСписокФайлов(ПараметрыФункции)

    Токен       = ПараметрыФункции["Google_Token"];
    Каталог     = "root";
    ИмяСодержит = "data";

    Результат = OPI_GoogleDrive.ПолучитьСписокФайлов(Токен, ИмяСодержит, Каталог);

    // END

    Обработать(Результат, "GoogleDrive", "ПолучитьСписокФайлов");

КонецПроцедуры

Процедура GoogleDrive_УдалитьОбъект(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];

    Результат = OPI_GoogleDrive.УдалитьОбъект(Токен, Идентификатор);

    // END

    Обработать(Результат, "GoogleDrive", "УдалитьОбъект");

    Для Каждого Удаляемый Из ПараметрыФункции["МассивУдаляемых"] Цикл

        Результат = OPI_GoogleDrive.УдалитьОбъект(Токен, Удаляемый);

        Обработать(Результат, "GoogleDrive", "УдалитьОбъект", "Дополнительный");

        OPI_Инструменты.Пауза(2);

    КонецЦикла;

КонецПроцедуры

Процедура GoogleDrive_ПолучитьОписаниеФайла(ПараметрыФункции)

    Результат = OPI_GoogleDrive.ПолучитьОписаниеФайла();

    // END

    Обработать(Результат, "GoogleDrive", "ПолучитьОписаниеФайла");

КонецПроцедуры

Процедура GoogleDrive_СоздатьКомментарий(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];
    Комментарий   = "Текст комментария";

    Результат = OPI_GoogleDrive.СоздатьКомментарий(Токен, Идентификатор, Комментарий);

    // END

    Обработать(Результат, "GoogleDrive", "СоздатьКомментарий", , ПараметрыФункции, Комментарий);

КонецПроцедуры

Процедура GoogleDrive_ПолучитьКомментарий(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];
    ИДКомментария = ПараметрыФункции["GD_Comment"];

    Результат = OPI_GoogleDrive.ПолучитьКомментарий(Токен, Идентификатор, ИДКомментария);

    // END

    Обработать(Результат, "GoogleDrive", "ПолучитьКомментарий");

КонецПроцедуры

Процедура GoogleDrive_ПолучитьСписокКомментариев(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];

    Результат = OPI_GoogleDrive.ПолучитьСписокКомментариев(Токен, Идентификатор);

    // END

    Обработать(Результат, "GoogleDrive", "ПолучитьСписокКомментариев");

КонецПроцедуры

Процедура GoogleDrive_УдалитьКомментарий(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];
    ИДКомментария = ПараметрыФункции["GD_Comment"];

    Результат = OPI_GoogleDrive.УдалитьКомментарий(Токен, Идентификатор, ИДКомментария);

    // END

    Обработать(Результат, "GoogleDrive", "УдалитьКомментарий");

КонецПроцедуры

Процедура GoogleDrive_СоздатьПапку(ПараметрыФункции)

    Токен   = ПараметрыФункции["Google_Token"];
    Каталог = ПараметрыФункции["GD_Catalog"];
    Имя     = "Тестовая папка";

    Результат = OPI_GoogleDrive.СоздатьПапку(Токен, Имя, Каталог);

    // END

    Обработать(Результат, "GoogleDrive", "СоздатьПапку");

    ИДКаталога = Результат["id"];
    OPI_GoogleDrive.УдалитьОбъект(Токен, ИДКаталога);

    Результат = OPI_GoogleDrive.СоздатьПапку(Токен, Имя);

    Обработать(Результат, "GoogleDrive", "СоздатьПапку", "Корень");

    ИДКаталога = Результат["id"];
    OPI_GoogleDrive.УдалитьОбъект(Токен, ИДКаталога);

КонецПроцедуры

#КонецОбласти

#Область GoogleSheets

Процедура GoogleSheets_СформироватьСсылкуПолученияКода(ПараметрыФункции)

    ClientID  = ПараметрыФункции["Google_ClientID"];
    Результат = OPI_GoogleSheets.СформироватьСсылкуПолученияКода(ClientID);

    // END

    Обработать(Результат, "GoogleSheets", "СформироватьСсылкуПолученияКода");

КонецПроцедуры

Процедура GoogleSheets_ПолучитьТокенПоКоду(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    Code         = ПараметрыФункции["Google_Code"];

    Результат = OPI_GoogleSheets.ПолучитьТокенПоКоду(ClientID, ClientSecret, Code);

    // END

    Обработать(Результат, "GoogleSheets", "ПолучитьТокенПоКоду");

КонецПроцедуры

Процедура GoogleSheets_ОбновитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    RefreshToken = ПараметрыФункции["Google_Refresh"];

    Результат = OPI_GoogleSheets.ОбновитьТокен(ClientID, ClientSecret, RefreshToken);

    // END

    Обработать(Результат, "GoogleSheets", "ОбновитьТокен");

КонецПроцедуры

Процедура GoogleSheets_ПолучитьТокенServiceАккаунта(ПараметрыФункции)

    Данные = ПараметрыФункции["Google_ServiceData"]; // URL, двоичные данные, файл или коллекция

    Токен  = ПараметрыФункции["Access_Token"];  // SKIP
    Данные = OPI_ЗапросыHTTP                    // SKIP
        .НовыйЗапрос()                          // SKIP
        .Инициализировать(Данные)               // SKIP
        .ДобавитьBearerАвторизацию(Токен)       // SKIP
        .ОбработатьЗапрос("GET")                // SKIP
        .ВернутьОтветКакДвоичныеДанные();       // SKIP

    ОбластиДействия = Новый Массив;
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/calendar");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/drive");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/spreadsheets");

    Результат = OPI_GoogleSheets.ПолучитьТокенServiceАккаунта(Данные, ОбластиДействия);

    // END

    Обработать(Результат, "GoogleSheets", "ПолучитьТокенServiceАккаунта");

КонецПроцедуры

Процедура GoogleSheets_СоздатьКнигу(ПараметрыФункции)

    Токен        = ПараметрыФункции["Google_Token"];
    Наименование = "Тестовая таблица";

    МассивЛистов = Новый Массив;
    МассивЛистов.Добавить("Лист1");
    МассивЛистов.Добавить("Лист2");

    Результат = OPI_GoogleSheets.СоздатьКнигу(Токен, Наименование, МассивЛистов);

    // END

    Обработать(Результат, "GoogleSheets", "СоздатьКнигу", , ПараметрыФункции, Наименование, МассивЛистов);

    Наименование = "Тестовая таблица (доп.)";
    Результат    = OPI_GoogleSheets.СоздатьКнигу(Токен, Наименование, МассивЛистов);

    Обработать(Результат, "GoogleSheets", "СоздатьКнигу", "Дополнительно", ПараметрыФункции, Наименование);

КонецПроцедуры

Процедура GoogleSheets_ПолучитьКнигу(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GS_Spreadsheet"];

    Результат = OPI_GoogleSheets.ПолучитьКнигу(Токен, Идентификатор);

    // END

    Обработать(Результат, "GoogleSheets", "ПолучитьКнигу");

КонецПроцедуры

Процедура GoogleSheets_КопироватьЛист(ПараметрыФункции)

    Токен  = ПараметрыФункции["Google_Token"];
    Откуда = ПараметрыФункции["GS_Spreadsheet"];
    Куда   = ПараметрыФункции["GS_Spreadsheet2"];
    Лист   = ПараметрыФункции["GS_Sheet"];

    Результат = OPI_GoogleSheets.КопироватьЛист(Токен, Откуда, Куда, Лист);

    // END

    Обработать(Результат, "GoogleSheets", "КопироватьЛист");

КонецПроцедуры

Процедура GoogleSheets_ДобавитьЛист(ПараметрыФункции)

    Токен        = ПараметрыФункции["Google_Token"];
    Книга        = ПараметрыФункции["GS_Spreadsheet"];
    Наименование = "Тестовый лист";

    Результат = OPI_GoogleSheets.ДобавитьЛист(Токен, Книга, Наименование);

    // END

    Обработать(Результат, "GoogleSheets", "ДобавитьЛист");

КонецПроцедуры

Процедура GoogleSheets_УдалитьЛист(ПараметрыФункции)

    Токен = ПараметрыФункции["Google_Token"];
    Книга = ПараметрыФункции["GS_Spreadsheet"];
    Лист  = ПараметрыФункции["GS_Sheet"];

    Результат = OPI_GoogleSheets.УдалитьЛист(Токен, Книга, Лист);

    // END

    Обработать(Результат, "GoogleSheets", "УдалитьЛист", , Книга);

КонецПроцедуры

Процедура GoogleSheets_ИзменитьНаименованиеКниги(ПараметрыФункции)

    Токен        = ПараметрыФункции["Google_Token"];
    Книга        = ПараметрыФункции["GS_Spreadsheet"];
    Наименование = "Тестовая таблица (изм.)";

    Результат = OPI_GoogleSheets.ИзменитьНаименованиеКниги(Токен, Книга, Наименование);

    // END

    Обработать(Результат, "GoogleSheets", "ИзменитьНаименованиеКниги", , Книга);

КонецПроцедуры

Процедура GoogleSheets_ПолучитьТаблицу(ПараметрыФункции)

    Токен = ПараметрыФункции["Google_Token"];
    Книга = ПараметрыФункции["GS_Spreadsheet"];

    Результат = OPI_GoogleSheets.ПолучитьКнигу(Токен, Книга);

    // END

    Обработать(Результат, "GoogleSheets", "ПолучитьТаблицу");

КонецПроцедуры

Процедура GoogleSheets_УстановитьЗначенияЯчеек(ПараметрыФункции)

    Токен = ПараметрыФункции["Google_Token"];
    Книга = ПараметрыФункции["GS_Spreadsheet"];
    Лист  = "Лист2";

    СоответствиеЗначений = Новый Соответствие;
    СоответствиеЗначений.Вставить("A1", "Это A1");
    СоответствиеЗначений.Вставить("A2", "Это A2");
    СоответствиеЗначений.Вставить("B2", "Это B2");
    СоответствиеЗначений.Вставить("B3", "Это B3");
    СоответствиеЗначений.Вставить("A3", "Это A3");
    СоответствиеЗначений.Вставить("A4", "Это A4");
    СоответствиеЗначений.Вставить("B1", "Это B1");
    СоответствиеЗначений.Вставить("B4", "Это B4");

    Результат = OPI_GoogleSheets.УстановитьЗначенияЯчеек(Токен, Книга, СоответствиеЗначений, Лист);

    // END

    Обработать(Результат, "GoogleSheets", "УстановитьЗначенияЯчеек", , СоответствиеЗначений.Количество());

КонецПроцедуры

Процедура GoogleSheets_ПолучитьЗначенияЯчеек(ПараметрыФункции)

    Токен = ПараметрыФункции["Google_Token"];
    Книга = ПараметрыФункции["GS_Spreadsheet"];
    Лист  = "Лист2";

    МассивЯчеек = Новый Массив;
    МассивЯчеек.Добавить("B2");
    МассивЯчеек.Добавить("A3");
    МассивЯчеек.Добавить("B4");

    Результат = OPI_GoogleSheets.ПолучитьЗначенияЯчеек(Токен, Книга, МассивЯчеек, Лист);

    // END

    Обработать(Результат, "GoogleSheets", "ПолучитьЗначенияЯчеек", , МассивЯчеек.Количество());

    Результат = OPI_GoogleSheets.ПолучитьЗначенияЯчеек(Токен, Книга, , Лист);

    Обработать(Результат, "GoogleSheets", "ПолучитьЗначенияЯчеек", "Все", Книга);

КонецПроцедуры

Процедура GoogleSheets_ОчиститьЯчейки(ПараметрыФункции)

    Токен = ПараметрыФункции["Google_Token"];
    Книга = ПараметрыФункции["GS_Spreadsheet"];
    Лист  = "Лист2";

    МассивЯчеек = Новый Массив;
    МассивЯчеек.Добавить("B2");
    МассивЯчеек.Добавить("A3");
    МассивЯчеек.Добавить("B4");

    Результат = OPI_GoogleSheets.ОчиститьЯчейки(Токен, Книга, МассивЯчеек, Лист);

    // END

    Обработать(Результат, "GoogleSheets", "ОчиститьЯчейки", , МассивЯчеек.Количество());

КонецПроцедуры

#КонецОбласти

#Область Slack

Процедура Slack_ПолучитьИнформациюОБоте(ПараметрыФункции)

    Токен     = ПараметрыФункции["Slack_Token"];
    Результат = OPI_Slack.ПолучитьИнформациюОБоте(Токен);

    // END

    Обработать(Результат, "Slack", "ПолучитьИнформациюОБоте");

КонецПроцедуры

Процедура Slack_ПолучитьСписокПользователей(ПараметрыФункции)

    Токен     = ПараметрыФункции["Slack_Token"];
    Результат = OPI_Slack.ПолучитьСписокПользователей(Токен);

    // END

    Обработать(Результат, "Slack", "ПолучитьСписокПользователей");

КонецПроцедуры

Процедура Slack_ПолучитьСписокРабочихОбластей(ПараметрыФункции)

    Токен     = ПараметрыФункции["Slack_Token"];
    Результат = OPI_Slack.ПолучитьСписокРабочихОбластей(Токен);

    // END

    Обработать(Результат, "Slack", "ПолучитьСписокРабочихОбластей");

КонецПроцедуры

Процедура Slack_ОтправитьСообщение(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];

    // Текстовое

    Текст     = "Тестовое сообщение 1";
    Результат = OPI_Slack.ОтправитьСообщение(Токен, Канал, Текст);

    Обработать(Результат, "Slack", "ОтправитьСообщение", , ПараметрыФункции, Текст, Канал); // SKIP

    // С вложениями (в примере: блок с картинкой)

    Текст        = "Сообщение с картинкой";
    Картинка     = ПараметрыФункции["Picture"];
    МассивБлоков = Новый Массив;

    Блок = OPI_Slack.СформироватьБлокКартинку(Картинка, "Картинка");
    МассивБлоков.Добавить(Блок);

    Результат = OPI_Slack.ОтправитьСообщение(Токен, Канал, Текст, , МассивБлоков);

    Обработать(Результат, "Slack", "ОтправитьСообщение", "Картинка", ПараметрыФункции, Текст, Канал); // SKIP

    // Отложенное

    Текст = "Отложенное сообщение";
    Час   = 3600;
    Сутки = 24;

    ДатаОтправки = OPI_Инструменты.ПолучитьТекущуюДату() + (Сутки * Час);
    Результат    = OPI_Slack.ОтправитьСообщение(Токен, Канал, Текст, ДатаОтправки);

    // END

    Обработать(Результат, "Slack", "ОтправитьСообщение", "Отложенное", ПараметрыФункции, Текст, Канал);

    Токен   = ПараметрыФункции["Slack_Token"];
    Отметка = Результат["scheduled_message_id"];

    OPI_Slack.УдалитьСообщение(Токен, Канал, Отметка, Истина);

КонецПроцедуры

Процедура Slack_СформироватьБлокКартинку(ПараметрыФункции)

    Картинка = ПараметрыФункции["Picture"];

    Результат = OPI_Slack.СформироватьБлокКартинку(Картинка, "Картинка");

    // END

    Обработать(Результат, "Slack", "СформироватьБлокКартинку");

КонецПроцедуры

Процедура Slack_ИзменитьСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["Slack_Token"];
    Канал   = ПараметрыФункции["Slack_Channel"];
    Отметка = ПараметрыФункции["Slack_MessageTS"];

    Текст = "Тестовое сообщение 2";

    Результат = OPI_Slack.ИзменитьСообщение(Токен, Канал, Отметка, Текст);

    // END

    Обработать(Результат, "Slack", "ИзменитьСообщение", , Текст, Канал);

КонецПроцедуры

Процедура Slack_ПолучитьСписокОтветовНаСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["Slack_Token"];
    Канал   = ПараметрыФункции["Slack_Channel"];
    Отметка = ПараметрыФункции["Slack_MessageTS"];

    Результат = OPI_Slack.ПолучитьСписокОтветовНаСообщение(Токен, Канал, Отметка);

    // END

    Обработать(Результат, "Slack", "ПолучитьСписокОтветовНаСообщение");

КонецПроцедуры

Процедура Slack_ПолучитьСсылкуНаСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["Slack_Token"];
    Канал   = ПараметрыФункции["Slack_Channel"];
    Отметка = ПараметрыФункции["Slack_MessageTS"];

    Результат = OPI_Slack.ПолучитьСсылкуНаСообщение(Токен, Канал, Отметка);

    // END

    Обработать(Результат, "Slack", "ПолучитьСсылкуНаСообщение", , Канал);

КонецПроцедуры

Процедура Slack_УдалитьСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["Slack_Token"];
    Канал   = ПараметрыФункции["Slack_Channel"];
    Отметка = ПараметрыФункции["Slack_MessageTS"];

    Результат = OPI_Slack.УдалитьСообщение(Токен, Канал, Отметка);

    // END

    Обработать(Результат, "Slack", "УдалитьСообщение");

КонецПроцедуры

Процедура Slack_ОтправитьЭфемерноеСообщение(ПараметрыФункции)

    Токен        = ПараметрыФункции["Slack_Token"];
    Канал        = ПараметрыФункции["Slack_Channel"];
    Пользователь = ПараметрыФункции["Slack_User"];
    Картинка     = ПараметрыФункции["Picture"];
    Текст        = "Эфимерное сообщение";

    Блок      = OPI_Slack.СформироватьБлокКартинку(Картинка, "Картинка");
    Результат = OPI_Slack.ОтправитьЭфемерноеСообщение(Токен, Канал, Текст, Пользователь, Блок);

    // END

    Обработать(Результат, "Slack", "ОтправитьЭфемерноеСообщение");

КонецПроцедуры

Процедура Slack_ПолучитьСписокОтложенныхСообщений(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];

    Результат = OPI_Slack.ПолучитьСписокОтложенныхСообщений(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "ПолучитьСписокОтложенныхСообщений");

КонецПроцедуры

Процедура Slack_СоздатьКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Имя   = "testconv" + Строка(Новый УникальныйИдентификатор);

    Результат = OPI_Slack.СоздатьКанал(Токен, Имя);

    // END

    Обработать(Результат, "Slack", "СоздатьКанал", , ПараметрыФункции, Имя);

КонецПроцедуры

Процедура Slack_УстановитьТемуКанала(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];
    Тема  = "Тестовая тема";

    Результат = OPI_Slack.УстановитьТемуКанала(Токен, Канал, Тема);

    // END

    Обработать(Результат, "Slack", "УстановитьТемуКанала", , Тема);

КонецПроцедуры

Процедура Slack_УстановитьЦельКанала(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];
    Цель  = "Тестовая цель";

    Результат = OPI_Slack.УстановитьЦельКанала(Токен, Канал, Цель);

    // END

    Обработать(Результат, "Slack", "УстановитьЦельКанала");

КонецПроцедуры

Процедура Slack_ПолучитьКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Результат = OPI_Slack.ПолучитьКанал(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "ПолучитьКанал", , ПараметрыФункции["Slack_NewChannelName"]);

КонецПроцедуры

Процедура Slack_ПригласитьПользователейВКанал(ПараметрыФункции)

    Токен        = ПараметрыФункции["Slack_Token"];
    Канал        = ПараметрыФункции["Slack_NewChannel"];
    Пользователь = ПараметрыФункции["Slack_User"];

    Результат = OPI_Slack.ПригласитьПользователейВКанал(Токен, Канал, Пользователь);

    // END

    Обработать(Результат, "Slack", "ПригласитьПользователейВКанал", , ПараметрыФункции["Slack_NewChannelName"]);

КонецПроцедуры

Процедура Slack_ВыгнатьПользователяИзКанала(ПараметрыФункции)

    Токен        = ПараметрыФункции["Slack_Token"];
    Канал        = ПараметрыФункции["Slack_NewChannel"];
    Пользователь = ПараметрыФункции["Slack_User"];

    Результат = OPI_Slack.ВыгнатьПользователяИзКанала(Токен, Канал, Пользователь);

    // END

    Обработать(Результат, "Slack", "ВыгнатьПользователяИзКанала");

КонецПроцедуры

Процедура Slack_ПолучитьИсториюКанала(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Результат = OPI_Slack.ПолучитьИсториюКанала(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "ПолучитьИсториюКанала");

КонецПроцедуры

Процедура Slack_ПолучитьСписокПользователейКанала(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Результат = OPI_Slack.ПолучитьСписокПользователейКанала(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "ПолучитьСписокПользователейКанала");

КонецПроцедуры

Процедура Slack_ПокинутьКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Результат = OPI_Slack.ПокинутьКанал(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "ПокинутьКанал");

КонецПроцедуры

Процедура Slack_ВступитьВКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Результат = OPI_Slack.ВступитьВКанал(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "ВступитьВКанал", , ПараметрыФункции["Slack_NewChannelName"]);

КонецПроцедуры

Процедура Slack_ПереименоватьКанал(ПараметрыФункции)

    Токен    = ПараметрыФункции["Slack_Token"];
    Канал    = ПараметрыФункции["Slack_NewChannel"];
    Название = "testconv" + Строка(Новый УникальныйИдентификатор);

    Результат = OPI_Slack.ПереименоватьКанал(Токен, Канал, Название);

    // END

    Обработать(Результат, "Slack", "ПереименоватьКанал", , Название);

КонецПроцедуры

Процедура Slack_АрхивироватьКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Результат = OPI_Slack.АрхивироватьКанал(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "АрхивироватьКанал");

КонецПроцедуры

Процедура Slack_ПолучитьСписокКаналов(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];

    Результат = OPI_Slack.ПолучитьСписокКаналов(Токен);

    // END

    Обработать(Результат, "Slack", "ПолучитьСписокКаналов");

КонецПроцедуры

Процедура Slack_ОткрытьДиалог(ПараметрыФункции)

    Токен        = ПараметрыФункции["Slack_Token"];
    Пользователь = ПараметрыФункции["Slack_User"];

    Результат = OPI_Slack.ОткрытьДиалог(Токен, Пользователь);

    // END

    Обработать(Результат, "Slack", "ОткрытьДиалог", , ПараметрыФункции);

    Канал = Результат["channel"]["id"];

    Результат = OPI_Slack.ОтправитьСообщение(Токен, Канал, "Тест диалог");

    Обработать(Результат, "Slack", "ОткрытьДиалог", "Сообщение", ПараметрыФункции);

КонецПроцедуры

Процедура Slack_ЗакрытьДиалог(ПараметрыФункции)

    Токен  = ПараметрыФункции["Slack_Token"];
    Диалог = ПараметрыФункции["Slack_Dialog"];

    Результат = OPI_Slack.ЗакрытьДиалог(Токен, Диалог);

    // END

    Обработать(Результат, "Slack", "ЗакрытьДиалог");

КонецПроцедуры

Процедура Slack_ПолучитьСписокФайлов(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];

    Результат = OPI_Slack.ПолучитьСписокФайлов(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "ПолучитьСписокФайлов");

    Результат = OPI_Slack.ПолучитьСписокФайлов(Токен);

    Обработать(Результат, "Slack", "ПолучитьСписокФайлов", "Все");

КонецПроцедуры

Процедура Slack_ЗагрузитьФайл(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];
    Файл  = ПараметрыФункции["Document"]; // URL, Двоичные данные или Путь к файлу

    ИмяФайла  = "megadoc.docx";
    Заголовок = "Новый файл";

    Результат = OPI_Slack.ЗагрузитьФайл(Токен, Файл, ИмяФайла, Заголовок);

    Обработать(Результат, "Slack", "ЗагрузитьФайл", , ПараметрыФункции, ИмяФайла); // SKIP
    Обработать(Результат, "Slack", "СделатьФайлПубличным");                        // SKIP
    Обработать(Результат, "Slack", "СделатьФайлПриватным");                        // SKIP

    Результат = OPI_Slack.ЗагрузитьФайл(Токен, Файл, ИмяФайла, Заголовок, Канал);

    // END

    Обработать(Результат, "Slack", "ЗагрузитьФайл", "Канал", ПараметрыФункции, ИмяФайла);
    OPI_Slack.УдалитьФайл(ПараметрыФункции["Slack_Token"], Результат["files"][0]["id"]);

КонецПроцедуры

Процедура Slack_СделатьФайлПубличным(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_FileID"];

    Результат = OPI_Slack.СделатьФайлПубличным(Токен, ИдентификаторФайла);

    // END

    Обработать(Результат, "Slack", "СделатьФайлПубличным", "Без записи");

КонецПроцедуры

Процедура Slack_СделатьФайлПриватным(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_FileID"];

    Результат = OPI_Slack.СделатьФайлПриватным(Токен, ИдентификаторФайла);

    // END

    Обработать(Результат, "Slack", "СделатьФайлПриватным", "Без записи");

КонецПроцедуры

Процедура Slack_ПолучитьДанныеФайла(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_FileID"];

    Результат = OPI_Slack.ПолучитьДанныеФайла(Токен, ИдентификаторФайла);

    // END

    Обработать(Результат, "Slack", "ПолучитьДанныеФайла", , "megadoc.docx");

КонецПроцедуры

Процедура Slack_УдалитьФайл(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_FileID"];

    Результат = OPI_Slack.УдалитьФайл(Токен, ИдентификаторФайла);

    // END

    Обработать(Результат, "Slack", "УдалитьФайл");

КонецПроцедуры

Процедура Slack_ПолучитьСписокВнешнихФайлов(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];

    Результат = OPI_Slack.ПолучитьСписокВнешнихФайлов(Токен, Канал);

    // END

    Обработать(Результат, "Slack", "ПолучитьСписокВнешнихФайлов");

    Результат = OPI_Slack.ПолучитьСписокВнешнихФайлов(Токен);

    Обработать(Результат, "Slack", "ПолучитьСписокВнешнихФайлов", "Все");

КонецПроцедуры

Процедура Slack_ДобавитьВнешнийФайл(ПараметрыФункции)

    Токен     = ПараметрыФункции["Slack_Token"];
    Заголовок = "Новый файл";
    Файл      = ПараметрыФункции["Document"];

    Результат = OPI_Slack.ДобавитьВнешнийФайл(Токен, Файл, Заголовок);

    // END

    Обработать(Результат, "Slack", "ДобавитьВнешнийФайл", , ПараметрыФункции, Заголовок);

КонецПроцедуры

Процедура Slack_ПолучитьВнешнийФайл(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_ExtFileID"];

    Результат = OPI_Slack.ПолучитьВнешнийФайл(Токен, ИдентификаторФайла);

    // END

    Обработать(Результат, "Slack", "ПолучитьВнешнийФайл");

КонецПроцедуры

Процедура Slack_ОтправитьВнешнийФайл(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    Канал              = ПараметрыФункции["Slack_Channel"];
    ИдентификаторФайла = ПараметрыФункции["Slack_ExtFileID"];

    Результат = OPI_Slack.ОтправитьВнешнийФайл(Токен, ИдентификаторФайла, Канал);

    // END

    Обработать(Результат, "Slack", "ОтправитьВнешнийФайл");

КонецПроцедуры

Процедура Slack_УдалитьВнешнийФайл(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_ExtFileID"];

    Результат = OPI_Slack.УдалитьВнешнийФайл(Токен, ИдентификаторФайла);

    // END

    Обработать(Результат, "Slack", "УдалитьВнешнийФайл");

КонецПроцедуры

#КонецОбласти

#Область Airtable

Процедура Airtable_СоздатьБазу(ПараметрыФункции)

    Токен        = ПараметрыФункции["Airtable_Token"];
    Область      = ПараметрыФункции["Airtable_Workspace"];
    Наименование = "Тестовая база";

    МассивПолей = Новый Массив;
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеНомера("Номер"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеСтроковое("Строковое"));

    ИмяТаблицы = "Тестовая таблица";

    СоответствиеТаблиц = Новый Соответствие;
    СоответствиеТаблиц.Вставить(ИмяТаблицы, МассивПолей);

    Результат = OPI_Airtable.СоздатьБазу(Токен, Область, Наименование, СоответствиеТаблиц);

    // END

    Обработать(Результат, "Airtable", "СоздатьБазу", , ПараметрыФункции, ИмяТаблицы);

КонецПроцедуры

Процедура Airtable_ПолучитьТаблицыБазы(ПараметрыФункции)

    Токен = ПараметрыФункции["Airtable_Token"];
    База  = ПараметрыФункции["Airtable_Base"];

    Результат = OPI_Airtable.ПолучитьТаблицыБазы(Токен, База);

    // END

    Обработать(Результат, "Airtable", "ПолучитьТаблицыБазы");

КонецПроцедуры

Процедура Airtable_ПолучитьСписокБаз(ПараметрыФункции)

    Токен = ПараметрыФункции["Airtable_Token"];

    Результат = OPI_Airtable.ПолучитьСписокБаз(Токен);

    // END

    Обработать(Результат, "Airtable", "ПолучитьСписокБаз");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеНомера(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеНомера("Номер");

    // END

    Обработать(Результат, "Airtable", "ПолучитьПолеНомера");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеСтроковое(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеСтроковое("Строковое");

    // END

    Обработать(Результат, "Airtable", "ПолучитьПолеСтроковое");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеВложения(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеВложения("Вложение");

    // END

    Обработать(Результат, "Airtable", "ПолучитьПолеВложения");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеФлажка(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеФлажка("Флажок");

    // END

    Обработать(Результат, "Airtable", "ПолучитьПолеФлажка");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеДаты(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеДаты("Дата");

    // END

    Обработать(Результат, "Airtable", "ПолучитьПолеДаты");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеТелефона(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеТелефона("Телефон");

    // END

    Обработать(Результат, "Airtable", "ПолучитьПолеТелефона");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеПочты(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеПочты("Почта");

    // END

    Обработать(Результат, "Airtable", "ПолучитьПолеПочты");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеСсылки(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеСсылки("Ссылка");

    // END

    Обработать(Результат, "Airtable", "ПолучитьПолеСсылки");

КонецПроцедуры

Процедура Airtable_СоздатьТаблицу(ПараметрыФункции)

    Токен = ПараметрыФункции["Airtable_Token"];
    База  = ПараметрыФункции["Airtable_Base"];

    МассивПолей = Новый Массив;
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеНомера("Номер"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеСтроковое("Строковое"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеВложения("Вложение"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеФлажка("Флажок"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеДаты("Дата"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеТелефона("Телефон"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеПочты("Почта"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеСсылки("Ссылка"));

    Наименование = "Тестовая таблица 2";
    Описание     = "Новая таблица";

    Результат = OPI_Airtable.СоздатьТаблицу(Токен, База, Наименование, МассивПолей, Описание);

    // END

    Обработать(Результат, "Airtable", "СоздатьТаблицу", , ПараметрыФункции, Наименование, Описание);

КонецПроцедуры

Процедура Airtable_ИзменитьТаблицу(ПараметрыФункции)

    Токен        = ПараметрыФункции["Airtable_Token"];
    База         = ПараметрыФункции["Airtable_Base"];
    Таблица      = ПараметрыФункции["Airtable_Table"];
    Наименование = "Тестовая таблица 2 (изм.)";
    Описание     = "Новая таблица (изм.)";

    Результат = OPI_Airtable.ИзменитьТаблицу(Токен, База, Таблица, Наименование, Описание);

    // END

    Обработать(Результат, "Airtable", "ИзменитьТаблицу", , Наименование, Описание);

КонецПроцедуры

Процедура Airtable_СоздатьПоле(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Имя     = Строка(Новый УникальныйИдентификатор);

    Поле      = OPI_Airtable.ПолучитьПолеНомера(Имя);
    Результат = OPI_Airtable.СоздатьПоле(Токен, База, Таблица, Поле);

    // END

    Обработать(Результат, "Airtable", "СоздатьПоле", , ПараметрыФункции, Имя);

КонецПроцедуры

Процедура Airtable_ИзменитьПоле(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Поле    = ПараметрыФункции["Airtable_Field"];

    Имя      = Строка(Новый УникальныйИдентификатор) + "(изм.)";
    Описание = "Новое описание";

    Результат = OPI_Airtable.ИзменитьПоле(Токен, База, Таблица, Поле, Имя, Описание);

    // END

    Обработать(Результат, "Airtable", "ИзменитьПоле", , Имя, Описание);

КонецПроцедуры

Процедура Airtable_СоздатьЗаписи(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];

    Номер     = 10;
    Строковое = "Привет";

    ОписаниеСтроки1 = Новый Структура("Номер,Строковое", Номер, Строковое);
    ОписаниеСтроки2 = Новый Структура("Номер,Строковое", Номер, Строковое);

    МассивОписаний = Новый Массив;
    МассивОписаний.Добавить(ОписаниеСтроки1);
    МассивОписаний.Добавить(ОписаниеСтроки2);

    Результат = OPI_Airtable.СоздатьЗаписи(Токен, База, Таблица, МассивОписаний);

    // END

    Обработать(Результат, "Airtable", "СоздатьЗаписи", , ПараметрыФункции);

    МассивУдаляемых = Новый Массив;

    Для Каждого Запись Из Результат["records"] Цикл

        ТекущаяЗапись = Запись["id"];
        МассивУдаляемых.Добавить(ТекущаяЗапись);

    КонецЦикла;

    OPI_Airtable.УдалитьЗаписи(Токен, База, Таблица, МассивУдаляемых);

    // Одиночное

    Результат = OPI_Airtable.СоздатьЗаписи(Токен, База, Таблица, ОписаниеСтроки1);

    Обработать(Результат, "Airtable", "СоздатьЗаписи", "Одиночная", ПараметрыФункции, Номер, Строковое);

КонецПроцедуры

Процедура Airtable_ПолучитьЗапись(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Запись  = ПараметрыФункции["Airtable_Record"];

    Результат = OPI_Airtable.ПолучитьЗапись(Токен, База, Таблица, Запись);

    // END

    Обработать(Результат, "Airtable", "ПолучитьЗапись", , Запись);

КонецПроцедуры

Процедура Airtable_СоздатьКомментарий(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Запись  = ПараметрыФункции["Airtable_Record"];
    Текст   = "Тестовый комментарий";

    Результат = OPI_Airtable.СоздатьКомментарий(Токен, База, Таблица, Запись, Текст);

    // END

    Обработать(Результат, "Airtable", "СоздатьКомментарий", , ПараметрыФункции, Текст);

КонецПроцедуры

Процедура Airtable_ИзменитьКомментарий(ПараметрыФункции)

    Токен       = ПараметрыФункции["Airtable_Token"];
    База        = ПараметрыФункции["Airtable_Base"];
    Таблица     = ПараметрыФункции["Airtable_Table"];
    Запись      = ПараметрыФункции["Airtable_Record"];
    Комментарий = ПараметрыФункции["Airtable_Comment"];

    Текст     = "Тестовый комментарий (изм.)";
    Результат = OPI_Airtable.ИзменитьКомментарий(Токен, База, Таблица, Запись, Комментарий, Текст);

    // END

    Обработать(Результат, "Airtable", "ИзменитьКомментарий", , Текст);

КонецПроцедуры

Процедура Airtable_ПолучитьКомментарии(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Запись  = ПараметрыФункции["Airtable_Record"];

    Результат = OPI_Airtable.ПолучитьКомментарии(Токен, База, Таблица, Запись);

    // END

    Обработать(Результат, "Airtable", "ПолучитьКомментарии");

КонецПроцедуры

Процедура Airtable_УдалитьКомментарий(ПараметрыФункции)

    Токен       = ПараметрыФункции["Airtable_Token"];
    База        = ПараметрыФункции["Airtable_Base"];
    Таблица     = ПараметрыФункции["Airtable_Table"];
    Запись      = ПараметрыФункции["Airtable_Record"];
    Комментарий = ПараметрыФункции["Airtable_Comment"];

    Результат = OPI_Airtable.УдалитьКомментарий(Токен, База, Таблица, Запись, Комментарий);

    // END

    Обработать(Результат, "Airtable", "УдалитьКомментарий", , Комментарий);

КонецПроцедуры

Процедура Airtable_ПолучитьСписокЗаписей(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];

    Результат = OPI_Airtable.ПолучитьСписокЗаписей(Токен, База, Таблица);

    // END

    Обработать(Результат, "Airtable", "ПолучитьСписокЗаписей");

КонецПроцедуры

Процедура Airtable_УдалитьЗаписи(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Запись  = ПараметрыФункции["Airtable_Record"];

    Результат = OPI_Airtable.УдалитьЗаписи(Токен, База, Таблица, Запись);

    // END

    Обработать(Результат, "Airtable", "УдалитьЗаписи");

КонецПроцедуры

#КонецОбласти

#Область Twitter

Процедура Twitter_ПолучитьТокен(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Код       = "123456";

    Результат = OPI_Twitter.ПолучитьТокен(Код, Параметры);

    // END

    Обработать(Результат, "Twitter", "ПолучитьТокен");

КонецПроцедуры

Процедура Twitter_ПолучитьСсылкуАвторизации(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Результат = OPI_Twitter.ПолучитьСсылкуАвторизации(Параметры);

    // END

    Обработать(Результат, "Twitter", "ПолучитьСсылкуАвторизации");

КонецПроцедуры

Процедура Twitter_ОбновитьТокен(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Результат = OPI_Twitter.ОбновитьТокен(Параметры);

    // END

    Обработать(Результат, "Twitter", "ОбновитьТокен");

КонецПроцедуры

Процедура Twitter_СоздатьТекстовыйТвит(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);

    Результат = OPI_Twitter.СоздатьТекстовыйТвит(Текст, Параметры);

    // END

    Обработать(Результат, "Twitter", "СоздатьТекстовыйТвит", , Текст);

КонецПроцедуры

Процедура Twitter_СоздатьТвитКартинки(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);

    Картинка  = ПараметрыФункции["Picture"];  // URL, Двоичные или Путь к файлу
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Двоичные или Путь к файлу

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка);
    МассивКартинок.Добавить(Картинка2);

    Результат = OPI_Twitter.СоздатьТвитКартинки(Текст, МассивКартинок, Параметры);

    Обработать(Результат, "Twitter", "СоздатьТвитКартинки", , Текст); // SKIP

    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитКартинки(Текст, Картинка, Параметры);

    // END

    Обработать(Результат, "Twitter", "СоздатьТвитКартинки", "Одиночная", Текст);

    Картинка = OPI_ЗапросыHTTP.Get(Картинка);

    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитКартинки(Текст, Картинка, Параметры);

    Обработать(Результат, "Twitter", "СоздатьТвитКартинки", "Двоичные", Текст);

КонецПроцедуры

Процедура Twitter_СоздатьТвитВидео(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);

    Видео  = ПараметрыФункции["Video"]; // URL, Двоичные или Путь к файлу
    Видео2 = ПараметрыФункции["Video"]; // URL, Двоичные или Путь к файлу

    МассивВидео = Новый Массив;
    МассивВидео.Добавить(Видео);
    МассивВидео.Добавить(Видео2);

    Результат = OPI_Twitter.СоздатьТвитВидео(Текст, МассивВидео, Параметры);

    Обработать(Результат, "Twitter", "СоздатьТвитВидео", , Текст); // SKIP

    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитВидео(Текст, Видео, Параметры);

    // END

    Обработать(Результат, "Twitter", "СоздатьТвитВидео", "Одиночная", Текст);

    Видео = OPI_ЗапросыHTTP.Get(Видео);

    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитВидео(Текст, Видео, Параметры);

    Обработать(Результат, "Twitter", "СоздатьТвитВидео", "Двоичные", Текст);

КонецПроцедуры

Процедура Twitter_СоздатьТвитГифки(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);

    Гифка  = ПараметрыФункции["GIF"]; // URL, Двоичные или Путь к файлу
    Гифка2 = ПараметрыФункции["GIF"]; // URL, Двоичные или Путь к файлу

    МассивГифок = Новый Массив;
    МассивГифок.Добавить(Гифка);
    МассивГифок.Добавить(Гифка2);

    Результат = OPI_Twitter.СоздатьТвитГифки(Текст, МассивГифок, Параметры);

    Обработать(Результат, "Twitter", "СоздатьТвитГифки", , Текст); // SKIP

    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитГифки(Текст, Гифка, Параметры);

    // END

    Обработать(Результат, "Twitter", "СоздатьТвитГифки", "Одиночная", Текст);

    Гифка = OPI_ЗапросыHTTP.Get(Гифка);

    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитГифки(Текст, Гифка, Параметры);

    Обработать(Результат, "Twitter", "СоздатьТвитГифки", "Двоичные", Текст);

КонецПроцедуры

Процедура Twitter_СоздатьТвитОпрос(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);

    МассивОтветов = Новый Массив;
    МассивОтветов.Добавить("Вариант 1");
    МассивОтветов.Добавить("Вариант 2");

    Результат = OPI_Twitter.СоздатьТвитОпрос(Текст, МассивОтветов, 60, Параметры);

    // END

    Обработать(Результат, "Twitter", "СоздатьТвитОпрос", , Текст);

КонецПроцедуры

Процедура Twitter_СоздатьПроизвольныйТвит(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твитт" + Строка(Новый УникальныйИдентификатор);

    Картинка1 = ПараметрыФункции["Picture"];  // URL, Двоичные данные или Путь к файлу
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Двоичные данные или Путь к файлу

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка1);
    МассивКартинок.Добавить(Картинка2);

    МассивМедиа = OPI_Twitter.ЗагрузитьМассивВложений(МассивКартинок, "tweet_image", Параметры);
    Результат   = OPI_Twitter.СоздатьПроизвольныйТвит(Текст, МассивМедиа, , , Параметры);

    // END

    Обработать(Результат, "Twitter", "СоздатьПроизвольныйТвит", , Текст);

КонецПроцедуры

Процедура Twitter_ЗагрузитьМассивВложений(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();

    Картинка1 = ПараметрыФункции["Picture"];  // URL, Двоичные данные или Путь к файлу
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Двоичные данные или Путь к файлу

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка1);
    МассивКартинок.Добавить(Картинка2);

    Результат = OPI_Twitter.ЗагрузитьМассивВложений(МассивКартинок, "tweet_image", Параметры);

    // END

    Обработать(Результат, "Twitter", "ЗагрузитьМассивВложений");

КонецПроцедуры

#КонецОбласти

#Область Notion

Процедура Notion_СоздатьСтраницу(ПараметрыФункции)

    Токен     = ПараметрыФункции["Notion_Token"];
    Родитель  = ПараметрыФункции["Notion_Parent"];
    Заголовок = "Тестовый заголовок";

    Результат = OPI_Notion.СоздатьСтраницу(Токен, Родитель, Заголовок);

    // END

    Обработать(Результат, "Notion", "СоздатьСтраницу", , ПараметрыФункции);

КонецПроцедуры

Процедура Notion_СоздатьБазуДанных(ПараметрыФункции)

    Токен     = ПараметрыФункции["Notion_Token"];
    Родитель  = ПараметрыФункции["Notion_Parent"];
    Заголовок = "Тестовый заголовок";

    Свойства = Новый Соответствие;
    Свойства.Вставить("Имя"          , "title");
    Свойства.Вставить("Описание"     , "rich_text");
    Свойства.Вставить("Номер"        , "number");
    Свойства.Вставить("Дата создания", "date");
    Свойства.Вставить("Картинка"     , "files");
    Свойства.Вставить("Активен"      , "checkbox");
    Свойства.Вставить("Сайт"         , "url");
    Свойства.Вставить("Почта"        , "email");
    Свойства.Вставить("Телефон"      , "phone_number");
    Свойства.Вставить("Пользователь" , "people");

    ВыборЗначения = Новый Соответствие;
    ВыборЗначения.Вставить("Новый"    , "green");
    ВыборЗначения.Вставить("В работе" , "yellow");
    ВыборЗначения.Вставить("Удаленный", "red");

    Свойства.Вставить("Статус", ВыборЗначения);

    Результат = OPI_Notion.СоздатьБазуДанных(Токен, Родитель, Заголовок, Свойства);

    // END

    Обработать(Результат, "Notion", "СоздатьБазуДанных", , ПараметрыФункции);

КонецПроцедуры

Процедура Notion_ИзменитьСвойстваБазы(ПараметрыФункции)

    Токен = ПараметрыФункции["Notion_Token"];
    База  = ПараметрыФункции["Notion_Base"];

    Заголовок = "Тестовый заголовок";
    Описание  = "Тестовое описание";

    Свойства = Новый Соответствие;
    Свойства.Вставить("Почта", "rich_text"); // Тип поля "Почта" будет изменен с email на текст
    Свойства.Вставить("Сайт");               // Поле "Сайт" будет удалено

    Результат = OPI_Notion.ИзменитьСвойстваБазы(Токен, База, Свойства, Заголовок, Описание);

    // END

    Обработать(Результат, "Notion", "ИзменитьСвойстваБазы");

КонецПроцедуры

Процедура Notion_ПолучитьСтраницу(ПараметрыФункции)

    Токен    = ПараметрыФункции["Notion_Token"];
    Страница = ПараметрыФункции["Notion_Page"];

    Результат = OPI_Notion.ПолучитьСтраницу(Токен, Страница);

    // END

    Обработать(Результат, "Notion", "ПолучитьСтраницу");

КонецПроцедуры

Процедура Notion_ПолучитьБазуДанных(ПараметрыФункции)

    Токен = ПараметрыФункции["Notion_Token"];
    База  = ПараметрыФункции["Notion_Base"];

    Результат = OPI_Notion.ПолучитьБазуДанных(Токен, База);

    // END

    Обработать(Результат, "Notion", "ПолучитьБазуДанных");

КонецПроцедуры

Процедура Notion_СоздатьСтраницуВБазу(ПараметрыФункции)

    Токен     = ПараметрыФункции["Notion_Token"];
    База      = ПараметрыФункции["Notion_Base"];
    Картинка_ = ПараметрыФункции["Picture"]; // URL, Двоичные данные или Путь к файлу

    Картинка = Новый Соответствие;
    Картинка.Вставить("Лого", Картинка_);

    Свойства = Новый Соответствие;
    Свойства.Вставить("Имя"          , "ООО Вектор");
    Свойства.Вставить("Описание"     , "Наш первый клиент");
    Свойства.Вставить("Номер"        , 1);
    Свойства.Вставить("Дата создания", OPI_Инструменты.ПолучитьТекущуюДату());
    Свойства.Вставить("Картинка"     , Картинка);
    Свойства.Вставить("Активен"      , Истина);
    Свойства.Вставить("Сайт"         , "https://vector.ru");
    Свойства.Вставить("Почта"        , "mail@vector.ru");
    Свойства.Вставить("Телефон"      , "88005553535");
    Свойства.Вставить("Статус"       , "Новый");

    Результат = OPI_Notion.СоздатьСтраницуВБазу(Токен, База, Свойства);

    // END

    Обработать(Результат, "Notion", "СоздатьСтраницуВБазу", , База);

КонецПроцедуры

Процедура Notion_ИзменитьСвойстваСтраницы(ПараметрыФункции)

    Токен        = ПараметрыФункции["Notion_Token"];
    Страница     = ПараметрыФункции["Notion_Page"];
    Иконка       = ПараметрыФункции["Picture"];
    Обложка      = ПараметрыФункции["Picture2"];
    Архивировать = Ложь;

    Свойства = Новый Соответствие;
    Свойства.Вставить("Активен", Ложь);
    Свойства.Вставить("Почта"  , "vector@mail.ru");

    Результат = OPI_Notion.ИзменитьСвойстваСтраницы(Токен, Страница, Свойства, Иконка, Обложка, Архивировать);

    // END

    Обработать(Результат, "Notion", "ИзменитьСвойстваСтраницы");

КонецПроцедуры

Процедура Notion_ВернутьБлок(ПараметрыФункции)

    Токен = ПараметрыФункции["Notion_Token"];
    Блок  = ПараметрыФункции["Notion_Block"];

    Результат = OPI_Notion.ВернутьБлок(Токен, Блок);

    // END

    Обработать(Результат, "Notion", "ВернутьБлок");

КонецПроцедуры

Процедура Notion_СоздатьБлок(ПараметрыФункции)

    Токен    = ПараметрыФункции["Notion_Token"];
    Родитель = ПараметрыФункции["Notion_Parent"];
    Блок     = ПараметрыФункции["Notion_Block"];

    ДанныеБлока = OPI_Notion.ВернутьБлок(Токен, Блок);
    Результат   = OPI_Notion.СоздатьБлок(Токен, Родитель, ДанныеБлока);

    // END

    Обработать(Результат, "Notion", "СоздатьБлок", , ПараметрыФункции);

КонецПроцедуры

Процедура Notion_ВернутьДочерниеБлоки(ПараметрыФункции)

    Токен = ПараметрыФункции["Notion_Token"];
    Блок  = ПараметрыФункции["Notion_NewBlock"];

    Результат = OPI_Notion.ВернутьДочерниеБлоки(Токен, Блок);

    // END

    Обработать(Результат, "Notion", "ВернутьДочерниеБлоки");

КонецПроцедуры

Процедура Notion_УдалитьБлок(ПараметрыФункции)

    Токен = ПараметрыФункции["Notion_Token"];
    Блок  = ПараметрыФункции["Notion_NewBlock"];

    Результат = OPI_Notion.УдалитьБлок(Токен, Блок);

    // END

    Обработать(Результат, "Notion", "УдалитьБлок");

КонецПроцедуры

Процедура Notion_СписокПользователей(ПараметрыФункции)

    Токен = ПараметрыФункции["Notion_Token"];

    Результат = OPI_Notion.СписокПользователей(Токен);

    // END

    Обработать(Результат, "Notion", "СписокПользователей");

КонецПроцедуры

Процедура Notion_ПолучитьДанныеПользователя(ПараметрыФункции)

    Токен        = ПараметрыФункции["Notion_Token"];
    Пользователь = ПараметрыФункции["Notion_User"];

    Результат = OPI_Notion.ПолучитьДанныеПользователя(Токен, Пользователь);

    // END

    Обработать(Результат, "Notion", "ПолучитьДанныеПользователя");

КонецПроцедуры

#КонецОбласти

#Область Dropbox

Процедура Dropbox_ПолучитьСсылкуАвторизации(ПараметрыФункции)

    КлючПриложения = ПараметрыФункции["Dropbox_Appkey"];
    Результат      = OPI_Dropbox.ПолучитьСсылкуАвторизации(КлючПриложения);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьСсылкуАвторизации");

КонецПроцедуры

Процедура Dropbox_ПолучитьТокен(ПараметрыФункции)

    КлючПриложения   = ПараметрыФункции["Dropbox_Appkey"];
    СекретПриложения = ПараметрыФункции["Dropbox_Appsecret"];
    Код              = ПараметрыФункции["Dropbox_Code"];

    Результат = OPI_Dropbox.ПолучитьТокен(КлючПриложения, СекретПриложения, Код);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьТокен");

КонецПроцедуры

Процедура Dropbox_ОбновитьТокен(ПараметрыФункции)

    КлючПриложения   = ПараметрыФункции["Dropbox_Appkey"];
    СекретПриложения = ПараметрыФункции["Dropbox_Appsecret"];
    РефрешТокен      = ПараметрыФункции["Dropbox_Refresh"];

    Результат = OPI_Dropbox.ОбновитьТокен(КлючПриложения, СекретПриложения, РефрешТокен);

    // END

    Обработать(Результат, "Dropbox", "ОбновитьТокен");

КонецПроцедуры

Процедура Dropbox_ПолучитьИнформациюОбОбъекте(ПараметрыФункции)

    Путь  = "/New/pic.png";
    Токен = ПараметрыФункции["Dropbox_Token"];

    Результат = OPI_Dropbox.ПолучитьИнформациюОбОбъекте(Токен, Путь, Истина);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьИнформациюОбОбъекте", , Путь);

КонецПроцедуры

Процедура Dropbox_ПолучитьПревью(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Путь  = "/New/mydoc.docx";

    Результат = OPI_Dropbox.ПолучитьПревью(Токен, Путь);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьПревью");

КонецПроцедуры

Процедура Dropbox_ЗагрузитьФайл(ПараметрыФункции)

    Путь     = "/New/pic.png";
    Токен    = ПараметрыФункции["Dropbox_Token"];
    Картинка = ПараметрыФункции["Picture"];

    КартинкаПуть = ПолучитьИмяВременногоФайла("png");
    КопироватьФайл(Картинка, КартинкаПуть);

    Результат = OPI_Dropbox.ЗагрузитьФайл(Токен, КартинкаПуть, Путь, Истина);

    // END

    Обработать(Результат, "Dropbox", "ЗагрузитьФайл", , Путь);

    OPI_Инструменты.УдалитьФайлВПопытке(КартинкаПуть, "Не удалось удалить временный файл после теста!");

    Если Не OPI_Инструменты.ЭтоOneScript() И ПараметрыФункции.Свойство("Big")  Тогда

        БольшойФайл = ПараметрыФункции["Big"];

        Путь      = "/giant.tmp";
        Результат = OPI_Dropbox.ЗагрузитьФайл(Токен, БольшойФайл, Путь, Истина);

        Обработать(Результат, "Dropbox", "ЗагрузитьФайл", "Большой", Путь);

    КонецЕсли;

КонецПроцедуры

Процедура Dropbox_ЗагрузитьФайлПоURL(ПараметрыФункции)

    Путь  = "/New/url_doc.docx";
    Токен = ПараметрыФункции["Dropbox_Token"];
    URL   = ПараметрыФункции["Document"];

    Результат = OPI_Dropbox.ЗагрузитьФайлПоURL(Токен, URL, Путь);

    // END

    Обработать(Результат, "Dropbox", "ЗагрузитьФайлПоURL", , ПараметрыФункции);

КонецПроцедуры

Процедура Dropbox_ПолучитьСтатусЗагрузкиПоURL(ПараметрыФункции)

    Токен    = ПараметрыФункции["Dropbox_Token"];
    ИДРаботы = ПараметрыФункции["Dropbox_Job"];
    Статус   = "in_progress";

    Пока Статус = "in_progress" Цикл

        Результат = OPI_Dropbox.ПолучитьСтатусЗагрузкиПоURL(Токен, ИДРаботы);
        Статус    = Результат[".tag"];

        OPI_Инструменты.Пауза(5);

        Обработать(Результат, "Dropbox", "ПолучитьСтатусЗагрузкиПоURL", "Прогресс"); // SKIP

    КонецЦикла;

    // END

    Обработать(Результат, "Dropbox", "ПолучитьСтатусЗагрузкиПоURL");

    Токен     = ПараметрыФункции["Dropbox_Token"];
    Путь      = "/New/url_doc.docx";
    Результат = OPI_Dropbox.УдалитьОбъект(Токен, Путь);

    Обработать(Результат, "Dropbox", "ПолучитьСтатусЗагрузкиПоURL", "Удаление", Путь);

КонецПроцедуры

Процедура Dropbox_УдалитьОбъект(ПараметрыФункции)

    Путь  = "/New/pic.png";
    Токен = ПараметрыФункции["Dropbox_Token"];

    Результат = OPI_Dropbox.УдалитьОбъект(Токен, Путь);

    // END

    Обработать(Результат, "Dropbox", "УдалитьОбъект", , Путь);

КонецПроцедуры

Процедура Dropbox_КопироватьОбъект(ПараметрыФункции)

    Оригинал = "/New/pic.png";
    Копия    = "/New/pic_copy.png";
    Токен    = ПараметрыФункции["Dropbox_Token"];

    Результат = OPI_Dropbox.КопироватьОбъект(Токен, Оригинал, Копия);

    // END

    Обработать(Результат, "Dropbox", "КопироватьОбъект", , Копия);

    Результат = OPI_Dropbox.УдалитьОбъект(Токен, Копия);

    Обработать(Результат, "Dropbox", "КопироватьОбъект", "Удаление", Копия);

КонецПроцедуры

Процедура Dropbox_ПереместитьОбъект(ПараметрыФункции)

    ОригиналныйПуть = "/New/pic.png";
    ЦелевойПуть     = "/pic.png";
    Токен           = ПараметрыФункции["Dropbox_Token"];

    Результат = OPI_Dropbox.ПереместитьОбъект(Токен, ОригиналныйПуть, ЦелевойПуть);

    // END

    Обработать(Результат, "Dropbox", "ПереместитьОбъект", , ЦелевойПуть);

    Результат = OPI_Dropbox.ПереместитьОбъект(Токен, ЦелевойПуть, ОригиналныйПуть);

    Обработать(Результат, "Dropbox", "ПереместитьОбъект", "Удаление", ОригиналныйПуть);

КонецПроцедуры

Процедура Dropbox_СоздатьПапку(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Путь  = "/Новый каталог";

    Результат = OPI_Dropbox.СоздатьПапку(Токен, Путь);

    // END

    Обработать(Результат, "Dropbox", "СоздатьПапку", , Путь);

    OPI_Dropbox.УдалитьОбъект(Токен, Путь);

КонецПроцедуры

Процедура Dropbox_СкачатьФайл(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Путь  = "/New/pic.png";

    Результат = OPI_Dropbox.СкачатьФайл(Токен, Путь);

    // END

    Обработать(Результат, "Dropbox", "СкачатьФайл");

КонецПроцедуры

Процедура Dropbox_СкачатьПапку(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Путь  = "/New";

    Результат = OPI_Dropbox.СкачатьПапку(Токен, Путь);

    // END

    Обработать(Результат, "Dropbox", "СкачатьПапку");

КонецПроцедуры

Процедура Dropbox_ПолучитьСписокФайловПапки(ПараметрыФункции)

    Путь  = "/New";
    Токен = ПараметрыФункции["Dropbox_Token"];

    Результат = OPI_Dropbox.ПолучитьСписокФайловПапки(Токен, Путь, Истина);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьСписокФайловПапки");

КонецПроцедуры

Процедура Dropbox_ПолучитьСписокВерсийОбъекта(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Путь  = "/New/pic.png";

    Результат = OPI_Dropbox.ПолучитьСписокВерсийОбъекта(Токен, Путь, 1);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьСписокВерсийОбъекта", , ПараметрыФункции);

КонецПроцедуры

Процедура Dropbox_ВосстановитьОбъектКВерсии(ПараметрыФункции)

    Версия = ПараметрыФункции["Dropbox_FileRevision"];
    Токен  = ПараметрыФункции["Dropbox_Token"];
    Путь   = "/New/pic.png";

    Результат = OPI_Dropbox.ВосстановитьОбъектКВерсии(Токен, Путь, Версия);

    // END

    Обработать(Результат, "Dropbox", "ВосстановитьОбъектКВерсии", , Путь);

КонецПроцедуры

Процедура Dropbox_ПолучитьСписокТегов(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];

    МассивПутей = Новый Массив;
    МассивПутей.Добавить("/New/Dogs.mp3");
    МассивПутей.Добавить("/New/mydoc.docx");

    Результат = OPI_Dropbox.ПолучитьСписокТегов(Токен, МассивПутей);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьСписокТегов", , ПараметрыФункции, МассивПутей);

КонецПроцедуры

Процедура Dropbox_ДобавитьТег(ПараметрыФункции)

    Тег   = "Важное";
    Токен = ПараметрыФункции["Dropbox_Token"];
    Путь  = "/New/mydoc.docx";

    Результат = OPI_Dropbox.ДобавитьТег(Токен, Путь, Тег);

    // END

    Обработать(Результат, "Dropbox", "ДобавитьТег");

КонецПроцедуры

Процедура Dropbox_УдалитьТег(ПараметрыФункции)

    Тег   = "Важное";
    Токен = ПараметрыФункции["Dropbox_Token"];
    Путь  = "/New/mydoc.docx";

    Результат = OPI_Dropbox.УдалитьТег(Токен, Путь, Тег);

    // END

    Обработать(Результат, "Dropbox", "УдалитьТег");

КонецПроцедуры

Процедура Dropbox_ПолучитьИнформациюОбАккаунте(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];

    Результат = OPI_Dropbox.ПолучитьИнформациюОбАккаунте(Токен);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьИнформациюОбАккаунте");

    IDАккаунта = Результат["account_id"];
    Результат  = OPI_Dropbox.ПолучитьИнформациюОбАккаунте(Токен, IDАккаунта);

    Обработать(Результат, "Dropbox", "ПолучитьИнформациюОбАккаунте", "По ID");

КонецПроцедуры

Процедура Dropbox_ПолучитьДанныеИспользованияПространства(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];

    Результат = OPI_Dropbox.ПолучитьДанныеИспользованияПространства(Токен);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьДанныеИспользованияПространства");

КонецПроцедуры

Процедура Dropbox_ДобавитьПользователейКФайлу(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Почта = ПараметрыФункции["Dropbox_OtherUser"];
    Файл  = ПараметрыФункции["Dropbox_FileID"];

    Результат = OPI_Dropbox.ДобавитьПользователейКФайлу(Токен, Файл, Почта, Ложь);

    // END

    Обработать(Результат, "Dropbox", "ДобавитьПользователейКФайлу", , Почта, Ложь);

    Почты = Новый Массив;
    Почты.Добавить(Почта);

    Результат = OPI_Dropbox.ДобавитьПользователейКФайлу(Токен, Файл, Почты, Истина);

    Обработать(Результат, "Dropbox", "ДобавитьПользователейКФайлу", , Почта, Истина);

КонецПроцедуры

Процедура Dropbox_ОпубликоватьПапку(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Путь  = "/New";

    Результат = OPI_Dropbox.ОпубликоватьПапку(Токен, Путь);

    // END

    Обработать(Результат, "Dropbox", "ОпубликоватьПапку", , ПараметрыФункции);

КонецПроцедуры

Процедура Dropbox_ОтменитьПубликациюПапки(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Папка = ПараметрыФункции["Dropbox_SharedFolder"];

    Результат = OPI_Dropbox.ОтменитьПубликациюПапки(Токен, Папка);

    Обработать(Результат, "Dropbox", "ОтменитьПубликациюПапки"); // SKIP

    ТекущийСтатус = "in_progress";
    IDРаботы      = Результат["async_job_id"];

    Пока ТекущийСтатус = "in_progress" Цикл
        Результат     = OPI_Dropbox.ПолучитьСтатусАсинхронногоИзменения(Токен, IDРаботы);
        ТекущийСтатус = Результат[".tag"];
        OPI_Инструменты.Пауза(3);
    КонецЦикла;

    // END

    Обработать(Результат, "Dropbox", "ОтменитьПубликациюПапки", "Окончание", ПараметрыФункции, IDРаботы);

КонецПроцедуры

Процедура Dropbox_ПолучитьСтатусАсинхронногоИзменения(ПараметрыФункции)

    Токен    = ПараметрыФункции["Dropbox_Token"];
    IDРаботы = ПараметрыФункции["Dropbox_NewJobID"];

    Результат = OPI_Dropbox.ПолучитьСтатусАсинхронногоИзменения(Токен, IDРаботы);

    // END

    Обработать(Результат, "Dropbox", "ПолучитьСтатусАсинхронногоИзменения");

КонецПроцедуры

Процедура Dropbox_ДобавитьПользователейКПапке(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Почта = ПараметрыФункции["Dropbox_OtherUser"];
    Папка = ПараметрыФункции["Dropbox_SharedFolder"]; // shared_folder_id

    Результат = OPI_Dropbox.ДобавитьПользователейКПапке(Токен, Папка, Почта, Ложь);

    // END

    Обработать(Результат, "Dropbox", "ДобавитьПользователейКПапке");

    Почты = Новый Массив;
    Почты.Добавить(Почта);

    Результат = OPI_Dropbox.ДобавитьПользователейКПапке(Токен, Папка, Почты, Истина);

    Обработать(Результат, "Dropbox", "ДобавитьПользователейКПапке", "Дополнительный");

КонецПроцедуры

Процедура Dropbox_ОтменитьПубликациюФайла(ПараметрыФункции)

    Токен = ПараметрыФункции["Dropbox_Token"];
    Файл  = ПараметрыФункции["Dropbox_FileID"];

    Результат = OPI_Dropbox.ОтменитьПубликациюФайла(Токен, Файл);

    // END

    Обработать(Результат, "Dropbox", "ОтменитьПубликациюФайла");

КонецПроцедуры

#КонецОбласти

#Область Bitrix24

Процедура Bitrix24_ПолучитьСсылкуАвторизацииПриложения(ПараметрыФункции)

    Домен    = ПараметрыФункции["Bitrix24_Domain"];
    ClientID = ПараметрыФункции["Bitrix24_ClientID"];

    Результат = OPI_Bitrix24.ПолучитьСсылкуАвторизацииПриложения(Домен, ClientID);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСсылкуАвторизацииПриложения");

КонецПроцедуры

Процедура Bitrix24_ПолучитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Bitrix24_ClientID"];
    ClientSecret = ПараметрыФункции["Bitrix24_ClientSecret"];
    Code         = ПараметрыФункции["Bitrix24_Code"];

    Результат = OPI_Bitrix24.ПолучитьТокен(ClientID, ClientSecret, Code);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьТокен");

КонецПроцедуры

Процедура Bitrix24_ОбновитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Bitrix24_ClientID"];
    ClientSecret = ПараметрыФункции["Bitrix24_ClientSecret"];
    Refresh      = ПараметрыФункции["Bitrix24_Refresh"];

    Результат = OPI_Bitrix24.ОбновитьТокен(ClientID, ClientSecret, Refresh);

    // END

    Обработать(Результат, "Bitrix24", "ОбновитьТокен");

КонецПроцедуры

Процедура Bitrix24_СерверноеВремя(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СерверноеВремя(URL);

    Обработать(Результат, "Bitrix24", "СерверноеВремя", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СерверноеВремя(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СерверноеВремя");

КонецПроцедуры

Процедура Bitrix24_СоздатьНовость(ПараметрыФункции)

    Текст     = "Текст новости";
    Заголовок = "Заголовок новости";
    Картинка1 = ПараметрыФункции["Picture"];  // URL, Путь или Двоичные данные
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Путь или Двоичные данные

    Файлы = Новый Соответствие;
    Файлы.Вставить("1.png", Картинка1);
    Файлы.Вставить("2.png", Картинка2);

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьНовость(URL, Текст, , Файлы, Заголовок, Истина);

    Обработать(Результат, "Bitrix24", "СоздатьНовость", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьНовость(URL, Текст, , Файлы, Заголовок, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьНовость", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьНовость(ПараметрыФункции)

    Текст     = "Новый текст новости";
    Заголовок = "Новый заголовок новости";
    Картинка1 = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    IDНовости = ПараметрыФункции["Bitrix24_PostID"];

    Файлы = Новый Соответствие;
    Файлы.Вставить("1.png", Картинка1);

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ИзменитьНовость(URL, IDНовости, Текст, , Файлы, Заголовок);

    Обработать(Результат, "Bitrix24", "ИзменитьНовость", "Хук"); // SKIP

    URL       = ПараметрыФункции["Bitrix24_Domain"];
    Токен     = ПараметрыФункции["Bitrix24_Token"];
    IDНовости = ПараметрыФункции["Bitrix24_HookPostID"];

    Результат = OPI_Bitrix24.ИзменитьНовость(URL, IDНовости, Текст, , Файлы, Заголовок, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьНовость");

КонецПроцедуры

Процедура Bitrix24_УдалитьНовость(ПараметрыФункции)

    IDНовости = ПараметрыФункции["Bitrix24_HookPostID"];
    URL       = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.УдалитьНовость(URL, IDНовости);

    Обработать(Результат, "Bitrix24", "УдалитьНовость", "Хук"); // SKIP

    IDНовости = ПараметрыФункции["Bitrix24_PostID"];
    URL       = ПараметрыФункции["Bitrix24_Domain"];
    Токен     = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.УдалитьНовость(URL, IDНовости, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьНовость");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокПросмотревшихВажное(ПараметрыФункции)

    IDНовости = ПараметрыФункции["Bitrix24_HookPostID"];
    URL       = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСписокПросмотревшихВажное(URL, IDНовости);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокПросмотревшихВажное", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСписокПросмотревшихВажное(URL, IDНовости, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокПросмотревшихВажное");

КонецПроцедуры

Процедура Bitrix24_ПолучитьНовости(ПараметрыФункции)

    IDНовости = ПараметрыФункции["Bitrix24_PostID"];
    URL       = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьНовости(URL, IDНовости);

    Обработать(Результат, "Bitrix24", "ПолучитьНовости", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьНовости(URL, IDНовости, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьНовости");

КонецПроцедуры

Процедура Bitrix24_ДобавитьКомментарийНовости(ПараметрыФункции)

    Текст     = "Комментарий к новости";
    IDНовости = ПараметрыФункции["Bitrix24_PostID"];
    URL       = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ДобавитьКомментарийНовости(URL, IDНовости, Текст);

    Обработать(Результат, "Bitrix24", "ДобавитьКомментарийНовости", "Хук"); // SKIP

    Текст = "Другой комментарий к новости";
    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ДобавитьКомментарийНовости(URL, IDНовости, Текст, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьКомментарийНовости");

КонецПроцедуры

Процедура Bitrix24_ДобавитьПолучателейКНовости(ПараметрыФункции)

    Видимость = "UA";
    IDНовости = ПараметрыФункции["Bitrix24_PostID"];
    URL       = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ДобавитьПолучателейКНовости(URL, IDНовости, Видимость);

    Обработать(Результат, "Bitrix24", "ДобавитьПолучателейКНовости", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ДобавитьПолучателейКНовости(URL, IDНовости, Видимость, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьПолучателейКНовости");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруЗадачи(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруЗадачи(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруЗадачи", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруЗадачи(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруЗадачи");

КонецПроцедуры

Процедура Bitrix24_СоздатьЗадачу(ПараметрыФункции)

    // Полную структуру полей можно получить функцией ПолучитьСтруктуруЗадачи()

    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();
    Час         = 3600;
    Сутки       = 24;
    Исполнитель = 1;

    СтруктураЗадачи = Новый Структура;
    СтруктураЗадачи.Вставить("TITLE"         , "Новая задача");
    СтруктураЗадачи.Вставить("DESCRIPTION"   , "Новое описание задачи");
    СтруктураЗадачи.Вставить("PRIORITY"      , "2");
    СтруктураЗадачи.Вставить("DEADLINE"      , ТекущаяДата + Час * Сутки);
    СтруктураЗадачи.Вставить("RESPONSIBLE_ID", Исполнитель);

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьЗадачу(URL, СтруктураЗадачи);

    Обработать(Результат, "Bitrix24", "СоздатьЗадачу", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьЗадачу(URL, СтруктураЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьЗадачу", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьЗадачу(ПараметрыФункции)

    // Полную структуру полей можно получить функцией ПолучитьСтруктуруЗадачи()

    СтруктураЗадачи = Новый Структура;
    СтруктураЗадачи.Вставить("TITLE"      , "Другой заголовок задачи");
    СтруктураЗадачи.Вставить("DESCRIPTION", "Другое описание задачи");
    СтруктураЗадачи.Вставить("PRIORITY"   , "1");

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ИзменитьЗадачу(URL, IDЗадачи, СтруктураЗадачи);

    Обработать(Результат, "Bitrix24", "ИзменитьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ИзменитьЗадачу(URL, IDЗадачи, СтруктураЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьЗадачу");

КонецПроцедуры

Процедура Bitrix24_ПолучитьЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ПолучитьЗадачу(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПолучитьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ПолучитьЗадачу(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьЗадачу");

КонецПроцедуры

Процедура Bitrix24_ПринятьЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ПринятьЗадачу(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПринятьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ПринятьЗадачу(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПринятьЗадачу");

КонецПроцедуры

Процедура Bitrix24_ОтклонитьЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ОтклонитьЗадачу(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ОтклонитьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ОтклонитьЗадачу(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтклонитьЗадачу");

КонецПроцедуры

Процедура Bitrix24_ЗавершитьЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ЗавершитьЗадачу(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ЗавершитьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ЗавершитьЗадачу(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ЗавершитьЗадачу");

КонецПроцедуры

Процедура Bitrix24_ВозобновитьЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ВозобновитьЗадачу(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ВозобновитьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ВозобновитьЗадачу(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ВозобновитьЗадачу");

КонецПроцедуры

Процедура Bitrix24_ОтложитьЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ОтложитьЗадачу(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ОтложитьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ОтложитьЗадачу(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтложитьЗадачу");

КонецПроцедуры

Процедура Bitrix24_НачатьВыполнениеЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.НачатьВыполнениеЗадачи(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "НачатьВыполнениеЗадачи", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.НачатьВыполнениеЗадачи(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "НачатьВыполнениеЗадачи");

КонецПроцедуры

Процедура Bitrix24_НачатьНаблюдатьЗаЗадачей(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.НачатьНаблюдатьЗаЗадачей(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "НачатьНаблюдатьЗаЗадачей", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.НачатьНаблюдатьЗаЗадачей(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "НачатьНаблюдатьЗаЗадачей");

КонецПроцедуры

Процедура Bitrix24_ПрекратитьНаблюдатьЗаЗадачей(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ПрекратитьНаблюдатьЗаЗадачей(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПрекратитьНаблюдатьЗаЗадачей", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ПрекратитьНаблюдатьЗаЗадачей(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПрекратитьНаблюдатьЗаЗадачей");

КонецПроцедуры

Процедура Bitrix24_ПриостановитьЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ПриостановитьЗадачу(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПриостановитьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ПриостановитьЗадачу(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПриостановитьЗадачу");

КонецПроцедуры

Процедура Bitrix24_УдалитьЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.УдалитьЗадачу(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "УдалитьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.УдалитьЗадачу(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьЗадачу");

КонецПроцедуры

Процедура Bitrix24_ДелегироватьЗадачу(ПараметрыФункции)

    URL            = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи       = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDПользователя = ПараметрыФункции["Bitrix24_UserID"];

    Результат = OPI_Bitrix24.ДелегироватьЗадачу(URL, IDЗадачи, IDПользователя);

    Обработать(Результат, "Bitrix24", "ДелегироватьЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ДелегироватьЗадачу(URL, IDЗадачи, IDПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДелегироватьЗадачу");

КонецПроцедуры

Процедура Bitrix24_ДобавитьЗадачуВИзбранное(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ДобавитьЗадачуВИзбранное(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ДобавитьЗадачуВИзбранное", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ДобавитьЗадачуВИзбранное(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьЗадачуВИзбранное");

КонецПроцедуры

Процедура Bitrix24_УбратьЗадачуИзИзбранного(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.УбратьЗадачуИзИзбранного(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "УбратьЗадачуИзИзбранного", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.УбратьЗадачуИзИзбранного(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УбратьЗадачуИзИзбранного");

КонецПроцедуры

Процедура Bitrix24_ПолучитьИсториюЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ПолучитьИсториюЗадачи(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПолучитьИсториюЗадачи", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ПолучитьИсториюЗадачи(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьИсториюЗадачи");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокЗадач(ПараметрыФункции)

    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();

    // Полную структуру фильтра можно найти в функции ПолучитьСтруктуруФильтраЗадач
    Фильтр = Новый Соответствие;
    Фильтр.Вставить("CREATED_BY", 1);                                 // Постановщик с ID 1
    Фильтр.Вставить("!RESPONSIBLE_ID", 10);                           // Исполнители с ID не равным 10
    Фильтр.Вставить(">=CREATED_DATE ", ТекущаяДата - 60 * 60 * 24);   // Дата создания >= вчера

    Поля = Новый Массив;
    Поля.Добавить("UF_CRM_TASK");
    Поля.Добавить("CREATED_BY");

    Отступ = 1;
    URL    = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСписокЗадач(URL, Фильтр, , , Поля);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокЗадач", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСписокЗадач(URL, , Отступ, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокЗадач");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокХранилищ(ПараметрыФункции)

    URL       = ПараметрыФункции["Bitrix24_URL"];
    Результат = OPI_Bitrix24.ПолучитьСписокХранилищ(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокХранилищ", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСписокХранилищ(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокХранилищ");

КонецПроцедуры

Процедура Bitrix24_ПолучитьХранилищеПриложения(ПараметрыФункции)

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьХранилищеПриложения(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьХранилищеПриложения", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ЗагрузитьФайлВХранилище(ПараметрыФункции)

    Наименование2 = "Картинка2.jpg";
    Наименование  = "Картинка1.jpg";

    Картинка2 = ПараметрыФункции["Picture"];  // Локальный путь, URL или Двоичные данные
    Картинка  = ПараметрыФункции["Picture2"]; // Локальный путь, URL или Двоичные данные

    IDПриемника = 3;

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ЗагрузитьФайлВХранилище(URL, Наименование2, Картинка2, IDПриемника);

    Обработать(Результат, "Bitrix24", "ЗагрузитьФайлВХранилище", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ЗагрузитьФайлВХранилище(URL, Наименование, Картинка, IDПриемника, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ЗагрузитьФайлВХранилище", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_УдалитьФайл(ПараметрыФункции)

    URL     = ПараметрыФункции["Bitrix24_URL"];
    IDФайла = ПараметрыФункции["Bitrix24_HookFileID"];

    Результат = OPI_Bitrix24.УдалитьФайл(URL, IDФайла);

    Обработать(Результат, "Bitrix24", "УдалитьФайл", "Хук"); // SKIP

    URL     = ПараметрыФункции["Bitrix24_Domain"];
    Токен   = ПараметрыФункции["Bitrix24_Token"];
    IDФайла = ПараметрыФункции["Bitrix24_FileID"];

    Результат = OPI_Bitrix24.УдалитьФайл(URL, IDФайла, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьФайл");

КонецПроцедуры

Процедура Bitrix24_СоздатьКаталогВХранилище(ПараметрыФункции)

    IDХранилища   = 3;
    Наименование  = "Новый каталог";
    Наименование2 = "Новый каталог 2";

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьКаталогВХранилище(URL, IDХранилища, Наименование2);

    Обработать(Результат, "Bitrix24", "СоздатьКаталогВХранилище", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьКаталогВХранилище(URL, IDХранилища, Наименование, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьКаталогВХранилище", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_УдалитьКаталог(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDКаталога = ПараметрыФункции["Bitrix24_HookFolderID"];

    Результат = OPI_Bitrix24.УдалитьКаталог(URL, IDКаталога);

    Обработать(Результат, "Bitrix24", "УдалитьКаталог", "Хук"); // SKIP

    URL        = ПараметрыФункции["Bitrix24_Domain"];
    Токен      = ПараметрыФункции["Bitrix24_Token"];
    IDКаталога = ПараметрыФункции["Bitrix24_FolderID"];

    Результат = OPI_Bitrix24.УдалитьКаталог(URL, IDКаталога, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьКаталог");

КонецПроцедуры

Процедура Bitrix24_ПолучитьХранилище(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDХранилища = 3;

    Результат = OPI_Bitrix24.ПолучитьХранилище(URL, IDХранилища);

    Обработать(Результат, "Bitrix24", "ПолучитьХранилище", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьХранилище(URL, IDХранилища, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьХранилище");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСодержимоеХранилища(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDХранилища = 3;

    Результат = OPI_Bitrix24.ПолучитьСодержимоеХранилища(URL, IDХранилища);

    Обработать(Результат, "Bitrix24", "ПолучитьСодержимоеХранилища", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСодержимоеХранилища(URL, IDХранилища, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСодержимоеХранилища");

КонецПроцедуры

Процедура Bitrix24_ПереименоватьХранилище(ПараметрыФункции)

    Наименование = "Новое имя хранилища";
    URL          = ПараметрыФункции["Bitrix24_Domain"];
    Токен        = ПараметрыФункции["Bitrix24_Token"];
    IDХранилища  = ПараметрыФункции["Bitrix24_StorageID"];

    Результат = OPI_Bitrix24.ПереименоватьХранилище(URL, IDХранилища, Наименование, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПереименоватьХранилище");

КонецПроцедуры

Процедура Bitrix24_ПолучитьИнформациюОКаталоге(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDКаталога = ПараметрыФункции["Bitrix24_FolderID"];

    Результат = OPI_Bitrix24.ПолучитьИнформациюОКаталоге(URL, IDКаталога);

    Обработать(Результат, "Bitrix24", "ПолучитьИнформациюОКаталоге", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьИнформациюОКаталоге(URL, IDКаталога, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьИнформациюОКаталоге");

КонецПроцедуры

Процедура Bitrix24_СоздатьПодкаталог(ПараметрыФункции)

    IDКаталога    = ПараметрыФункции["Bitrix24_FolderID"];
    Наименование  = "Новый подкаталог";
    Наименование2 = "Новый подкаталог 2";

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьПодкаталог(URL, IDКаталога, Наименование2);

    Обработать(Результат, "Bitrix24", "СоздатьПодкаталог", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьПодкаталог(URL, IDКаталога, Наименование, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьПодкаталог", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_СкопироватьКаталог(ПараметрыФункции)

    IDПриемника = ПараметрыФункции["Bitrix24_HookSubfolderID"];
    IDКаталога  = ПараметрыФункции["Bitrix24_SubfolderID"];

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СкопироватьКаталог(URL, IDКаталога, IDПриемника);

    Обработать(Результат, "Bitrix24", "СкопироватьКаталог", "Хук"); // SKIP

    IDПриемника = ПараметрыФункции["Bitrix24_SubfolderID"];
    IDКаталога  = ПараметрыФункции["Bitrix24_HookSubfolderID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    // END

    Обработать(Результат, "Bitrix24", "СкопироватьКаталог");

КонецПроцедуры

Процедура Bitrix24_ПолучитьВнешнююСсылкуКаталога(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDКаталога = ПараметрыФункции["Bitrix24_FolderID"];

    Результат = OPI_Bitrix24.ПолучитьВнешнююСсылкуКаталога(URL, IDКаталога);

    Обработать(Результат, "Bitrix24", "ПолучитьВнешнююСсылкуКаталога", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьВнешнююСсылкуКаталога(URL, IDКаталога, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьВнешнююСсылкуКаталога");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруФильтраКаталога(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруФильтраКаталога(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруФильтраКаталога", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруФильтраКаталога(URL, Истина, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруФильтраКаталога");

КонецПроцедуры

Процедура Bitrix24_ПолучитьДочерниеЭлементыКаталога(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDКаталога = ПараметрыФункции["Bitrix24_FolderID"];

    Результат = OPI_Bitrix24.ПолучитьДочерниеЭлементыКаталога(URL, IDКаталога);

    Обработать(Результат, "Bitrix24", "ПолучитьДочерниеЭлементыКаталога", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьДочерниеЭлементыКаталога(URL, IDКаталога, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьДочерниеЭлементыКаталога");

КонецПроцедуры

Процедура Bitrix24_ПоместитьКаталогВКорзину(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDКаталога = ПараметрыФункции["Bitrix24_FolderID"];

    Результат = OPI_Bitrix24.ПоместитьКаталогВКорзину(URL, IDКаталога);

    Обработать(Результат, "Bitrix24", "ПоместитьКаталогВКорзину", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПоместитьКаталогВКорзину(URL, IDКаталога, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПоместитьКаталогВКорзину");

КонецПроцедуры

Процедура Bitrix24_ВосстановитьКаталог(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDКаталога = ПараметрыФункции["Bitrix24_FolderID"];

    Результат = OPI_Bitrix24.ВосстановитьКаталог(URL, IDКаталога);

    Обработать(Результат, "Bitrix24", "ВосстановитьКаталог", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ВосстановитьКаталог(URL, IDКаталога, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ВосстановитьКаталог");

КонецПроцедуры

Процедура Bitrix24_ПереместитьКаталог(ПараметрыФункции)

    IDПриемника = ПараметрыФункции["Bitrix24_HookfolderID"];
    IDКаталога  = ПараметрыФункции["Bitrix24_SubfolderID"];

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПереместитьКаталог(URL, IDКаталога, IDПриемника);

    Обработать(Результат, "Bitrix24", "ПереместитьКаталог", "Хук"); // SKIP

    IDКаталога = ПараметрыФункции["Bitrix24_HookSubfolderID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПереместитьКаталог(URL, IDКаталога, IDПриемника, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПереместитьКаталог");

КонецПроцедуры

Процедура Bitrix24_ПереименоватьКаталог(ПараметрыФункции)

    Наименование  = "Новый каталог";
    Наименование2 = "Новый каталог 2";

    IDКаталога2 = ПараметрыФункции["Bitrix24_HookFolderID"];
    URL         = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПереименоватьКаталог(URL, IDКаталога2, Наименование2);

    Обработать(Результат, "Bitrix24", "ПереименоватьКаталог", "Хук"); // SKIP

    IDКаталога = ПараметрыФункции["Bitrix24_FolderID"];
    URL        = ПараметрыФункции["Bitrix24_Domain"];
    Токен      = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПереименоватьКаталог(URL, IDКаталога, Наименование, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПереименоватьКаталог");

КонецПроцедуры

Процедура Bitrix24_ЗагрузитьФайлВКаталог(ПараметрыФункции)

    Наименование2 = "Картинка2.jpg";
    Наименование  = "Картинка1.jpg";

    Картинка2 = ПараметрыФункции["Picture"];  // Локальный путь, URL или Двоичные данные
    Картинка  = ПараметрыФункции["Picture2"]; // Локальный путь, URL или Двоичные данные

    IDПриемника = ПараметрыФункции["Bitrix24_FolderID"];

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ЗагрузитьФайлВКаталог(URL, Наименование2, Картинка2, IDПриемника);

    Обработать(Результат, "Bitrix24", "ЗагрузитьФайлВКаталог", "Хук", URL); // SKIP

    IDФайла = Результат["result"]["ID"];    // SKIP
    OPI_Bitrix24.УдалитьФайл(URL, IDФайла); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ЗагрузитьФайлВКаталог(URL, Наименование, Картинка, IDПриемника, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ЗагрузитьФайлВКаталог", , URL, Токен);

    IDФайла = Результат["result"]["ID"];

    OPI_Bitrix24.УдалитьФайл(URL, IDФайла, Токен);

КонецПроцедуры

Процедура Bitrix24_СкопироватьФайл(ПараметрыФункции)

    IDКаталога = ПараметрыФункции["Bitrix24_HookFolderID"];
    IDФайла    = ПараметрыФункции["Bitrix24_FileID"];

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СкопироватьФайл(URL, IDФайла, IDКаталога);

    Обработать(Результат, "Bitrix24", "СкопироватьФайл", "Хук"); // SKIP

    IDКаталога = ПараметрыФункции["Bitrix24_FolderID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СкопироватьФайл(URL, IDФайла, IDКаталога, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СкопироватьФайл");

КонецПроцедуры

Процедура Bitrix24_ПолучитьИнформациюОФайле(ПараметрыФункции)

    URL     = ПараметрыФункции["Bitrix24_URL"];
    IDФайла = ПараметрыФункции["Bitrix24_FileID"];

    Результат = OPI_Bitrix24.ПолучитьИнформациюОФайле(URL, IDФайла);

    Обработать(Результат, "Bitrix24", "ПолучитьИнформациюОФайле", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьИнформациюОФайле(URL, IDФайла, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьИнформациюОФайле");

КонецПроцедуры

Процедура Bitrix24_ПолучитьВнешнююСсылкуФайла(ПараметрыФункции)

    OPI_Инструменты.Пауза(20); // SKIP

    URL     = ПараметрыФункции["Bitrix24_URL"];
    IDФайла = ПараметрыФункции["Bitrix24_FileID"];

    Результат = OPI_Bitrix24.ПолучитьВнешнююСсылкуФайла(URL, IDФайла);

    Обработать(Результат, "Bitrix24", "ПолучитьВнешнююСсылкуФайла", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьВнешнююСсылкуФайла(URL, IDФайла, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьВнешнююСсылкуФайла");

КонецПроцедуры

Процедура Bitrix24_ПоместитьФайлВКорзину(ПараметрыФункции)

    URL     = ПараметрыФункции["Bitrix24_URL"];
    IDФайла = ПараметрыФункции["Bitrix24_FileID"];

    Результат = OPI_Bitrix24.ПоместитьФайлВКорзину(URL, IDФайла);

    Обработать(Результат, "Bitrix24", "ПоместитьФайлВКорзину", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПоместитьФайлВКорзину(URL, IDФайла, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПоместитьФайлВКорзину");

КонецПроцедуры

Процедура Bitrix24_ВосстановитьФайл(ПараметрыФункции)

    URL     = ПараметрыФункции["Bitrix24_URL"];
    IDФайла = ПараметрыФункции["Bitrix24_FileID"];

    Результат = OPI_Bitrix24.ВосстановитьФайл(URL, IDФайла);

    Обработать(Результат, "Bitrix24", "ВосстановитьФайл", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ВосстановитьФайл(URL, IDФайла, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ВосстановитьФайл");

КонецПроцедуры

Процедура Bitrix24_ПереименоватьФайл(ПараметрыФункции)

    Наименование  = "Новое имя файла.jpg";
    Наименование2 = "Новое имя файла 2.jpg";

    IDФайла2 = ПараметрыФункции["Bitrix24_HookFileID"];
    URL      = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПереименоватьФайл(URL, IDФайла2, Наименование2);

    Обработать(Результат, "Bitrix24", "ПереименоватьФайл", "Хук"); // SKIP

    IDФайла = ПараметрыФункции["Bitrix24_FileID"];
    URL     = ПараметрыФункции["Bitrix24_Domain"];
    Токен   = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПереименоватьФайл(URL, IDФайла, Наименование, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПереименоватьФайл");

КонецПроцедуры

Процедура Bitrix24_ПереместитьФайлВКаталог(ПараметрыФункции)

    IDКаталога = ПараметрыФункции["Bitrix24_HookSubFolderID"];
    IDФайла    = ПараметрыФункции["Bitrix24_FileID"];

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПереместитьФайлВКаталог(URL, IDФайла, IDКаталога);

    Обработать(Результат, "Bitrix24", "ПереместитьФайлВКаталог", "Хук"); // SKIP

    IDКаталога = ПараметрыФункции["Bitrix24_SubFolderID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПереместитьФайлВКаталог(URL, IDФайла, IDКаталога, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПереместитьФайлВКаталог");

КонецПроцедуры

Процедура Bitrix24_ДобавитьФайлВЗадачу(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDФайла  = ПараметрыФункции["Bitrix24_TaskFileID"];

    Результат = OPI_Bitrix24.ДобавитьФайлВЗадачу(URL, IDЗадачи, IDФайла);

    Обработать(Результат, "Bitrix24", "ДобавитьФайлВЗадачу", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ДобавитьФайлВЗадачу(URL, IDЗадачи, IDФайла, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьФайлВЗадачу");

КонецПроцедуры

Процедура Bitrix24_ПроверитьДоступКЗадаче(ПараметрыФункции)

    МассивПользователей = Новый Массив;
    МассивПользователей.Добавить("1");
    МассивПользователей.Добавить("10");

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ПроверитьДоступКЗадаче(URL, IDЗадачи, МассивПользователей);

    Обработать(Результат, "Bitrix24", "ПроверитьДоступКЗадаче", "Хук", МассивПользователей.Количество()); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ПроверитьДоступКЗадаче(URL, IDЗадачи, МассивПользователей, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПроверитьДоступКЗадаче", , МассивПользователей.Количество());

КонецПроцедуры

Процедура Bitrix24_ОтключитьЗвукЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ОтключитьЗвукЗадачи(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ОтключитьЗвукЗадачи", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ОтключитьЗвукЗадачи(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтключитьЗвукЗадачи");

КонецПроцедуры

Процедура Bitrix24_ВключитьЗвукЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ВключитьЗвукЗадачи(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ВключитьЗвукЗадачи", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ВключитьЗвукЗадачи(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ВключитьЗвукЗадачи");

КонецПроцедуры

Процедура Bitrix24_ДобавитьКомментарийЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_CommentsTaskID"];

    Текст = "Задача невыполнима, расходимся";

    Результат = OPI_Bitrix24.ДобавитьКомментарийЗадачи(URL, IDЗадачи, Текст);

    Обработать(Результат, "Bitrix24", "ДобавитьКомментарийЗадачи", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Текст = "Задача выполнима, не расходимся";

    Результат = OPI_Bitrix24.ДобавитьКомментарийЗадачи(URL, IDЗадачи, Текст, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьКомментарийЗадачи", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_УдалитьКомментарийЗадачи(ПараметрыФункции)

    URL           = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи      = ПараметрыФункции["Bitrix24_CommentsTaskID"];
    IDКомментария = ПараметрыФункции["Bitrix24_HookCommentID"];

    Результат = OPI_Bitrix24.УдалитьКомментарийЗадачи(URL, IDЗадачи, IDКомментария);

    Обработать(Результат, "Bitrix24", "УдалитьКомментарийЗадачи", "Хук"); // SKIP

    URL           = ПараметрыФункции["Bitrix24_Domain"];
    Токен         = ПараметрыФункции["Bitrix24_Token"];
    IDКомментария = ПараметрыФункции["Bitrix24_CommentID"];

    Результат = OPI_Bitrix24.УдалитьКомментарийЗадачи(URL, IDЗадачи, IDКомментария, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьКомментарийЗадачи");

КонецПроцедуры

Процедура Bitrix24_СоздатьРезультатИзКомментария(ПараметрыФункции)

    URL           = ПараметрыФункции["Bitrix24_URL"];
    IDКомментария = ПараметрыФункции["Bitrix24_HookCommentID"];

    Результат = OPI_Bitrix24.СоздатьРезультатИзКомментария(URL, IDКомментария);

    Обработать(Результат, "Bitrix24", "СоздатьРезультатИзКомментария", "Хук"); // SKIP

    URL           = ПараметрыФункции["Bitrix24_Domain"];
    Токен         = ПараметрыФункции["Bitrix24_Token"];
    IDКомментария = ПараметрыФункции["Bitrix24_CommentID"];

    Результат = OPI_Bitrix24.СоздатьРезультатИзКомментария(URL, IDКомментария, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьРезультатИзКомментария");

КонецПроцедуры

Процедура Bitrix24_УдалитьРезультатИзКомментария(ПараметрыФункции)

    URL           = ПараметрыФункции["Bitrix24_URL"];
    IDКомментария = ПараметрыФункции["Bitrix24_HookCommentID"];

    Результат = OPI_Bitrix24.УдалитьРезультатИзКомментария(URL, IDКомментария);

    Обработать(Результат, "Bitrix24", "УдалитьРезультатИзКомментария", "Хук"); // SKIP

    URL           = ПараметрыФункции["Bitrix24_Domain"];
    Токен         = ПараметрыФункции["Bitrix24_Token"];
    IDКомментария = ПараметрыФункции["Bitrix24_CommentID"];

    Результат = OPI_Bitrix24.УдалитьРезультатИзКомментария(URL, IDКомментария, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьРезультатИзКомментария");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокРезультатов(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_CommentsTaskID"];

    Результат = OPI_Bitrix24.ПолучитьСписокРезультатов(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокРезультатов", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСписокРезультатов(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокРезультатов");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокКомментариевЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_CommentsTaskID"];

    Результат = OPI_Bitrix24.ПолучитьСписокКомментариевЗадачи(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокКомментариевЗадачи", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСписокКомментариевЗадачи(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокКомментариевЗадачи");

КонецПроцедуры

Процедура Bitrix24_ПолучитьКомменатрийЗадачи(ПараметрыФункции)

    URL           = ПараметрыФункции["Bitrix24_URL"];
    IDКомментария = ПараметрыФункции["Bitrix24_HookCommentID"];
    IDЗадачи      = ПараметрыФункции["Bitrix24_CommentsTaskID"];

    Результат = OPI_Bitrix24.ПолучитьКомменатрийЗадачи(URL, IDЗадачи, IDКомментария);

    Обработать(Результат, "Bitrix24", "ПолучитьКомменатрийЗадачи", "Хук"); // SKIP

    URL           = ПараметрыФункции["Bitrix24_Domain"];
    Токен         = ПараметрыФункции["Bitrix24_Token"];
    IDКомментария = ПараметрыФункции["Bitrix24_CommentID"];

    Результат = OPI_Bitrix24.ПолучитьКомменатрийЗадачи(URL, IDЗадачи, IDКомментария, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьКомменатрийЗадачи");

КонецПроцедуры

Процедура Bitrix24_ИзменитьКомментарийЗадачи(ПараметрыФункции)

    URL           = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи      = ПараметрыФункции["Bitrix24_CommentsTaskID"];
    IDКомментария = ПараметрыФункции["Bitrix24_HookCommentID"];

    Текст = "Задача изменена, не расходимся";

    Результат = OPI_Bitrix24.ИзменитьКомментарийЗадачи(URL, IDЗадачи, IDКомментария, Текст);

    Обработать(Результат, "Bitrix24", "ИзменитьКомментарийЗадачи", "Хук"); // SKIP

    URL           = ПараметрыФункции["Bitrix24_Domain"];
    Токен         = ПараметрыФункции["Bitrix24_Token"];
    IDКомментария = ПараметрыФункции["Bitrix24_CommentID"];

    Текст = "Задача изменена, расходимся";

    Результат = OPI_Bitrix24.ИзменитьКомментарийЗадачи(URL, IDЗадачи, IDКомментария, Текст, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьКомментарийЗадачи");

КонецПроцедуры

Процедура Bitrix24_СоздатьЗависимостьЗадач(ПараметрыФункции)

    IDИсточника = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDПриемника = ПараметрыФункции["Bitrix24_TaskID"];
    ТипСвязи    = 0;

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьЗависимостьЗадач(URL, IDИсточника, IDПриемника, ТипСвязи);

    Обработать(Результат, "Bitrix24", "СоздатьЗависимостьЗадач", "Хук"); // SKIP

    OPI_Bitrix24.УдалитьЗависимостьЗадач(URL, IDИсточника, IDПриемника, ТипСвязи); // SKIP

    IDИсточника = ПараметрыФункции["Bitrix24_TaskID"];
    IDПриемника = ПараметрыФункции["Bitrix24_HookTaskID"];
    ТипСвязи    = 2;

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьЗависимостьЗадач(URL, IDИсточника, IDПриемника, ТипСвязи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьЗависимостьЗадач");

    OPI_Bitrix24.УдалитьЗависимостьЗадач(URL, IDИсточника, IDПриемника, ТипСвязи, Токен);

КонецПроцедуры

Процедура Bitrix24_УдалитьЗависимостьЗадач(ПараметрыФункции)

    IDИсточника = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDПриемника = ПараметрыФункции["Bitrix24_TaskID"];
    ТипСвязи    = 0;

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьЗависимостьЗадач(URL, IDИсточника, IDПриемника, ТипСвязи);     // SKIP
    Результат = OPI_Bitrix24.УдалитьЗависимостьЗадач(URL, IDИсточника, IDПриемника, ТипСвязи);

    Обработать(Результат, "Bitrix24", "УдалитьЗависимостьЗадач", "Хук"); // SKIP

    IDИсточника = ПараметрыФункции["Bitrix24_TaskID"];
    IDПриемника = ПараметрыФункции["Bitrix24_HookTaskID"];
    ТипСвязи    = 2;

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьЗависимостьЗадач(URL, IDИсточника, IDПриемника, ТипСвязи, Токен); // SKIP
    Результат = OPI_Bitrix24.УдалитьЗависимостьЗадач(URL, IDИсточника, IDПриемника, ТипСвязи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьЗависимостьЗадач");

КонецПроцедуры

Процедура Bitrix24_ДобавитьСтадиюКанбана(ПараметрыФункции)

    Наименование = "Новая стадия";
    Цвет         = "0026FF";

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ДобавитьСтадиюКанбана(URL, Наименование, Цвет, 6);

    Обработать(Результат, "Bitrix24", "ДобавитьСтадиюКанбана", "Хук", ПараметрыФункции); // SKIP

    Наименование = "Новая стадия 2";
    Цвет         = "0026FF";

    URL          = ПараметрыФункции["Bitrix24_Domain"];
    Токен        = ПараметрыФункции["Bitrix24_Token"];
    IDПредыдущей = Результат["result"];

    Результат = OPI_Bitrix24.ДобавитьСтадиюКанбана(URL, Наименование, Цвет, IDПредыдущей, , Истина, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьСтадиюКанбана", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_УдалитьСтадиюКанбана(ПараметрыФункции)

    IDСтадии = ПараметрыФункции["Bitrix24_HookStageID"];

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.УдалитьСтадиюКанбана(URL, IDСтадии, Истина);

    Обработать(Результат, "Bitrix24", "УдалитьСтадиюКанбана", "Хук"); // SKIP

    IDСтадии = ПараметрыФункции["Bitrix24_StageID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.УдалитьСтадиюКанбана(URL, IDСтадии, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьСтадиюКанбана");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтадииКанбана(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтадииКанбана(URL, , Истина);

    Обработать(Результат, "Bitrix24", "ПолучитьСтадииКанбана", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСтадииКанбана(URL, , , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтадииКанбана");

КонецПроцедуры

Процедура Bitrix24_ПеренестиЗадачуВСтадиюКанбана(ПараметрыФункции)

    IDЗадачи = ПараметрыФункции["Bitrix24_KanbanTaskID"];
    IDСтадии = ПараметрыФункции["Bitrix24_HookStageID"];

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПеренестиЗадачуВСтадиюКанбана(URL, IDЗадачи, IDСтадии);

    Обработать(Результат, "Bitrix24", "ПеренестиЗадачуВСтадиюКанбана", "Хук"); // SKIP

    IDСтадии = ПараметрыФункции["Bitrix24_StageID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПеренестиЗадачуВСтадиюКанбана(URL, IDЗадачи, IDСтадии, , , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПеренестиЗадачуВСтадиюКанбана");

    OPI_Bitrix24.ПеренестиЗадачуВСтадиюКанбана(URL, IDЗадачи, 2, , , Токен);

КонецПроцедуры

Процедура Bitrix24_ИзменитьСтадиюКанбана(ПараметрыФункции)

    Наименование = "Новое имя стадии стадии";
    Цвет         = "000000";
    IDСтадии     = ПараметрыФункции["Bitrix24_HookStageID"];

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ИзменитьСтадиюКанбана(URL, Наименование, IDСтадии, Цвет);

    Обработать(Результат, "Bitrix24", "ИзменитьСтадиюКанбана", "Хук"); // SKIP

    Наименование = "Новое имя стадии стадии 2";
    Цвет         = "000000";
    IDСтадии     = ПараметрыФункции["Bitrix24_StageID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ИзменитьСтадиюКанбана(URL, Наименование, IDСтадии, Цвет, 6, Истина, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьСтадиюКанбана");

КонецПроцедуры

Процедура Bitrix24_ДобавитьЭлементЧеклистаЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Текст = "Пункт чек-листа";

    Результат = OPI_Bitrix24.ДобавитьЭлементЧеклистаЗадачи(URL, IDЗадачи, Текст, Истина);

    Обработать(Результат, "Bitrix24", "ДобавитьЭлементЧеклистаЗадачи", "Хук", ПараметрыФункции); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ДобавитьЭлементЧеклистаЗадачи(URL, IDЗадачи, Текст, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьЭлементЧеклистаЗадачи", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьЭлементЧеклистаЗадачи(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи   = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_HookCheckElementID"];

    Текст = "Новый текст пункта чек-листа";

    Результат = OPI_Bitrix24.ИзменитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента, Текст);

    Обработать(Результат, "Bitrix24", "ИзменитьЭлементЧеклистаЗадачи", "Хук"); // SKIP

    URL        = ПараметрыФункции["Bitrix24_Domain"];
    Токен      = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи   = ПараметрыФункции["Bitrix24_TaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_CheckElementID"];

    Результат = OPI_Bitrix24.ИзменитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента, Текст, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьЭлементЧеклистаЗадачи");

КонецПроцедуры

Процедура Bitrix24_УдалитьЭлементЧеклистаЗадачи(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи   = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_HookCheckElementID"];

    Результат = OPI_Bitrix24.УдалитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента);

    Обработать(Результат, "Bitrix24", "УдалитьЭлементЧеклистаЗадачи", "Хук"); // SKIP

    IDЗадачи   = ПараметрыФункции["Bitrix24_TaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_CheckElementID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.УдалитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьЭлементЧеклистаЗадачи");

КонецПроцедуры

Процедура Bitrix24_ПолучитьЧеклистЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_HookTaskID"];

    Результат = OPI_Bitrix24.ПолучитьЧеклистЗадачи(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПолучитьЧеклистЗадачи", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗадачи = ПараметрыФункции["Bitrix24_TaskID"];

    Результат = OPI_Bitrix24.ПолучитьЧеклистЗадачи(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьЧеклистЗадачи");

КонецПроцедуры

Процедура Bitrix24_ПолучитьЭлементЧеклистаЗадачи(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи   = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_HookCheckElementID"];

    Результат = OPI_Bitrix24.ПолучитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента);

    Обработать(Результат, "Bitrix24", "ПолучитьЭлементЧеклистаЗадачи", "Хук"); // SKIP

    IDЗадачи   = ПараметрыФункции["Bitrix24_TaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_CheckElementID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьЭлементЧеклистаЗадачи");

КонецПроцедуры

Процедура Bitrix24_ВыполнитьЭлементЧеклистаЗадачи(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи   = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_HookCheckElementID"];

    Результат = OPI_Bitrix24.ВыполнитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента);

    Обработать(Результат, "Bitrix24", "ВыполнитьЭлементЧеклистаЗадачи", "Хук"); // SKIP

    IDЗадачи   = ПараметрыФункции["Bitrix24_TaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_CheckElementID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ВыполнитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ВыполнитьЭлементЧеклистаЗадачи");

КонецПроцедуры

Процедура Bitrix24_ВозобновитьЭлементЧеклистаЗадачи(ПараметрыФункции)

    URL        = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи   = ПараметрыФункции["Bitrix24_HookTaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_HookCheckElementID"];

    Результат = OPI_Bitrix24.ВозобновитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента);

    Обработать(Результат, "Bitrix24", "ВозобновитьЭлементЧеклистаЗадачи", "Хук"); // SKIP

    IDЗадачи   = ПараметрыФункции["Bitrix24_TaskID"];
    IDЭлемента = ПараметрыФункции["Bitrix24_CheckElementID"];

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ВозобновитьЭлементЧеклистаЗадачи(URL, IDЗадачи, IDЭлемента, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ВозобновитьЭлементЧеклистаЗадачи");

КонецПроцедуры

Процедура Bitrix24_ДобавитьТрудозатратыЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_ElapsedTaskID"];

    Время = 3600;

    Результат = OPI_Bitrix24.ДобавитьТрудозатратыЗадачи(URL, IDЗадачи, Время);

    Обработать(Результат, "Bitrix24", "ДобавитьТрудозатратыЗадачи", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Текст          = "Трудозатраты по обработке";
    IDПользователя = 10;
    Время          = 7200;
    ДатаУстановки  = ДобавитьМесяц(OPI_Инструменты.ПолучитьТекущуюДату(), -1);

    Результат = OPI_Bitrix24.ДобавитьТрудозатратыЗадачи(URL
        , IDЗадачи
        , Время
        , IDПользователя
        , Текст
        , ДатаУстановки
        , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьТрудозатратыЗадачи", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьТрудозатратыЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_ElapsedTaskID"];
    IDЗаписи = ПараметрыФункции["Bitrix24_HookTimeID"];

    Текст = "Забытый в прошлый раз текст";
    Время = 4800;

    Результат = OPI_Bitrix24.ИзменитьТрудозатратыЗадачи(URL, IDЗадачи, IDЗаписи, Время, Текст);

    Обработать(Результат, "Bitrix24", "ИзменитьТрудозатратыЗадачи", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗаписи = ПараметрыФункции["Bitrix24_TimeID"];

    Текст         = "Новые трудозатраты по обработке";
    Время         = 4800;
    ДатаУстановки = ДобавитьМесяц(OPI_Инструменты.ПолучитьТекущуюДату(), -1);

    Результат = OPI_Bitrix24.ИзменитьТрудозатратыЗадачи(URL, IDЗадачи, IDЗаписи, Время, Текст, ДатаУстановки, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьТрудозатратыЗадачи");

КонецПроцедуры

Процедура Bitrix24_УдалитьТрудозатратыЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_ElapsedTaskID"];
    IDЗаписи = ПараметрыФункции["Bitrix24_HookTimeID"];

    Результат = OPI_Bitrix24.УдалитьТрудозатратыЗадачи(URL, IDЗадачи, IDЗаписи);

    Обработать(Результат, "Bitrix24", "УдалитьТрудозатратыЗадачи", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗаписи = ПараметрыФункции["Bitrix24_TimeID"];

    Результат = OPI_Bitrix24.УдалитьТрудозатратыЗадачи(URL, IDЗадачи, IDЗаписи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьТрудозатратыЗадачи");

КонецПроцедуры

Процедура Bitrix24_ПолучитьТрудозатратыЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_ElapsedTaskID"];
    IDЗаписи = ПараметрыФункции["Bitrix24_HookTimeID"];

    Результат = OPI_Bitrix24.ПолучитьТрудозатратыЗадачи(URL, IDЗадачи, IDЗаписи);

    Обработать(Результат, "Bitrix24", "ПолучитьТрудозатратыЗадачи", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDЗаписи = ПараметрыФункции["Bitrix24_TimeID"];

    Результат = OPI_Bitrix24.ПолучитьТрудозатратыЗадачи(URL, IDЗадачи, IDЗаписи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьТрудозатратыЗадачи");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокТрудозатратЗадачи(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЗадачи = ПараметрыФункции["Bitrix24_ElapsedTaskID"];

    Результат = OPI_Bitrix24.ПолучитьСписокТрудозатратЗадачи(URL, IDЗадачи);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокТрудозатратЗадачи", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСписокТрудозатратЗадачи(URL, IDЗадачи, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокТрудозатратЗадачи");

КонецПроцедуры

Процедура Bitrix24_ПолучитьПланЗадачНаДень(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьПланЗадачНаДень(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьПланЗадачНаДень", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьПланЗадачНаДень(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьПланЗадачНаДень");

КонецПроцедуры

Процедура Bitrix24_СоздатьЧат(ПараметрыФункции)

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка);

    B64Картинка = ПолучитьBase64СтрокуИзДвоичныхДанных(Картинка);

    МассивУчастников = Новый Массив;
    МассивУчастников.Добавить(10);
    МассивУчастников.Добавить(1);

    СтруктураЧата = Новый Структура;
    СтруктураЧата.Вставить("TYPE"       , "OPEN");
    СтруктураЧата.Вставить("TITLE"      , "Новый чат");
    СтруктураЧата.Вставить("DESCRIPTION", "Это новый чат");
    СтруктураЧата.Вставить("COLOR"      , "GREEN");
    СтруктураЧата.Вставить("MESSAGE"    , "Добро пожаловать в новый чат");
    СтруктураЧата.Вставить("USERS"      , МассивУчастников);
    СтруктураЧата.Вставить("AVATAR"     , B64Картинка);
    СтруктураЧата.Вставить("OWNER_ID"   , 1);

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьЧат(URL, СтруктураЧата);

    Обработать(Результат, "Bitrix24", "СоздатьЧат", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    СтруктураЧата = Новый Структура;
    СтруктураЧата.Вставить("TYPE" , "CHAT");
    СтруктураЧата.Вставить("TITLE", "Закрытый чат");
    СтруктураЧата.Вставить("USERS", МассивУчастников);

    Результат = OPI_Bitrix24.СоздатьЧат(URL, СтруктураЧата, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьЧат", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокПользователейЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    Результат = OPI_Bitrix24.ПолучитьСписокПользователейЧата(URL, IDЧата);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокПользователейЧата", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Результат = OPI_Bitrix24.ПолучитьСписокПользователейЧата(URL, IDЧата, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокПользователейЧата");

КонецПроцедуры

Процедура Bitrix24_ПокинутьЧат(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    Результат = OPI_Bitrix24.ПокинутьЧат(URL, IDЧата);

    Обработать(Результат, "Bitrix24", "ПокинутьЧат", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Результат = OPI_Bitrix24.ПокинутьЧат(URL, IDЧата, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПокинутьЧат");

КонецПроцедуры

Процедура Bitrix24_ИсключитьПользователяИзЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    IDПользователя = 10;

    Результат = OPI_Bitrix24.ИсключитьПользователяИзЧата(URL, IDЧата, IDПользователя);

    Обработать(Результат, "Bitrix24", "ИсключитьПользователяИзЧата", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Результат = OPI_Bitrix24.ИсключитьПользователяИзЧата(URL, IDЧата, IDПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИсключитьПользователяИзЧата");

КонецПроцедуры

Процедура Bitrix24_ДобавитьПользователейВЧат(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    IDПользователей = Новый Массив;
    IDПользователей.Добавить(10);
    IDПользователей.Добавить(12);

    Результат = OPI_Bitrix24.ДобавитьПользователейВЧат(URL, IDЧата, IDПользователей);

    Обработать(Результат, "Bitrix24", "ДобавитьПользователейВЧат", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDЧата         = ПараметрыФункции["Bitrix24_ChatID"];
    IDПользователя = 10;

    Результат = OPI_Bitrix24.ДобавитьПользователейВЧат(URL, IDЧата, IDПользователя, Истина, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ДобавитьПользователейВЧат");

КонецПроцедуры

Процедура Bitrix24_ИзменитьЗаголовокЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    Заголовок = "Новый заголовок чата";

    Результат = OPI_Bitrix24.ИзменитьЗаголовокЧата(URL, IDЧата, Заголовок);

    Обработать(Результат, "Bitrix24", "ИзменитьЗаголовокЧата", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Заголовок = "Другой заголовок чата";

    Результат = OPI_Bitrix24.ИзменитьЗаголовокЧата(URL, IDЧата, Заголовок, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьЗаголовокЧата");

КонецПроцедуры

Процедура Bitrix24_ИзменитьЦветЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    Цвет = "AZURE";

    Результат = OPI_Bitrix24.ИзменитьЦветЧата(URL, IDЧата, Цвет);

    Обработать(Результат, "Bitrix24", "ИзменитьЦветЧата", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Цвет = "PURPLE";

    Результат = OPI_Bitrix24.ИзменитьЦветЧата(URL, IDЧата, Цвет, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьЦветЧата");

КонецПроцедуры

Процедура Bitrix24_ИзменитьКартинкуЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    Картинка = ПараметрыФункции["Picture2"];

    Результат = OPI_Bitrix24.ИзменитьКартинкуЧата(URL, IDЧата, Картинка);

    Обработать(Результат, "Bitrix24", "ИзменитьКартинкуЧата", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Результат = OPI_Bitrix24.ИзменитьКартинкуЧата(URL, IDЧата, Картинка, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьКартинкуЧата");

КонецПроцедуры

Процедура Bitrix24_ОтключитьУведомленияЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    Результат = OPI_Bitrix24.ОтключитьУведомленияЧата(URL, IDЧата);

    Обработать(Результат, "Bitrix24", "ОтключитьУведомленияЧата", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Результат = OPI_Bitrix24.ОтключитьУведомленияЧата(URL, IDЧата, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтключитьУведомленияЧата");

КонецПроцедуры

Процедура Bitrix24_ВключитьУведомленияЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    Результат = OPI_Bitrix24.ВключитьУведомленияЧата(URL, IDЧата);

    Обработать(Результат, "Bitrix24", "ВключитьУведомленияЧата", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Результат = OPI_Bitrix24.ВключитьУведомленияЧата(URL, IDЧата, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ВключитьУведомленияЧата");

КонецПроцедуры

Процедура Bitrix24_СменитьВладельцаЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    IDПользователя = 10;

    Результат = OPI_Bitrix24.СменитьВладельцаЧата(URL, IDЧата, IDПользователя);

    Обработать(Результат, "Bitrix24", "СменитьВладельцаЧата", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Результат = OPI_Bitrix24.СменитьВладельцаЧата(URL, IDЧата, IDПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СменитьВладельцаЧата");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокСообщенийЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = "chat4";

    Результат = OPI_Bitrix24.ПолучитьСписокСообщенийЧата(URL, IDЧата);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокСообщенийЧата", "Хук", ПараметрыФункции); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 10;

    Результат = OPI_Bitrix24.ПолучитьСписокСообщенийЧата(URL, IDПользователя, , 0, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокСообщенийЧата", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ОтметитьСообщениеКакПрочитанное(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЧата);
    СтрокаЧата = "chat" + IDЧата;

    IDСообщения = ПараметрыФункции["Bitrix24_ChatMessageID"];

    Результат = OPI_Bitrix24.ОтметитьСообщениеКакПрочитанное(URL, СтрокаЧата, IDСообщения);

    Обработать(Результат, "Bitrix24", "ОтметитьСообщениеКакПрочитанное", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 10;
    IDСообщения    = ПараметрыФункции["Bitrix24_UserMessageID"];

    Результат = OPI_Bitrix24.ОтметитьСообщениеКакПрочитанное(URL, IDПользователя, IDСообщения, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтметитьСообщениеКакПрочитанное");

КонецПроцедуры

Процедура Bitrix24_ОтметитьСообщениеКакНепрочитанное(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЧата);

    СтрокаЧата  = "chat" + IDЧата;
    IDСообщения = ПараметрыФункции["Bitrix24_ChatMessageID"];

    Результат = OPI_Bitrix24.ОтметитьСообщениеКакНепрочитанное(URL, СтрокаЧата, IDСообщения);

    Обработать(Результат, "Bitrix24", "ОтметитьСообщениеКакНепрочитанное", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 10;
    IDСообщения    = ПараметрыФункции["Bitrix24_UserMessageID"];

    Результат = OPI_Bitrix24.ОтметитьСообщениеКакНепрочитанное(URL, IDПользователя, IDСообщения, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтметитьСообщениеКакНепрочитанное");

КонецПроцедуры

Процедура Bitrix24_ПолучитьДиалог(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЧата);

    СтрокаЧата = "chat" + IDЧата;

    Результат = OPI_Bitrix24.ПолучитьДиалог(URL, СтрокаЧата);

    Обработать(Результат, "Bitrix24", "ПолучитьДиалог", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 10;

    Результат = OPI_Bitrix24.ПолучитьДиалог(URL, IDПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьДиалог");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокПользователейДиалога(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЧата);

    СтрокаЧата = "chat" + IDЧата;

    Результат = OPI_Bitrix24.ПолучитьСписокПользователейДиалога(URL, СтрокаЧата);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокПользователейДиалога", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 10;

    Результат = OPI_Bitrix24.ПолучитьСписокПользователейДиалога(URL, IDПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокПользователейДиалога");

КонецПроцедуры

Процедура Bitrix24_ОтправитьУведомлениеОВводе(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЧата);

    СтрокаЧата = "chat" + IDЧата;

    Результат = OPI_Bitrix24.ОтправитьУведомлениеОВводе(URL, СтрокаЧата);

    Обработать(Результат, "Bitrix24", "ОтправитьУведомлениеОВводе", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 10;

    Результат = OPI_Bitrix24.ОтправитьУведомлениеОВводе(URL, IDПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтправитьУведомлениеОВводе");

КонецПроцедуры

Процедура Bitrix24_ПрочитатьВсе(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПрочитатьВсе(URL);

    Обработать(Результат, "Bitrix24", "ПрочитатьВсе", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПрочитатьВсе(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПрочитатьВсе");

КонецПроцедуры

Процедура Bitrix24_ОтправитьСообщение(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    OPI_ПреобразованиеТипов.ПолучитьСтроку(IDЧата);

    СтрокаЧата = "chat" + IDЧата;
    Текст      = "Текст сообщения";
    Картинка   = "https://raw.githubusercontent.com/Bayselonarrend/OpenIntegrations/main/service/test_data/picture.jpg";
    Файл       = "https://github.com/Bayselonarrend/OpenIntegrations/raw/main/service/test_data/document.docx";

    Вложения = Новый Массив;
    Вложения.Добавить(OPI_Bitrix24.ПолучитьБлокКартинки("Картинка1", Картинка));
    Вложения.Добавить(OPI_Bitrix24.ПолучитьБлокФайла("Файл1.docx"  , Файл));

    Результат = OPI_Bitrix24.ОтправитьСообщение(URL, СтрокаЧата, Текст, Вложения);

    Обработать(Результат, "Bitrix24", "ОтправитьСообщение", "Хук", ПараметрыФункции); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 10;

    Результат = OPI_Bitrix24.ОтправитьСообщение(URL, IDПользователя, Текст, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтправитьСообщение", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьСообщение(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDСообщения = ПараметрыФункции["Bitrix24_ChatMessageID"];

    Текст = "Новый текст сообщения";

    Результат = OPI_Bitrix24.ИзменитьСообщение(URL, IDСообщения, Текст);

    Обработать(Результат, "Bitrix24", "ИзменитьСообщение", "Хук"); // SKIP

    URL         = ПараметрыФункции["Bitrix24_Domain"];
    Токен       = ПараметрыФункции["Bitrix24_Token"];
    IDСообщения = ПараметрыФункции["Bitrix24_UserMessageID"];

    Картинка = "https://raw.githubusercontent.com/Bayselonarrend/OpenIntegrations/main/service/test_data/picture.jpg";
    Файл     = "https://github.com/Bayselonarrend/OpenIntegrations/raw/main/service/test_data/document.docx";

    Вложения = Новый Массив;
    Вложения.Добавить(OPI_Bitrix24.ПолучитьБлокКартинки("Картинка1", Картинка));
    Вложения.Добавить(OPI_Bitrix24.ПолучитьБлокФайла("Файл1.docx"  , Файл));

    Результат = OPI_Bitrix24.ИзменитьСообщение(URL, IDСообщения, Текст, Вложения, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьСообщение");

КонецПроцедуры

Процедура Bitrix24_УдалитьСообщение(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDСообщения = ПараметрыФункции["Bitrix24_ChatMessageID"];

    Результат = OPI_Bitrix24.УдалитьСообщение(URL, IDСообщения);

    Обработать(Результат, "Bitrix24", "УдалитьСообщение", "Хук"); // SKIP

    URL         = ПараметрыФункции["Bitrix24_Domain"];
    Токен       = ПараметрыФункции["Bitrix24_Token"];
    IDСообщения = ПараметрыФункции["Bitrix24_UserMessageID"];

    Результат = OPI_Bitrix24.УдалитьСообщение(URL, IDСообщения, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьСообщение");

КонецПроцедуры

Процедура Bitrix24_УстановитьРеакциюНаСообщение(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDСообщения = ПараметрыФункции["Bitrix24_ChatMessageID"];

    Результат = OPI_Bitrix24.УстановитьРеакциюНаСообщение(URL, IDСообщения);

    Обработать(Результат, "Bitrix24", "УстановитьРеакциюНаСообщение", "Хук"); // SKIP

    URL         = ПараметрыФункции["Bitrix24_Domain"];
    Токен       = ПараметрыФункции["Bitrix24_Token"];
    IDСообщения = ПараметрыФункции["Bitrix24_UserMessageID"];

    Результат = OPI_Bitrix24.УстановитьРеакциюНаСообщение(URL, IDСообщения, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УстановитьРеакциюНаСообщение");

КонецПроцедуры

Процедура Bitrix24_ПолучитьКаталогФайловЧата(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЧата = ПараметрыФункции["Bitrix24_HookChatID"];

    Результат = OPI_Bitrix24.ПолучитьКаталогФайловЧата(URL, IDЧата);

    Обработать(Результат, "Bitrix24", "ПолучитьКаталогФайловЧата", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Результат = OPI_Bitrix24.ПолучитьКаталогФайловЧата(URL, IDЧата, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьКаталогФайловЧата");

КонецПроцедуры

Процедура Bitrix24_ОтправитьФайл(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDЧата   = ПараметрыФункции["Bitrix24_HookChatID"];
    Файл     = ПараметрыФункции["Document"]; // Двоичные данные, URL или путь к файлу
    Описание = "Очень важный файл";

    Каталог    = OPI_Bitrix24.ПолучитьКаталогФайловЧата(URL, IDЧата);
    IDКаталога = Каталог["result"]["ID"];

    ЗагруженныйФайл = OPI_Bitrix24.ЗагрузитьФайлВКаталог(URL, "Важный документ.docx", Файл, IDКаталога);
    IDФайла         = ЗагруженныйФайл["result"]["ID"];

    Результат = OPI_Bitrix24.ОтправитьФайл(URL, IDЧата, IDФайла, Описание);

    Обработать(Результат, "Bitrix24", "ОтправитьФайл", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЧата = ПараметрыФункции["Bitrix24_ChatID"];

    Каталог    = OPI_Bitrix24.ПолучитьКаталогФайловЧата(URL, IDЧата, Токен);
    IDКаталога = Каталог["result"]["ID"];

    ЗагруженныйФайл = OPI_Bitrix24.ЗагрузитьФайлВКаталог(URL, "Важный документ.docx", Файл, IDКаталога, Токен);
    IDФайла         = ЗагруженныйФайл["result"]["ID"];

    Результат = OPI_Bitrix24.ОтправитьФайл(URL, IDЧата, IDФайла, Описание, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ОтправитьФайл");

КонецПроцедуры

Процедура Bitrix24_ПолучитьПользователей(ПараметрыФункции)

    URL                 = ПараметрыФункции["Bitrix24_URL"];
    МассивПользователей = Новый Массив;

    МассивПользователей.Добавить(1);
    МассивПользователей.Добавить(10);

    Результат = OPI_Bitrix24.ПолучитьПользователей(URL, МассивПользователей);

    Обработать(Результат, "Bitrix24", "ПолучитьПользователей", "Хук"); // SKIP

    URL             = ПараметрыФункции["Bitrix24_Domain"];
    Токен           = ПараметрыФункции["Bitrix24_Token"];
    IDПользователей = 10;

    Результат = OPI_Bitrix24.ПолучитьПользователей(URL, IDПользователей, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьПользователей");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтатусПользователя(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтатусПользователя(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСтатусПользователя", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСтатусПользователя(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтатусПользователя");

КонецПроцедуры

Процедура Bitrix24_УстановитьСтатусПользователя(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    Статус = "dnd";

    Результат = OPI_Bitrix24.УстановитьСтатусПользователя(URL, Статус);

    Обработать(Результат, "Bitrix24", "УстановитьСтатусПользователя", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    Статус = "away";

    Результат = OPI_Bitrix24.УстановитьСтатусПользователя(URL, Статус, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УстановитьСтатусПользователя");

КонецПроцедуры

Процедура Bitrix24_СоздатьПерсональноеУведомление(ПараметрыФункции)

    IDПользователя = 1;

    URL      = ПараметрыФункции["Bitrix24_URL"];
    Текст    = "Текст сообщения";
    Картинка = "https://raw.githubusercontent.com/Bayselonarrend/OpenIntegrations/main/service/test_data/picture.jpg";
    Файл     = "https://github.com/Bayselonarrend/OpenIntegrations/raw/main/service/test_data/document.docx";

    Вложения = Новый Массив;
    Вложения.Добавить(OPI_Bitrix24.ПолучитьБлокКартинки("Картинка1", Картинка));
    Вложения.Добавить(OPI_Bitrix24.ПолучитьБлокФайла("Файл1.docx"  , Файл));

    Результат = OPI_Bitrix24.СоздатьПерсональноеУведомление(URL, IDПользователя, Текст, , Вложения);

    Обработать(Результат, "Bitrix24", "СоздатьПерсональноеУведомление", "Хук", ПараметрыФункции); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    Тег            = "Новый";
    IDПользователя = 10;

    Результат = OPI_Bitrix24.СоздатьПерсональноеУведомление(URL, IDПользователя, Текст, Тег, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьПерсональноеУведомление", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_СоздатьСистемноеУведомление(ПараметрыФункции)

    IDПользователя = 1;

    URL      = ПараметрыФункции["Bitrix24_URL"];
    Текст    = "Текст сообщения";
    Картинка = "https://raw.githubusercontent.com/Bayselonarrend/OpenIntegrations/main/service/test_data/picture.jpg";
    Файл     = "https://github.com/Bayselonarrend/OpenIntegrations/raw/main/service/test_data/document.docx";

    Вложения = Новый Массив;
    Вложения.Добавить(OPI_Bitrix24.ПолучитьБлокКартинки("Картинка1", Картинка));
    Вложения.Добавить(OPI_Bitrix24.ПолучитьБлокФайла("Файл1.docx"  , Файл));

    Результат = OPI_Bitrix24.СоздатьСистемноеУведомление(URL, IDПользователя, Текст, , Вложения);

    Обработать(Результат, "Bitrix24", "СоздатьСистемноеУведомление", "Хук", ПараметрыФункции); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    Тег            = "Новый";
    IDПользователя = 10;

    Результат = OPI_Bitrix24.СоздатьСистемноеУведомление(URL, IDПользователя, Текст, Тег, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьСистемноеУведомление", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_УдалитьУведомление(ПараметрыФункции)

    URL           = ПараметрыФункции["Bitrix24_URL"];
    IDУведомления = ПараметрыФункции["Bitrix24_PersoalHookNotifyID"];

    Результат = OPI_Bitrix24.УдалитьУведомление(URL, IDУведомления);

    Обработать(Результат, "Bitrix24", "УдалитьУведомление", "Хук"); // SKIP

    URL           = ПараметрыФункции["Bitrix24_Domain"];
    Токен         = ПараметрыФункции["Bitrix24_Token"];
    IDУведомления = ПараметрыФункции["Bitrix24_PersoalNotifyID"];

    Результат = OPI_Bitrix24.УдалитьУведомление(URL, IDУведомления, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьУведомление");

КонецПроцедуры

Процедура Bitrix24_ДобавитьПользовательскоеПолеЗадачи(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Тип = "date";
    Имя = "BIRTHDAY_FIELD";

    Результат = OPI_Bitrix24.ДобавитьПользовательскоеПолеЗадачи(URL, Тип, Имя);

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Тип        = "string";
    Имя        = "TEXT_FIELD";
    ВнешнийКод = "BITRIX_TEXT_FIELD";
    Заголовок  = "Поле для текста";
    Подпись    = Новый Структура("en,ru", "Some field", "Некоторое поле");

    Результат = OPI_Bitrix24.ДобавитьПользовательскоеПолеЗадачи(URL, Тип, Имя, ВнешнийКод, Заголовок, Подпись, Токен);

    // END

КонецПроцедуры

Процедура Bitrix24_ИзменитьПользовательскоеПолеЗадачи(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    IDПоля    = ПараметрыФункции["Bitrix24_HookTaskFieldID"];
    Заголовок = "Новый заголовок";

    Результат = OPI_Bitrix24.ИзменитьПользовательскоеПолеЗадачи(URL, IDПоля, , Заголовок);

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    IDПоля     = ПараметрыФункции["Bitrix24_TaskFieldID"];
    ВнешнийКод = "NEW_TEXT_FIELD";
    Подпись    = Новый Структура("en,ru", "Updated field", "Измененное поле");

    Результат = OPI_Bitrix24.ИзменитьПользовательскоеПолеЗадачи(URL, IDПоля, ВнешнийКод, , Подпись, Токен);

    // END

КонецПроцедуры

Процедура Bitrix24_ПолучитьПользовательскоеПолеЗадачи(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDПоля = ПараметрыФункции["Bitrix24_HookTaskFieldID"];

    Результат = OPI_Bitrix24.ПолучитьПользовательскоеПолеЗадачи(URL, IDПоля);

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDПоля = ПараметрыФункции["Bitrix24_TaskFieldID"];

    Результат = OPI_Bitrix24.ПолучитьПользовательскоеПолеЗадачи(URL, IDПоля, Токен);

    // END

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокПользовательскихПолейЗадачи(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСписокПользовательскихПолейЗадачи(URL);

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСписокПользовательскихПолейЗадачи(URL, Токен);

    // END

КонецПроцедуры

Процедура Bitrix24_УдалитьПользовательскоеПолеЗадачи(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDПоля = ПараметрыФункции["Bitrix24_HookTaskFieldID"];

    Результат = OPI_Bitrix24.УдалитьПользовательскоеПолеЗадачи(URL, IDПоля);

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDПоля = ПараметрыФункции["Bitrix24_TaskFieldID"];

    Результат = OPI_Bitrix24.УдалитьПользовательскоеПолеЗадачи(URL, IDПоля, Токен);

    // END

КонецПроцедуры

Процедура Bitrix24_СоздатьПодразделение(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Наименование = "Главное подразделение";
    IDРодителя   = 1;

    Результат = OPI_Bitrix24.СоздатьПодразделение(URL, Наименование, IDРодителя);

    Обработать(Результат, "Bitrix24", "СоздатьПодразделение", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Наименование   = "Подчиненное подразделение";
    IDРодителя     = ПараметрыФункции["Bitrix24_HookDepID"];
    IDРуководителя = 1;

    Результат = OPI_Bitrix24.СоздатьПодразделение(URL, Наименование, IDРодителя, IDРуководителя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьПодразделение", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьПодразделение(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    IDПодразделения = ПараметрыФункции["Bitrix24_HookDepID"];
    IDРодителя      = 7;

    Результат = OPI_Bitrix24.ИзменитьПодразделение(URL, IDПодразделения, , IDРодителя);

    Обработать(Результат, "Bitrix24", "ИзменитьПодразделение", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    IDПодразделения = ПараметрыФункции["Bitrix24_DepID"];
    Наименование    = "Новое подразделение";
    IDРодителя      = 1;
    IDРуководителя  = 10;

    Результат = OPI_Bitrix24.ИзменитьПодразделение(URL
        , IDПодразделения
        , Наименование
        , IDРодителя
        , IDРуководителя
        , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьПодразделение");

КонецПроцедуры

Процедура Bitrix24_УдалитьПодразделение(ПараметрыФункции)

    URL             = ПараметрыФункции["Bitrix24_URL"];
    IDПодразделения = ПараметрыФункции["Bitrix24_DepID"];

    Результат = OPI_Bitrix24.УдалитьПодразделение(URL, IDПодразделения);

    Обработать(Результат, "Bitrix24", "УдалитьПодразделение", "Хук"); // SKIP

    URL             = ПараметрыФункции["Bitrix24_Domain"];
    Токен           = ПараметрыФункции["Bitrix24_Token"];
    IDПодразделения = ПараметрыФункции["Bitrix24_HookDepID"];

    Результат = OPI_Bitrix24.УдалитьПодразделение(URL, IDПодразделения, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьПодразделение");

КонецПроцедуры

Процедура Bitrix24_ПолучитьПодразделения(ПараметрыФункции)

    URL             = ПараметрыФункции["Bitrix24_URL"];
    IDПодразделения = ПараметрыФункции["Bitrix24_DepID"];

    Результат = OPI_Bitrix24.ПолучитьПодразделения(URL, IDПодразделения);

    Обработать(Результат, "Bitrix24", "ПолучитьПодразделения", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDРуководителя = 1;

    Результат = OPI_Bitrix24.ПолучитьПодразделения(URL, , , , IDРуководителя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьПодразделения");

КонецПроцедуры

Процедура Bitrix24_ПолучитьТекущегоПользователя(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьТекущегоПользователя(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьТекущегоПользователя", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьТекущегоПользователя(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьТекущегоПользователя");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтурктуруПользователя(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтурктуруПользователя(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСтурктуруПользователя", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСтурктуруПользователя(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтурктуруПользователя");

КонецПроцедуры

Процедура Bitrix24_СоздатьПользователя(ПараметрыФункции)

    URL   = ПараметрыФункции["Bitrix24_URL"];
    Почта = Строка(Новый УникальныйИдентификатор) + "@exepmple.org";

    // Полную структуру можно получить функцией ПолучитьСтурктуруПользователя

    СтруктураПользователя = Новый Структура;
    СтруктураПользователя.Вставить("EMAIL"        , Почта);
    СтруктураПользователя.Вставить("UF_DEPARTMENT", 7);

    Результат = OPI_Bitrix24.СоздатьПользователя(URL, СтруктураПользователя);

    Обработать(Результат, "Bitrix24", "СоздатьПользователя", "Хук", ПараметрыФункции); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];
    Почта = Строка(Новый УникальныйИдентификатор) + "@exepmple.org";

    СтруктураПользователя = Новый Структура;
    СтруктураПользователя.Вставить("EMAIL"          , Почта);
    СтруктураПользователя.Вставить("NAME"           , "Виталий");
    СтруктураПользователя.Вставить("LAST_NAME"      , "Альпака");
    СтруктураПользователя.Вставить("PERSONAL_MOBILE", "88003553535");
    СтруктураПользователя.Вставить("UF_DEPARTMENT"  , 1);

    Результат = OPI_Bitrix24.СоздатьПользователя(URL, СтруктураПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьПользователя", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьПользователя(ПараметрыФункции)

    URL            = ПараметрыФункции["Bitrix24_URL"];
    IDПользователя = ПараметрыФункции["Bitrix24_HookUserID"];
    Почта          = Строка(Новый УникальныйИдентификатор) + "@exepmple.org";

    // Полную структуру можно получить функцией ПолучитьСтурктуруПользователя

    СтруктураПользователя = Новый Структура;
    СтруктураПользователя.Вставить("EMAIL"        , Почта);
    СтруктураПользователя.Вставить("UF_DEPARTMENT", 1);

    Результат = OPI_Bitrix24.ИзменитьПользователя(URL, IDПользователя, СтруктураПользователя);

    Обработать(Результат, "Bitrix24", "ИзменитьПользователя", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = ПараметрыФункции["Bitrix24_UserID"];
    Почта          = Строка(Новый УникальныйИдентификатор) + "@exepmple.org";

    СтруктураПользователя = Новый Структура;
    СтруктураПользователя.Вставить("EMAIL"        , Почта);
    СтруктураПользователя.Вставить("NAME"         , "Олег");
    СтруктураПользователя.Вставить("LAST_NAME"    , "Лама");
    СтруктураПользователя.Вставить("UF_DEPARTMENT", 7);

    Результат = OPI_Bitrix24.ИзменитьПользователя(URL, IDПользователя, СтруктураПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьПользователя");

КонецПроцедуры

Процедура Bitrix24_ИзменитьСтатусПользователя(ПараметрыФункции)

    URL            = ПараметрыФункции["Bitrix24_URL"];
    IDПользователя = ПараметрыФункции["Bitrix24_HookUserID"];

    Результат = OPI_Bitrix24.ИзменитьСтатусПользователя(URL, IDПользователя, Истина);

    Обработать(Результат, "Bitrix24", "ИзменитьСтатусПользователя", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = ПараметрыФункции["Bitrix24_UserID"];

    Результат = OPI_Bitrix24.ИзменитьСтатусПользователя(URL, IDПользователя, Истина, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьСтатусПользователя");

КонецПроцедуры

Процедура Bitrix24_ПолучитьПользователя(ПараметрыФункции)

    URL            = ПараметрыФункции["Bitrix24_URL"];
    IDПользователя = ПараметрыФункции["Bitrix24_HookUserID"];

    Результат = OPI_Bitrix24.ПолучитьПользователя(URL, IDПользователя);

    Обработать(Результат, "Bitrix24", "ПолучитьПользователя", "Хук"); // SKIP

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = ПараметрыФункции["Bitrix24_UserID"];

    Результат = OPI_Bitrix24.ПолучитьПользователя(URL, IDПользователя, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьПользователя");

КонецПроцедуры

Процедура Bitrix24_НайтиПользователей(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    СтруктураФильтра = Новый Структура;
    СтруктураФильтра.Вставить("NAME"              , "Виталий");
    СтруктураФильтра.Вставить("LAST_NAME"         , "Альпака");
    СтруктураФильтра.Вставить("WORK_POSITION"     , "DevOps инженер");
    СтруктураФильтра.Вставить("UF_DEPARTMENT_NAME", "Отдел маркетинга");
    СтруктураФильтра.Вставить("USER_TYPE"         , "employee");

    Результат = OPI_Bitrix24.НайтиПользователей(URL, СтруктураФильтра);

    Обработать(Результат, "Bitrix24", "НайтиПользователей", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    СтруктураФильтра = Новый Структура;
    СтруктураФильтра.Вставить("UF_DEPARTMENT_NAME", "Битрикс");

    Результат = OPI_Bitrix24.НайтиПользователей(URL, СтруктураФильтра, Токен);

    // END

    Обработать(Результат, "Bitrix24", "НайтиПользователей");

КонецПроцедуры

Процедура Bitrix24_НачатьУчетВремени(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.НачатьУчетВремени(URL);

    Час = 3600;

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 1;
    Время          = OPI_Инструменты.ПолучитьТекущуюДату() - Час;
    Отчет          = "Опоздание";

    Результат = OPI_Bitrix24.НачатьУчетВремени(URL, IDПользователя, Время, Отчет, Токен);

    // END

КонецПроцедуры

Процедура Bitrix24_ЗавершитьУчетВремени(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ЗавершитьУчетВремени(URL);

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 1;
    Время          = OPI_Инструменты.ПолучитьТекущуюДату();
    Отчет          = "Отгул";

    Результат = OPI_Bitrix24.ЗавершитьУчетВремени(URL, IDПользователя, Время, Отчет, Токен);

КонецПроцедуры

Процедура Bitrix24_ПриостановитьУчетВремени(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПриостановитьУчетВремени(URL);

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 1;

    Результат = OPI_Bitrix24.ПриостановитьУчетВремени(URL, IDПользователя, Токен);

    // END

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтатусУчетаВремени(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтатусУчетаВремени(URL);

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 1;

    Результат = OPI_Bitrix24.ПолучитьСтатусУчетаВремени(URL, IDПользователя, Токен);

КонецПроцедуры

Процедура Bitrix24_ПолучитьНастройкиУчетаВремени(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьНастройкиУчетаВремени(URL);

    URL            = ПараметрыФункции["Bitrix24_Domain"];
    Токен          = ПараметрыФункции["Bitrix24_Token"];
    IDПользователя = 1;

    Результат = OPI_Bitrix24.ПолучитьНастройкиУчетаВремени(URL, IDПользователя, Токен);

    // END

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруФильтраЛидов(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_Bitrix24.ПолучитьСтруктуруФильтраЛидов(Пустая);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруФильтраЛидов");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруЛида(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруЛида(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруЛида", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруЛида(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруЛида");

КонецПроцедуры

Процедура Bitrix24_СоздатьЛид(ПараметрыФункции)

    МассивПочт = Новый Массив;
    МассивПочт.Добавить(Новый Структура("VALUE,VALUE_TYPE", "yo@example.com", "HOME"));
    МассивПочт.Добавить(Новый Структура("VALUE,VALUE_TYPE", "hi@example.com", "WORK"));

    МассивНомеров = Новый Массив;
    МассивНомеров.Добавить(Новый Структура("VALUE,VALUE_TYPE", "88005553535", "WORK"));

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("ADDRESS"        , "ул. Пушкина, д. 10");
    СтруктураПолей.Вставить("ADDRESS_COUNTRY", "Россия");
    СтруктураПолей.Вставить("EMAIL"          , МассивПочт);
    СтруктураПолей.Вставить("NAME"           , "Петр");
    СтруктураПолей.Вставить("LAST_NAME"      , "Петров");
    СтруктураПолей.Вставить("PHONE"          , МассивНомеров);
    СтруктураПолей.Вставить("TITLE"          , "Мегаклиент");

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьЛид(URL, СтруктураПолей);

    Обработать(Результат, "Bitrix24", "СоздатьЛид", "Хук", ПараметрыФункции); // SKIP

    СтруктураПолей.Вставить("NAME"     , "Иван");
    СтруктураПолей.Вставить("LAST_NAME", "Иванов");

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьЛид(URL, СтруктураПолей, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьЛид", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьЛид(ПараметрыФункции)

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("ADDRESS"        , "ул. Лермонтова, д. 20");
    СтруктураПолей.Вставить("ADDRESS_COUNTRY", "Беларусь");
    СтруктураПолей.Вставить("TITLE"          , "Суперклиент");

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЛида = ПараметрыФункции["Bitrix24_HookLeadID"];

    Результат = OPI_Bitrix24.ИзменитьЛид(URL, IDЛида, СтруктураПолей);

    Обработать(Результат, "Bitrix24", "ИзменитьЛид", "Хук"); // SKIP

    СтруктураПолей.Вставить("NAME"     , "Евгений");
    СтруктураПолей.Вставить("LAST_NAME", "Евгеньев");

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЛида = ПараметрыФункции["Bitrix24_LeadID"];

    Результат = OPI_Bitrix24.ИзменитьЛид(URL, IDЛида, СтруктураПолей, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьЛид");

КонецПроцедуры

Процедура Bitrix24_УдалитьЛид(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЛида = ПараметрыФункции["Bitrix24_HookLeadID"];

    Результат = OPI_Bitrix24.УдалитьЛид(URL, IDЛида);

    Обработать(Результат, "Bitrix24", "УдалитьЛид", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЛида = ПараметрыФункции["Bitrix24_LeadID"];

    Результат = OPI_Bitrix24.УдалитьЛид(URL, IDЛида, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьЛид");

КонецПроцедуры

Процедура Bitrix24_ПолучитьЛид(ПараметрыФункции)

    URL    = ПараметрыФункции["Bitrix24_URL"];
    IDЛида = ПараметрыФункции["Bitrix24_HookLeadID"];

    Результат = OPI_Bitrix24.ПолучитьЛид(URL, IDЛида);

    Обработать(Результат, "Bitrix24", "ПолучитьЛид", "Хук"); // SKIP

    URL    = ПараметрыФункции["Bitrix24_Domain"];
    Токен  = ПараметрыФункции["Bitrix24_Token"];
    IDЛида = ПараметрыФункции["Bitrix24_LeadID"];

    Результат = OPI_Bitrix24.ПолучитьЛид(URL, IDЛида, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьЛид");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокЛидов(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСписокЛидов(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокЛидов", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Фильтр = Новый Структура;
    Фильтр.Вставить("TITLE"    , "Мегаклиент");
    Фильтр.Вставить("HAS_EMAIL", "Y");

    Результат = OPI_Bitrix24.ПолучитьСписокЛидов(URL, Фильтр, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокЛидов");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруФильтраСделок(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_Bitrix24.ПолучитьСтруктуруФильтраСделок(Пустая);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруФильтраСделок");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруСделки(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруСделки(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруСделки", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруСделки(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруСделки");

КонецПроцедуры

Процедура Bitrix24_СоздатьСделку(ПараметрыФункции)

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("TITLE"         , "Плановая продажа");
    СтруктураПолей.Вставить("TYPE_ID"       , "GOODS");
    СтруктураПолей.Вставить("STAGE_ID"      , "NEW");
    СтруктураПолей.Вставить("COMPANY_ID"    , 1);
    СтруктураПолей.Вставить("CONTACT_ID"    , 3);
    СтруктураПолей.Вставить("OPENED"        , "Y");
    СтруктураПолей.Вставить("ASSIGNED_BY_ID", 1);
    СтруктураПолей.Вставить("PROBABILITY"   , 30);
    СтруктураПолей.Вставить("CURRENCY_ID"   , "USD");
    СтруктураПолей.Вставить("OPPORTUNITY"   , 5000);
    СтруктураПолей.Вставить("CATEGORY_ID"   , 5);
    СтруктураПолей.Вставить("BEGINDATE"     , "2024-01-01");
    СтруктураПолей.Вставить("CLOSEDATE"     , "2030-01-01");

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьСделку(URL, СтруктураПолей);

    Обработать(Результат, "Bitrix24", "СоздатьСделку", "Хук", ПараметрыФункции); // SKIP

    СтруктураПолей.Вставить("TITLE"    , "Другая сделка");
    СтруктураПолей.Вставить("CLOSEDATE", "2031-01-01");

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьСделку(URL, СтруктураПолей, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьСделку", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьСделку(ПараметрыФункции)

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("TITLE"      , "Продажа в RUB");
    СтруктураПолей.Вставить("CURRENCY_ID", "RUB");
    СтруктураПолей.Вставить("OPPORTUNITY", 50000);

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDСделки = ПараметрыФункции["Bitrix24_HookDealID"];

    Результат = OPI_Bitrix24.ИзменитьСделку(URL, IDСделки, СтруктураПолей);

    Обработать(Результат, "Bitrix24", "ИзменитьСделку", "Хук"); // SKIP

    СтруктураПолей.Вставить("TITLE"    , "Будущая сделка в RUB");
    СтруктураПолей.Вставить("BEGINDATE", "2025-01-01");

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDСделки = ПараметрыФункции["Bitrix24_DealID"];

    Результат = OPI_Bitrix24.ИзменитьСделку(URL, IDСделки, СтруктураПолей, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьСделку");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСделку(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDСделки = ПараметрыФункции["Bitrix24_HookDealID"];

    Результат = OPI_Bitrix24.ПолучитьСделку(URL, IDСделки);

    Обработать(Результат, "Bitrix24", "ПолучитьСделку", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDСделки = ПараметрыФункции["Bitrix24_HookDealID"];

    Результат = OPI_Bitrix24.ПолучитьСделку(URL, IDСделки, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСделку");

КонецПроцедуры

Процедура Bitrix24_УдалитьСделку(ПараметрыФункции)

    URL      = ПараметрыФункции["Bitrix24_URL"];
    IDСделки = ПараметрыФункции["Bitrix24_HookDealID"];

    Результат = OPI_Bitrix24.УдалитьСделку(URL, IDСделки);

    Обработать(Результат, "Bitrix24", "УдалитьСделку", "Хук"); // SKIP

    URL      = ПараметрыФункции["Bitrix24_Domain"];
    Токен    = ПараметрыФункции["Bitrix24_Token"];
    IDСделки = ПараметрыФункции["Bitrix24_DealID"];

    Результат = OPI_Bitrix24.УдалитьСделку(URL, IDСделки, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьСделку");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокСделок(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСписокСделок(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокСделок", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Фильтр = Новый Структура;
    Фильтр.Вставить("TITLE"      , "Продажа в RUB");
    Фильтр.Вставить("CURRENCY_ID", "RUB");

    Результат = OPI_Bitrix24.ПолучитьСписокСделок(URL, Фильтр, , Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокСделок");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруФильтраЗадач(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_Bitrix24.ПолучитьСтруктуруФильтраЗадач(Пустая);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруФильтраЗадач");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруКомментария(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_Bitrix24.ПолучитьСтруктуруКомментария(Пустая);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруКомментария");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруЧата(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_Bitrix24.ПолучитьСтруктуруЧата(Пустая);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруЧата");

КонецПроцедуры

Процедура Bitrix24_ПолучитьБлокКартинки(ПараметрыФункции)

    Наименование = "Картинка";
    URL          = ПараметрыФункции["Picture"];

    Результат = OPI_Bitrix24.ПолучитьБлокКартинки(Наименование, URL);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьБлокКартинки");

КонецПроцедуры

Процедура Bitrix24_ПолучитьБлокФайла(ПараметрыФункции)

    Наименование = "Картинка";
    URL          = ПараметрыФункции["Document"];

    Результат = OPI_Bitrix24.ПолучитьБлокФайла(Наименование, URL);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьБлокФайла");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруФильтраПользователей(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_Bitrix24.ПолучитьСтруктуруФильтраПользователей(Пустая);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруФильтраПользователей");

КонецПроцедуры

Процедура Bitrix24_СоздатьКалендарь(ПараметрыФункции)

    IDПользователя = 1;

    СтруктураКалендаря = Новый Структура;
    СтруктураКалендаря.Вставить("type"       , "user");
    СтруктураКалендаря.Вставить("ownerId"    , IDПользователя);
    СтруктураКалендаря.Вставить("name"       , "Новый календарь");
    СтруктураКалендаря.Вставить("description", "Мой новый календарь");
    СтруктураКалендаря.Вставить("color"      , "#FFFFFF");
    СтруктураКалендаря.Вставить("text_color" , "#000000");

    СтруктураЭкспорта = Новый Структура;
    СтруктураЭкспорта.Вставить("ALLOW", "Истина");
    СтруктураЭкспорта.Вставить("SET"  , "all");

    СтруктураКалендаря.Вставить("export", СтруктураЭкспорта);

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.СоздатьКалендарь(URL, СтруктураКалендаря);

    Обработать(Результат, "Bitrix24", "СоздатьКалендарь", "Хук", ПараметрыФункции); // SKIP

    СтруктураКалендаря.Вставить("name"       , "Другой календарь");
    СтруктураКалендаря.Вставить("description", "Мой другой новый календарь");

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.СоздатьКалендарь(URL, СтруктураКалендаря, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьКалендарь", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьКалендарь(ПараметрыФункции)

    IDПользователя = 1;

    СтруктураКалендаря = Новый Структура;
    СтруктураКалендаря.Вставить("type"       , "user");
    СтруктураКалендаря.Вставить("ownerId"    , IDПользователя);
    СтруктураКалендаря.Вставить("name"       , "Новое имя календаря");
    СтруктураКалендаря.Вставить("description", "Этот календарь был изменен");

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDКалендаря = ПараметрыФункции["Bitrix24_HookCalendarID"];

    Результат = OPI_Bitrix24.ИзменитьКалендарь(URL, IDКалендаря, СтруктураКалендаря);

    Обработать(Результат, "Bitrix24", "ИзменитьКалендарь", "Хук"); // SKIP

    URL         = ПараметрыФункции["Bitrix24_Domain"];
    Токен       = ПараметрыФункции["Bitrix24_Token"];
    IDКалендаря = ПараметрыФункции["Bitrix24_CalendarID"];

    Результат = OPI_Bitrix24.ИзменитьКалендарь(URL, IDКалендаря, СтруктураКалендаря, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьКалендарь");

КонецПроцедуры

Процедура Bitrix24_УдалитьКалендарь(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDКалендаря = ПараметрыФункции["Bitrix24_HookCalendarID"];
    IDВладельца = 1;
    Тип         = "user";

    Результат = OPI_Bitrix24.УдалитьКалендарь(URL, IDКалендаря, IDВладельца, Тип);

    Обработать(Результат, "Bitrix24", "УдалитьКалендарь", "Хук"); // SKIP

    URL         = ПараметрыФункции["Bitrix24_Domain"];
    Токен       = ПараметрыФункции["Bitrix24_Token"];
    IDКалендаря = ПараметрыФункции["Bitrix24_CalendarID"];

    Результат = OPI_Bitrix24.УдалитьКалендарь(URL, IDКалендаря, IDВладельца, Тип, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьКалендарь");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруКалендаря(ПараметрыФункции)

    Результат = OPI_Bitrix24.ПолучитьСтруктуруКалендаря();

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруКалендаря");

    Результат = OPI_Bitrix24.ПолучитьСтруктуруКалендаря(Истина);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруКалендаря", "Пустая");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСписокКалендарей(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDВладельца = 1;
    Тип         = "user";

    Результат = OPI_Bitrix24.ПолучитьСписокКалендарей(URL, IDВладельца, Тип);

    Обработать(Результат, "Bitrix24", "ПолучитьСписокКалендарей", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСписокКалендарей(URL, IDВладельца, Тип, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСписокКалендарей");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруНастроекКалендаря(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруНастроекКалендаря(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруНастроекКалендаря", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьСтруктуруНастроекКалендаря(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруНастроекКалендаря");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруПользовательскихНастроекКаледнаря(ПараметрыФункции)

    Результат = OPI_Bitrix24.ПолучитьСтруктуруПользовательскихНастроекКаледнаря();

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруПользовательскихНастроекКаледнаря");

    Результат = OPI_Bitrix24.ПолучитьСтруктуруПользовательскихНастроекКаледнаря(Истина);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруПользовательскихНастроекКаледнаря", "Пустая");

КонецПроцедуры

Процедура Bitrix24_ПолучитьПользовательскиеНастройкиКалендаря(ПараметрыФункции)

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.ПолучитьПользовательскиеНастройкиКалендаря(URL);

    Обработать(Результат, "Bitrix24", "ПолучитьПользовательскиеНастройкиКалендаря", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.ПолучитьПользовательскиеНастройкиКалендаря(URL, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьПользовательскиеНастройкиКалендаря");

КонецПроцедуры

Процедура Bitrix24_УстановитьПользовательскиеНастройкиКалендаря(ПараметрыФункции)

    СтруктураКалендаря = Новый Структура;
    СтруктураКалендаря.Вставить("view"              , "month");
    СтруктураКалендаря.Вставить("showDeclined"      , "Y");
    СтруктураКалендаря.Вставить("collapseOffHours"  , "N");
    СтруктураКалендаря.Вставить("showCompletedTasks", "N");

    URL = ПараметрыФункции["Bitrix24_URL"];

    Результат = OPI_Bitrix24.УстановитьПользовательскиеНастройкиКалендаря(URL, СтруктураКалендаря);

    Обработать(Результат, "Bitrix24", "УстановитьПользовательскиеНастройкиКалендаря", "Хук"); // SKIP

    URL   = ПараметрыФункции["Bitrix24_Domain"];
    Токен = ПараметрыФункции["Bitrix24_Token"];

    Результат = OPI_Bitrix24.УстановитьПользовательскиеНастройкиКалендаря(URL, СтруктураКалендаря, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УстановитьПользовательскиеНастройкиКалендаря");

КонецПроцедуры

Процедура Bitrix24_ПолучитьЗанятостьПользователей(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDКалендаря = ПараметрыФункции["Bitrix24_HookCalendarID"];

    Пользователь = 1;

    Неделя      = 604800;
    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();

    ДатаНачала    = ТекущаяДата;
    ДатаОкончания = ТекущаяДата + Неделя;

    Результат = OPI_Bitrix24.ПолучитьЗанятостьПользователей(URL, Пользователь, ДатаНачала, ДатаОкончания);

    Обработать(Результат, "Bitrix24", "ПолучитьЗанятостьПользователей", "Хук"); // SKIP

    URL         = ПараметрыФункции["Bitrix24_Domain"];
    Токен       = ПараметрыФункции["Bitrix24_Token"];
    IDКалендаря = ПараметрыФункции["Bitrix24_CalendarID"];

    Результат = OPI_Bitrix24.ПолучитьЗанятостьПользователей(URL, Пользователь, ДатаНачала, ДатаОкончания, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьЗанятостьПользователей");

КонецПроцедуры

Процедура Bitrix24_СоздатьСобытиеКалендаря(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDКалендаря = ПараметрыФункции["Bitrix24_HookCalendarID"];

    Завтра = OPI_Инструменты.ПолучитьТекущуюДату() + 86400;
    Час    = 3600;

    СтруктураСобытия = Новый Структура;

    СтруктураСобытия.Вставить("type"         , "user");
    СтруктураСобытия.Вставить("ownerId"      , 1);
    СтруктураСобытия.Вставить("from"         , XMLСтрока(Завтра));
    СтруктураСобытия.Вставить("to"           , XMLСтрока(Завтра + Час));
    СтруктураСобытия.Вставить("section"      , IDКалендаря);
    СтруктураСобытия.Вставить("name"         , "Новое событие");
    СтруктураСобытия.Вставить("skip_time"    , "N");
    СтруктураСобытия.Вставить("timezone_from", "Europe/Minsk");
    СтруктураСобытия.Вставить("timezone_to"  , "Europe/Minsk");
    СтруктураСобытия.Вставить("description"  , "Описание события");
    СтруктураСобытия.Вставить("color"        , "%23000000>");
    СтруктураСобытия.Вставить("text_color"   , "%23FFFFFF");
    СтруктураСобытия.Вставить("accessibility", "quest");
    СтруктураСобытия.Вставить("importance"   , "normal");
    СтруктураСобытия.Вставить("private_event", "Y");

    СтруктураПовторяемости = Новый Структура;
    СтруктураПовторяемости.Вставить("FREQ"    , "DAILY");
    СтруктураПовторяемости.Вставить("COUNT"   , 3);
    СтруктураПовторяемости.Вставить("INTERVAL", 10);

    МассивДней = Новый Массив;
    МассивДней.Добавить("SA");
    МассивДней.Добавить("MO");

    СтруктураПовторяемости.Вставить("BYDAY", МассивДней);
    СтруктураПовторяемости.Вставить("UNTIL", XMLСтрока(Завтра + Час * 24 * 10));

    СтруктураСобытия.Вставить("rrule"     , СтруктураПовторяемости);
    СтруктураСобытия.Вставить("is_meeting", "Y");
    СтруктураСобытия.Вставить("location"  , "Офис");

    МассивНапоминаний = Новый Массив;

    СтруктураНапоминания = Новый Структура;
    СтруктураНапоминания.Вставить("type" , "day");
    СтруктураНапоминания.Вставить("count", 1);

    МассивНапоминаний.Добавить(СтруктураНапоминания);

    СтруктураСобытия.Вставить("remind"   , МассивНапоминаний);
    СтруктураСобытия.Вставить("attendees", СтрРазделить("1,10", ","));
    СтруктураСобытия.Вставить("host"     , 1);

    СтруктураВстречи = Новый Структура;
    СтруктураВстречи.Вставить("notify"      , "Y");
    СтруктураВстречи.Вставить("reinvite"    , "Y");
    СтруктураВстречи.Вставить("allow_invite", "N");
    СтруктураВстречи.Вставить("hide_guests" , "N");

    СтруктураСобытия.Вставить("meeting", СтруктураВстречи);

    Результат = OPI_Bitrix24.СоздатьСобытиеКалендаря(URL, СтруктураСобытия);

    Обработать(Результат, "Bitrix24", "СоздатьСобытиеКалендаря", "Хук", ПараметрыФункции); // SKIP

    URL         = ПараметрыФункции["Bitrix24_Domain"];
    Токен       = ПараметрыФункции["Bitrix24_Token"];
    IDКалендаря = ПараметрыФункции["Bitrix24_CalendarID"];

    СтруктураСобытия.Вставить("section", IDКалендаря);

    Результат = OPI_Bitrix24.СоздатьСобытиеКалендаря(URL, СтруктураСобытия, Токен);

    // END

    Обработать(Результат, "Bitrix24", "СоздатьСобытиеКалендаря", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_ИзменитьСобытиеКалендаря(ПараметрыФункции)

    URL       = ПараметрыФункции["Bitrix24_URL"];
    IDСобытия = ПараметрыФункции["Bitrix24_HookCEventID"];

    СтруктураСобытия = Новый Структура;

    СтруктураСобытия.Вставить("ownerId"      , 1);
    СтруктураСобытия.Вставить("type"         , "user");
    СтруктураСобытия.Вставить("name"         , "Измененное событие");
    СтруктураСобытия.Вставить("description"  , "Новое описание события");
    СтруктураСобытия.Вставить("importance"   , "low");
    СтруктураСобытия.Вставить("private_event", "Y");

    Результат = OPI_Bitrix24.ИзменитьСобытиеКалендаря(URL, IDСобытия, СтруктураСобытия);

    Обработать(Результат, "Bitrix24", "ИзменитьСобытиеКалендаря", "Хук", ПараметрыФункции); // SKIP

    URL         = ПараметрыФункции["Bitrix24_Domain"];
    Токен       = ПараметрыФункции["Bitrix24_Token"];
    IDСобытия   = ПараметрыФункции["Bitrix24_CEventID"];
    IDКалендаря = ПараметрыФункции["Bitrix24_CalendarID"];

    Результат = OPI_Bitrix24.ИзменитьСобытиеКалендаря(URL, IDСобытия, СтруктураСобытия, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ИзменитьСобытиеКалендаря", , ПараметрыФункции);

КонецПроцедуры

Процедура Bitrix24_УдалитьСобытиеКалендаря(ПараметрыФункции)

    URL       = ПараметрыФункции["Bitrix24_URL"];
    IDСобытия = ПараметрыФункции["Bitrix24_HookCEventID"];

    Результат = OPI_Bitrix24.УдалитьСобытиеКалендаря(URL, IDСобытия);

    Обработать(Результат, "Bitrix24", "УдалитьСобытиеКалендаря", "Хук"); // SKIP

    URL       = ПараметрыФункции["Bitrix24_Domain"];
    Токен     = ПараметрыФункции["Bitrix24_Token"];
    IDСобытия = ПараметрыФункции["Bitrix24_CEventID"];

    Результат = OPI_Bitrix24.УдалитьСобытиеКалендаря(URL, IDСобытия, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УдалитьСобытиеКалендаря");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСобытиеКалендаря(ПараметрыФункции)

    URL       = ПараметрыФункции["Bitrix24_URL"];
    IDСобытия = ПараметрыФункции["Bitrix24_HookCEventID"];

    Результат = OPI_Bitrix24.ПолучитьСобытиеКалендаря(URL, IDСобытия);

    Обработать(Результат, "Bitrix24", "ПолучитьСобытиеКалендаря", "Хук"); // SKIP

    URL       = ПараметрыФункции["Bitrix24_Domain"];
    Токен     = ПараметрыФункции["Bitrix24_Token"];
    IDСобытия = ПараметрыФункции["Bitrix24_CEventID"];

    Результат = OPI_Bitrix24.ПолучитьСобытиеКалендаря(URL, IDСобытия, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСобытиеКалендаря");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСобытияКалендарей(ПараметрыФункции)

    URL         = ПараметрыФункции["Bitrix24_URL"];
    IDВладельца = 1;
    Тип         = "user";

    Результат = OPI_Bitrix24.ПолучитьСобытияКалендарей(URL, IDВладельца, Тип);

    Обработать(Результат, "Bitrix24", "ПолучитьСобытияКалендарей", "Хук"); // SKIP

    URL          = ПараметрыФункции["Bitrix24_Domain"];
    Токен        = ПараметрыФункции["Bitrix24_Token"];
    IDСобытия    = ПараметрыФункции["Bitrix24_CEventID"];
    IDКалендаря1 = ПараметрыФункции["Bitrix24_HookCalendarID"];
    IDКалендаря2 = ПараметрыФункции["Bitrix24_CalendarID"];

    Завтра      = OPI_Инструменты.ПолучитьТекущуюДату() + 86400;
    Послезавтра = Завтра + 86400;

    МассивКалендарей = Новый Массив;
    МассивКалендарей.Добавить(IDКалендаря1);
    МассивКалендарей.Добавить(IDКалендаря2);

    Фильтр = Новый Структура;
    Фильтр.Вставить("from"   , Завтра);
    Фильтр.Вставить("to"     , Послезавтра);
    Фильтр.Вставить("section", МассивКалендарей);

    Результат = OPI_Bitrix24.ПолучитьСобытияКалендарей(URL, IDВладельца, Тип, Фильтр, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСобытияКалендарей");

КонецПроцедуры

Процедура Bitrix24_УстановитьСтатусУчастияПользователя(ПараметрыФункции)

    URL       = ПараметрыФункции["Bitrix24_URL"];
    IDСобытия = ПараметрыФункции["Bitrix24_HookCEventID"];
    Статус    = "Y";

    Результат = OPI_Bitrix24.УстановитьСтатусУчастияПользователя(URL, IDСобытия, Статус);

    Обработать(Результат, "Bitrix24", "УстановитьСтатусУчастияПользователя", "Хук"); // SKIP

    URL       = ПараметрыФункции["Bitrix24_Domain"];
    Токен     = ПараметрыФункции["Bitrix24_Token"];
    IDСобытия = ПараметрыФункции["Bitrix24_CEventID"];

    Результат = OPI_Bitrix24.УстановитьСтатусУчастияПользователя(URL, IDСобытия, Статус, Токен);

    // END

    Обработать(Результат, "Bitrix24", "УстановитьСтатусУчастияПользователя");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтатусУчастияПользователя(ПараметрыФункции)

    URL       = ПараметрыФункции["Bitrix24_URL"];
    IDСобытия = ПараметрыФункции["Bitrix24_HookCEventID"];

    Результат = OPI_Bitrix24.ПолучитьСтатусУчастияПользователя(URL, IDСобытия);

    Обработать(Результат, "Bitrix24", "ПолучитьСтатусУчастияПользователя", "Хук"); // SKIP

    URL       = ПараметрыФункции["Bitrix24_Domain"];
    Токен     = ПараметрыФункции["Bitrix24_Token"];
    IDСобытия = ПараметрыФункции["Bitrix24_CEventID"];

    Результат = OPI_Bitrix24.ПолучитьСтатусУчастияПользователя(URL, IDСобытия, Токен);

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтатусУчастияПользователя");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруСобытияКалендаря(ПараметрыФункции)

    Результат = OPI_Bitrix24.ПолучитьСтруктуруСобытияКалендаря();

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруСобытияКалендаря");

    Результат = OPI_Bitrix24.ПолучитьСтруктуруСобытияКалендаря(Истина);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруСобытияКалендаря", "Пустая");

КонецПроцедуры

Процедура Bitrix24_ПолучитьСтруктуруФильтраСобытийКалендарей(ПараметрыФункции)

    Результат = OPI_Bitrix24.ПолучитьСтруктуруФильтраСобытийКалендарей();

    // END

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруФильтраСобытийКалендарей");

    Результат = OPI_Bitrix24.ПолучитьСтруктуруФильтраСобытийКалендарей(Истина);

    Обработать(Результат, "Bitrix24", "ПолучитьСтруктуруФильтраСобытийКалендарей", "Пустая");

КонецПроцедуры

#КонецОбласти

#Область VKTeams

Процедура VKTeams_ПроверитьТокен(ПараметрыФункции)

    Токен     = ПараметрыФункции["VkTeams_Token"];
    Результат = OPI_VKTeams.ПроверитьТокен(Токен);

    // END

    Обработать(Результат, "VKTeams", "ПроверитьТокен");

КонецПроцедуры

Процедура VKTeams_ПолучитьСобытия(ПараметрыФункции)

    Токен        = ПараметрыФункции["VkTeams_Token"];
    IDПоследнего = 0;

    Для Н = 1 По 5 Цикл // В реальной работе - бесконечный цикл

        Результат = OPI_VKTeams.ПолучитьСобытия(Токен, IDПоследнего, 3);

        Обработать(Результат, "VKTeams", "ПолучитьСобытия"); // SKIP

        События = Результат["events"];

        // Обработка событий...

        Если Не События.Количество() = 0 Тогда

            IDПоследнего = События[События.ВГраница()]["eventId"];

        КонецЕсли;

    КонецЦикла;

    // END

    OPI_Инструменты.Пауза(3);

КонецПроцедуры

Процедура VKTeams_ОтправитьТекстовоеСообщение(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID"];
    Текст  = "Текст сообщения";

    Результат = OPI_VKTeams.ОтправитьТекстовоеСообщение(Токен, IDЧата, Текст);

    Обработать(Результат, "VKTeams", "ОтправитьТекстовоеСообщение", "Простое", ПараметрыФункции); // SKIP

    IDЧата        = ПараметрыФункции["VkTeams_ChatID2"];
    IDЦитируемого = ПараметрыФункции["VkTeams_MessageID"];
    Текст         = "<b>Полужирный текст сообщения</b>";
    Разметка      = "HTML";

    Клавиатура         = Новый Массив;
    МассивСтрокиКнопок = Новый Массив;

    МассивСтрокиКнопок.Добавить(OPI_VKTeams.СформироватьКнопкуДействия("Кнопка1", "НажатиеКнопки1", , "attention"));

    МассивСтрокиКнопок.Добавить(OPI_VKTeams.СформироватьКнопкуДействия("Кнопка2", , "https://openintegrations.dev"));

    // BSLLS:DuplicatedInsertionIntoCollection-off // SKIP
    Клавиатура.Добавить(МассивСтрокиКнопок);
    Клавиатура.Добавить(МассивСтрокиКнопок);
    // BSLLS:DuplicatedInsertionIntoCollection-on // SKIP

    Результат = OPI_VKTeams.ОтправитьТекстовоеСообщение(Токен, IDЧата, Текст, IDЦитируемого, Клавиатура, Разметка);

    // END

    Обработать(Результат, "VKTeams", "ОтправитьТекстовоеСообщение", , ПараметрыФункции);

КонецПроцедуры

Процедура VKTeams_ПереслатьСообщение(ПараметрыФункции)

    Токен           = ПараметрыФункции["VkTeams_Token"];
    IDЧата          = ПараметрыФункции["VkTeams_ChatID"];
    IDЧатаИсточника = ПараметрыФункции["VkTeams_ChatID2"];
    IDСообщения     = ПараметрыФункции["VkTeams_MessageID"];

    Результат = OPI_VKTeams.ПереслатьСообщение(Токен, IDСообщения, IDЧатаИсточника, IDЧата);

    Обработать(Результат, "VKTeams", "ПереслатьСообщение", "Простое"); // SKIP

    Текст = "Дополнительный текст";

    Результат = OPI_VKTeams.ПереслатьСообщение(Токен, IDСообщения, IDЧатаИсточника, IDЧата, Текст);

    // END

    Обработать(Результат, "VKTeams", "ПереслатьСообщение");

КонецПроцедуры

Процедура VKTeams_ОтправитьФайл(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID"];
    Текст  = "Подпись к файлу";

    Файл     = ПараметрыФункции["Document"];        // URL
    ФайлПуть = ПолучитьИмяВременногоФайла("docx");  // Путь

    КопироватьФайл(Файл, ФайлПуть);

    ФайлДД = Новый ДвоичныеДанные(ФайлПуть);      // Двоичные

    Результат = OPI_VKTeams.ОтправитьФайл(Токен, IDЧата, Файл);

    Обработать(Результат, "VKTeams", "ОтправитьФайл", "URL", ПараметрыФункции); // SKIP

    Результат = OPI_VKTeams.ОтправитьФайл(Токен, IDЧата, ФайлПуть, Текст);

    Обработать(Результат, "VKTeams", "ОтправитьФайл", "Путь", ПараметрыФункции); // SKIP

    Результат = OPI_VKTeams.ОтправитьФайл(Токен, IDЧата, ФайлДД, Текст, "ВажныйДокумент.docx");

    // END

    Обработать(Результат, "VKTeams", "ОтправитьФайл", , ПараметрыФункции);

    OPI_Инструменты.УдалитьФайлВПопытке(ФайлПуть, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура VKTeams_ПереслатьФайл(ПараметрыФункции)

    Токен   = ПараметрыФункции["VkTeams_Token"];
    IDЧата  = ПараметрыФункции["VkTeams_ChatID"];
    IDФайла = ПараметрыФункции["VkTeams_FileID"];
    Текст   = "Подпись к файлу";

    Результат = OPI_VKTeams.ПереслатьФайл(Токен, IDЧата, IDФайла, Текст);

    // END

    Обработать(Результат, "VKTeams", "ПереслатьФайл");

КонецПроцедуры

Процедура VKTeams_ПолучитьИнформациюОФайле(ПараметрыФункции)

    Токен   = ПараметрыФункции["VkTeams_Token"];
    IDФайла = ПараметрыФункции["VkTeams_FileID"];

    Результат = OPI_VKTeams.ПолучитьИнформациюОФайле(Токен, IDФайла);

    // END

    Обработать(Результат, "VKTeams", "ПолучитьИнформациюОФайле");

КонецПроцедуры

Процедура VKTeams_ИзменитьТекстСообщения(ПараметрыФункции)

    Токен       = ПараметрыФункции["VkTeams_Token"];
    IDЧата      = ПараметрыФункции["VkTeams_ChatID2"];
    IDСообщения = ПараметрыФункции["VkTeams_MessageID"];
    Текст       = "Новый текст сообщения";

    Результат = OPI_VKTeams.ИзменитьТекстСообщения(Токен, IDЧата, IDСообщения, Текст);

    Обработать(Результат, "VKTeams", "ИзменитьТекстСообщения", "Путь"); // SKIP

    Текст    = "<b>Новый полужирный текст сообщения</b>";
    Разметка = "HTML";

    Результат = OPI_VKTeams.ИзменитьТекстСообщения(Токен, IDЧата, IDСообщения, Текст, Разметка);

    // END

    Обработать(Результат, "VKTeams", "ИзменитьТекстСообщения");

КонецПроцедуры

Процедура VKTeams_УдалитьСообщение(ПараметрыФункции)

    Токен       = ПараметрыФункции["VkTeams_Token"];
    IDЧата      = ПараметрыФункции["VkTeams_ChatID2"];
    IDСообщения = ПараметрыФункции["VkTeams_MessageID"];

    Результат = OPI_VKTeams.УдалитьСообщение(Токен, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "VKTeams", "УдалитьСообщение");

КонецПроцедуры

Процедура VKTeams_ОтправитьГолосовоеСообщение(ПараметрыФункции)

    Токен         = ПараметрыФункции["VkTeams_Token"];
    IDЧата        = ПараметрыФункции["VkTeams_ChatID2"];
    IDЦитируемого = ПараметрыФункции["VkTeams_MessageID"];

    Файл     = ПараметрыФункции["Audio2"];        // URL
    ФайлПуть = ПолучитьИмяВременногоФайла("m4a");   // Путь

    КопироватьФайл(Файл, ФайлПуть);

    ФайлДД = Новый ДвоичныеДанные(ФайлПуть);      // Двоичные

    Результат = OPI_VKTeams.ОтправитьГолосовоеСообщение(Токен, IDЧата, Файл);

    Обработать(Результат, "VKTeams", "ОтправитьГолосовоеСообщение", "URL", ПараметрыФункции); // SKIP

    Результат = OPI_VKTeams.ОтправитьГолосовоеСообщение(Токен, IDЧата, ФайлПуть, , IDЦитируемого);

    Обработать(Результат, "VKTeams", "ОтправитьГолосовоеСообщение", "Путь", ПараметрыФункции); // SKIP

    Результат = OPI_VKTeams.ОтправитьГолосовоеСообщение(Токен, IDЧата, ФайлДД);

    // END

    Обработать(Результат, "VKTeams", "ОтправитьГолосовоеСообщение", , ПараметрыФункции);

    OPI_Инструменты.УдалитьФайлВПопытке(ФайлПуть, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура VKTeams_ПереслатьГолосовоеСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["VkTeams_Token"];
    IDЧата  = ПараметрыФункции["VkTeams_ChatID"];
    IDФайла = ПараметрыФункции["VkTeams_VoiceID"];

    Результат = OPI_VKTeams.ПереслатьГолосовоеСообщение(Токен, IDЧата, IDФайла);

    // END

    Обработать(Результат, "VKTeams", "ПереслатьГолосовоеСообщение");

КонецПроцедуры

Процедура VKTeams_ИсключитьПользователейЧата(ПараметрыФункции)

    Токен        = ПараметрыФункции["VkTeams_Token"];
    IDЧата       = ПараметрыФункции["VkTeams_ChatID2"];
    Пользователь = 1011987091;

    Результат = OPI_VKTeams.ИсключитьПользователейЧата(Токен, IDЧата, Пользователь);

    // END

    Обработать(Результат, "VKTeams", "ИсключитьПользователейЧата");

КонецПроцедуры

Процедура VKTeams_ИзменитьАватарЧата(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID"];

    Файл     = ПараметрыФункции["Picture3"];        // URL
    ФайлПуть = ПолучитьИмяВременногоФайла("png");   // Путь

    КопироватьФайл(Файл, ФайлПуть);

    ФайлДД = Новый ДвоичныеДанные(ФайлПуть);      // Двоичные

    Результат = OPI_VKTeams.ИзменитьАватарЧата(Токен, IDЧата, Файл);

    Обработать(Результат, "VKTeams", "ИзменитьАватарЧата", "URL");

    Результат = OPI_VKTeams.ИзменитьАватарЧата(Токен, IDЧата, ФайлПуть);

    Обработать(Результат, "VKTeams", "ИзменитьАватарЧата", "Путь");

    Результат = OPI_VKTeams.ИзменитьАватарЧата(Токен, IDЧата, ФайлДД);

    // END

    Обработать(Результат, "VKTeams", "ИзменитьАватарЧата");

    OPI_Инструменты.УдалитьФайлВПопытке(ФайлПуть, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура VKTeams_ПолучитьИнформациюОЧате(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID"];

    Результат = OPI_VKTeams.ПолучитьИнформациюОЧате(Токен, IDЧата);

    // END

    Обработать(Результат, "VKTeams", "ПолучитьИнформациюОЧате");

КонецПроцедуры

Процедура VKTeams_ПолучитьАдминистраторовЧата(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID"];

    Результат = OPI_VKTeams.ПолучитьАдминистраторовЧата(Токен, IDЧата);

    // END

    Обработать(Результат, "VKTeams", "ПолучитьАдминистраторовЧата");

КонецПроцедуры

Процедура VKTeams_ПолучитьПользователейЧата(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID"];

    Результат = OPI_VKTeams.ПолучитьПользователейЧата(Токен, IDЧата);

    // END

    Обработать(Результат, "VKTeams", "ПолучитьПользователейЧата");

КонецПроцедуры

Процедура VKTeams_ПолучитьЗаблокированныхПользователейЧата(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID"];

    Результат = OPI_VKTeams.ПолучитьЗаблокированныхПользователейЧата(Токен, IDЧата);

    // END

    Обработать(Результат, "VKTeams", "ПолучитьЗаблокированныхПользователейЧата");

КонецПроцедуры

Процедура VKTeams_ПолучитьЗапросыВступленияЧата(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID"];

    Результат = OPI_VKTeams.ПолучитьЗапросыВступленияЧата(Токен, IDЧата);

    // END

    Обработать(Результат, "VKTeams", "ПолучитьЗапросыВступленияЧата");

КонецПроцедуры

Процедура VKTeams_ЗаблокироватьПользователяЧата(ПараметрыФункции)

    Токен        = ПараметрыФункции["VkTeams_Token"];
    IDЧата       = ПараметрыФункции["VkTeams_ChatID2"];
    Пользователь = 1011987091;

    Результат = OPI_VKTeams.ЗаблокироватьПользователяЧата(Токен, IDЧата, Пользователь, Истина);

    // END

    Обработать(Результат, "VKTeams", "ЗаблокироватьПользователяЧата");

КонецПроцедуры

Процедура VKTeams_РазблокироватьПользователяЧата(ПараметрыФункции)

    Токен        = ПараметрыФункции["VkTeams_Token"];
    IDЧата       = ПараметрыФункции["VkTeams_ChatID2"];
    Пользователь = 1011987091;

    Результат = OPI_VKTeams.РазблокироватьПользователяЧата(Токен, IDЧата, Пользователь);

    // END

    Обработать(Результат, "VKTeams", "РазблокироватьПользователяЧата");

КонецПроцедуры

Процедура VKTeams_ЗакрепитьСообщение(ПараметрыФункции)

    Токен       = ПараметрыФункции["VkTeams_Token"];
    IDЧата      = ПараметрыФункции["VkTeams_ChatID2"];
    IDСообщения = ПараметрыФункции["VkTeams_MessageID"];

    Результат = OPI_VKTeams.ЗакрепитьСообщение(Токен, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "VKTeams", "ЗакрепитьСообщение");

КонецПроцедуры

Процедура VKTeams_ОткрепитьСообщение(ПараметрыФункции)

    Токен       = ПараметрыФункции["VkTeams_Token"];
    IDЧата      = ПараметрыФункции["VkTeams_ChatID2"];
    IDСообщения = ПараметрыФункции["VkTeams_MessageID"];

    Результат = OPI_VKTeams.ОткрепитьСообщение(Токен, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "VKTeams", "ОткрепитьСообщение");

КонецПроцедуры

Процедура VKTeams_ОдобритьЗаявкуНаВступление(ПараметрыФункции)

    Токен        = ПараметрыФункции["VkTeams_Token"];
    IDЧата       = ПараметрыФункции["VkTeams_ChatID2"];
    Пользователь = 1011987091;

    Результат = OPI_VKTeams.ОдобритьЗаявкуНаВступление(Токен, IDЧата, Пользователь);

    Обработать(Результат, "VKTeams", "ОдобритьЗаявкуНаВступление", "Один"); // SKIP

    Результат = OPI_VKTeams.ОдобритьЗаявкуНаВступление(Токен, IDЧата);

    // END

    Обработать(Результат, "VKTeams", "ОдобритьЗаявкуНаВступление");

КонецПроцедуры

Процедура VKTeams_ОтклонитьЗаявкуНаВступление(ПараметрыФункции)

    Токен        = ПараметрыФункции["VkTeams_Token"];
    IDЧата       = ПараметрыФункции["VkTeams_ChatID2"];
    Пользователь = 1011987091;

    Результат = OPI_VKTeams.ОтклонитьЗаявкуНаВступление(Токен, IDЧата, Пользователь);

    Обработать(Результат, "VKTeams", "ОтклонитьЗаявкуНаВступление", "Один"); // SKIP

    Результат = OPI_VKTeams.ОтклонитьЗаявкуНаВступление(Токен, IDЧата);

    // END

    Обработать(Результат, "VKTeams", "ОтклонитьЗаявкуНаВступление");

КонецПроцедуры

Процедура VKTeams_УстановитьЗаголовокЧата(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID2"];
    Текст  = "Новый заголовок";

    Результат = OPI_VKTeams.УстановитьЗаголовокЧата(Токен, IDЧата, Текст);

    // END

    Обработать(Результат, "VKTeams", "УстановитьЗаголовокЧата");

КонецПроцедуры

Процедура VKTeams_УстановитьОписаниеЧата(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID2"];
    Текст  = "Новое описание";

    Результат = OPI_VKTeams.УстановитьОписаниеЧата(Токен, IDЧата, Текст);

    // END

    Обработать(Результат, "VKTeams", "УстановитьОписаниеЧата");

КонецПроцедуры

Процедура VKTeams_УстановитьПравилаЧата(ПараметрыФункции)

    Токен  = ПараметрыФункции["VkTeams_Token"];
    IDЧата = ПараметрыФункции["VkTeams_ChatID2"];
    Текст  = "Текст новых правил";

    Результат = OPI_VKTeams.УстановитьПравилаЧата(Токен, IDЧата, Текст);

    // END

    Обработать(Результат, "VKTeams", "УстановитьПравилаЧата");

КонецПроцедуры

Процедура VKTeams_ОтветитьНаСобытиеКлавиатуры(ПараметрыФункции)

    Токен        = ПараметрыФункции["VkTeams_Token"];
    IDПоследнего = 0;

    Для Н = 1 По 5 Цикл

        Результат = OPI_VKTeams.ПолучитьСобытия(Токен, IDПоследнего, 3);
        События   = Результат["events"];

        Если Не События.Количество() = 0 Тогда

            Для Каждого Событие Из События Цикл

                ДанныеСобытия = Событие["payload"];

                Если ДанныеСобытия["callbackData"] = "НажатиеКнопки1" Тогда

                    IDСобытия = ДанныеСобытия["queryId"];
                    Результат = OPI_VKTeams.ОтветитьНаСобытиеКлавиатуры(Токен, IDСобытия, "Получено!");

                    Обработать(Результат, "VKTeams", "ОтветитьНаСобытиеКлавиатуры"); // SKIP

                КонецЕсли;

            КонецЦикла;

            IDПоследнего = События[События.ВГраница()]["eventId"];

        КонецЕсли;

    КонецЦикла;

    // END

    OPI_Инструменты.Пауза(3);

КонецПроцедуры

Процедура VKTeams_СформироватьКнопкуДействия(ПараметрыФункции)

    Клавиатура         = Новый Массив;
    МассивСтрокиКнопок = Новый Массив;

    МассивСтрокиКнопок.Добавить(OPI_VKTeams.СформироватьКнопкуДействия("Кнопка1", "НажатиеКнопки1", , "attention"));

    МассивСтрокиКнопок.Добавить(OPI_VKTeams.СформироватьКнопкуДействия("Кнопка2", , "https://openintegrations.dev"));

    // BSLLS:DuplicatedInsertionIntoCollection-off // SKIP
    Клавиатура.Добавить(МассивСтрокиКнопок);
    Клавиатура.Добавить(МассивСтрокиКнопок);
    // BSLLS:DuplicatedInsertionIntoCollection-on // SKIP

    // END

КонецПроцедуры

#КонецОбласти

#Область Neocities

Процедура Neocities_ЗагрузитьФайл(ПараметрыФункции)

    Токен  = ПараметрыФункции["NC_Token"];
    Данные = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    Путь   = "testfolder/test_pic.png";

    Результат = OPI_Neocities.ЗагрузитьФайл(Токен, Путь, Данные);

    // END

    Обработать(Результат, "Neocities", "ЗагрузитьФайл");

КонецПроцедуры

Процедура Neocities_ЗагрузитьФайлы(ПараметрыФункции)

    Токен = ПараметрыФункции["NC_Token"];

    Картинка1 = ПараметрыФункции["Picture"];  // URL, Путь или Двоичные данные
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Путь или Двоичные данные
    Гифка     = ПараметрыФункции["Gif"];      // URL, Путь или Двоичные данные

    СоответствиеФайлов = Новый Соответствие;
    СоответствиеФайлов.Вставить("test/pic1.png", Картинка1);
    СоответствиеФайлов.Вставить("test/gif.gif" , Картинка2);
    СоответствиеФайлов.Вставить("pic2.png"     , Гифка);

    Результат = OPI_Neocities.ЗагрузитьФайлы(Токен, СоответствиеФайлов);

    // END

    Обработать(Результат, "Neocities", "ЗагрузитьФайлы");

КонецПроцедуры

Процедура Neocities_УдалитьВыбранныеФайлы(ПараметрыФункции)

    Токен = ПараметрыФункции["NC_Token"];

    Пути = Новый Массив;
    Пути.Добавить("/test/pic1.png");
    Пути.Добавить("/test/gif.gif");
    Пути.Добавить("/pic2.png");

    Результат = OPI_Neocities.УдалитьВыбранныеФайлы(Токен, Пути);

    // END

    Обработать(Результат, "Neocities", "УдалитьВыбранныеФайлы");

    Результат = OPI_Neocities.УдалитьВыбранныеФайлы(Токен, "/testfolder");

    Обработать(Результат, "Neocities", "УдалитьВыбранныеФайлы", "Каталог 1");

    Результат = OPI_Neocities.УдалитьВыбранныеФайлы(Токен, "/test");

    Обработать(Результат, "Neocities", "УдалитьВыбранныеФайлы", "Каталог 2");

КонецПроцедуры

Процедура Neocities_ПолучитьСписокФайлов(ПараметрыФункции)

    Токен = ПараметрыФункции["NC_Token"];
    Путь  = "test";

    Результат = OPI_Neocities.ПолучитьСписокФайлов(Токен, Путь);

    // END

    Обработать(Результат, "Neocities", "ПолучитьСписокФайлов");

    Результат = OPI_Neocities.ПолучитьСписокФайлов(Токен);

    Обработать(Результат, "Neocities", "ПолучитьСписокФайлов", "Все");

КонецПроцедуры

Процедура Neocities_ПолучитьДанныеОСайте(ПараметрыФункции)

    Токен = ПараметрыФункции["NC_Token"];
    Сайт  = "2athenaeum";

    Результат = OPI_Neocities.ПолучитьДанныеОСайте(Токен);

    Обработать(Результат, "Neocities", "ПолучитьДанныеОСайте"); // SKIP

    Результат = OPI_Neocities.ПолучитьДанныеОСайте(Токен, Сайт);

    // END

    Обработать(Результат, "Neocities", "ПолучитьДанныеОСайте", "Сайт");

КонецПроцедуры

Процедура Neocities_ПолучитьТокен(ПараметрыФункции)

    Логин  = ПараметрыФункции["NC_Login"];
    Пароль = ПараметрыФункции["NC_Password"];

    Результат = OPI_Neocities.ПолучитьТокен(Логин, Пароль);

    // END

    Результат["api_key"] = "***";

    Обработать(Результат, "Neocities", "ПолучитьТокен");

КонецПроцедуры

Процедура Neocities_СинхронизироватьКаталоги(ПараметрыФункции)

    Токен = ПараметрыФункции["NC_Token"];

    ЛокальныйКаталог = "C:\test_site";
    УдаленныйКаталог = "test_sync";

    Результат = OPI_Neocities.СинхронизироватьКаталоги(Токен, ЛокальныйКаталог, УдаленныйКаталог);

    // END

    Обработать(Результат, "Neocities", "СинхронизироватьКаталоги");

КонецПроцедуры

#КонецОбласти

#Область CDEK

Процедура CDEK_ПолучитьТокен(ПараметрыФункции)

    Аккаунт = ПараметрыФункции["CDEK_Account"];
    Пароль  = ПараметрыФункции["CDEK_Password"];

    Результат = OPI_CDEK.ПолучитьТокен(Аккаунт, Пароль, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьОписаниеЗаказа(ПараметрыФункции)

    Результат = OPI_CDEK.ПолучитьОписаниеЗаказа();

    // END

    Обработать(Результат, "CDEK", "ПолучитьОписаниеЗаказа");

    Результат = OPI_CDEK.ПолучитьОписаниеЗаказа(Истина);

    Обработать(Результат, "CDEK", "ПолучитьОписаниеЗаказа", "Пустая");

КонецПроцедуры

Процедура CDEK_СоздатьЗаказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];

    ОписаниеЗаказа = Новый Структура;

    ЛокацияОтправления = Новый Структура;
    ЛокацияОтправления.Вставить("code"   , "44");
    ЛокацияОтправления.Вставить("city"   , "Москва");
    ЛокацияОтправления.Вставить("address", "пр. Ленинградский, д.4");

    ЛокацияНазначения = Новый Структура;
    ЛокацияНазначения.Вставить("code"   , "270");
    ЛокацияНазначения.Вставить("city"   , "Новосибирск");
    ЛокацияНазначения.Вставить("address", "ул. Блюхера, 32");

    Получатель = Новый Структура;

    Телефоны = Новый Массив;
    Телефоны.Добавить(Новый Структура("number", "+79134637228"));

    Получатель.Вставить("phones", Телефоны);
    Получатель.Вставить("name"  , "Иванов Иван");

    Отправитель = Новый Структура("name", "Петров Петр");

    Услуги = Новый Массив;

    Услуга = Новый Структура;
    Услуга.Вставить("code"     , "SECURE_PACKAGE_A2");
    Услуга.Вставить("parameter", 10);

    Услуги.Добавить(Услуга);

    Пакеты = Новый Массив;

    Пакет = Новый Структура;

    Позиции = Новый Массив;

    Позиция = Новый Структура;

    Оплата = Новый Структура;
    Оплата.Вставить("value", 3000);

    Позиция.Вставить("payment" , Оплата);
    Позиция.Вставить("ware_key", "00055");
    Позиция.Вставить("name"    , "Товар");
    Позиция.Вставить("cost"    , 300);
    Позиция.Вставить("amount"  , 2);
    Позиция.Вставить("weight"  , 700);
    Позиция.Вставить("url"     , "www.item.ru");

    Позиции.Добавить(Позиция);

    Пакет.Вставить("items"  , Позиции);
    Пакет.Вставить("number" , "bar-001");
    Пакет.Вставить("comment", "Упаковка");
    Пакет.Вставить("height" , 10);
    Пакет.Вставить("length" , 10);
    Пакет.Вставить("weight" , "4000");
    Пакет.Вставить("width"  , 10);

    Пакеты.Добавить(Пакет);

    ОписаниеЗаказа.Вставить("from_location", ЛокацияОтправления);
    ОписаниеЗаказа.Вставить("to_location"  , ЛокацияНазначения);
    ОписаниеЗаказа.Вставить("packages"     , Пакеты);
    ОписаниеЗаказа.Вставить("recipient"    , Получатель);
    ОписаниеЗаказа.Вставить("sender"       , Отправитель);
    ОписаниеЗаказа.Вставить("services"     , Услуги);

    ОписаниеЗаказа.Вставить("number"     , Строка(Новый УникальныйИдентификатор));
    ОписаниеЗаказа.Вставить("comment"    , "Новый заказ");
    ОписаниеЗаказа.Вставить("tariff_code", 139);

    ОписаниеЗаказа.Вставить("delivery_recipient_cost"    , Новый Структура("value"        , 50));
    ОписаниеЗаказа.Вставить("delivery_recipient_cost_adv", Новый Структура("sum,threshold", 3000, 200));

    Результат = OPI_CDEK.СоздатьЗаказ(Токен, ОписаниеЗаказа, Истина, Истина);

    // END

    Обработать(Результат, "CDEK", "СоздатьЗаказ", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьЗаказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.ПолучитьЗаказ(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьЗаказ", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьЗаказПоНомеру(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];

    НомерЗаказа = ПараметрыФункции["CDEK_OrderIMN"];
    Результат   = OPI_CDEK.ПолучитьЗаказПоНомеру(Токен, НомерЗаказа, Истина, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьЗаказПоНомеру");

КонецПроцедуры

Процедура CDEK_ИзменитьЗаказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    ОписаниеЗаказа = Новый Структура("comment", "Новый комментарий");

    Результат = OPI_CDEK.ИзменитьЗаказ(Токен, UUID, ОписаниеЗаказа, Истина);

    // END

    Обработать(Результат, "CDEK", "ИзменитьЗаказ");

КонецПроцедуры

Процедура CDEK_УдалитьЗаказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.УдалитьЗаказ(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "УдалитьЗаказ");

КонецПроцедуры

Процедура CDEK_ОформитьКлиентскийВозврат(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];
    Тариф = 139;

    Результат = OPI_CDEK.ОформитьКлиентскийВозврат(Токен, UUID, Тариф, Истина);

    // END

    Обработать(Результат, "CDEK", "ОформитьКлиентскийВозврат");

КонецПроцедуры

Процедура CDEK_СоздатьОтказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.СоздатьОтказ(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "СоздатьОтказ");

КонецПроцедуры

Процедура CDEK_ПолучитьОписаниеЗаявкиКурьера(ПараметрыФункции)

    Результат = OPI_CDEK.ПолучитьОписаниеЗаявкиКурьера();

    // END

    Обработать(Результат, "CDEK", "ПолучитьОписаниеЗаявкиКурьера");

    Результат = OPI_CDEK.ПолучитьОписаниеЗаявкиКурьера(Истина);

    Обработать(Результат, "CDEK", "ПолучитьОписаниеЗаявкиКурьера", "Пустая");

КонецПроцедуры

Процедура CDEK_СоздатьЗаявкуНаВызовКурьера(ПараметрыФункции)

    Токен       = ПараметрыФункции["CDEK_Token"];
    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();

    ОписаниеЗаявки = Новый Структура;
    ОписаниеЗаявки.Вставить("intake_date"     , Формат(ТекущаяДата + 60 * 60 * 24, "ДФ=yyyy-MM-dd"));
    ОписаниеЗаявки.Вставить("intake_time_from", "10:00");
    ОписаниеЗаявки.Вставить("intake_time_to"  , "17:00");
    ОписаниеЗаявки.Вставить("name"            , "Консолидированный груз");
    ОписаниеЗаявки.Вставить("weight"          , 1000);
    ОписаниеЗаявки.Вставить("length"          , 10);
    ОписаниеЗаявки.Вставить("width"           , 10);
    ОписаниеЗаявки.Вставить("height"          , 10);
    ОписаниеЗаявки.Вставить("comment"         , "Комментарий курьеру");
    ОписаниеЗаявки.Вставить("need_call"       , Ложь);

    Отправитель = Новый Структура;
    Отправитель.Вставить("company", "Компания");
    Отправитель.Вставить("name"   , "Иванов Иван");

    Телефоны = Новый Массив;
    Телефон  = Новый Структура("number", "+79589441654");
    Телефоны.Добавить(Телефон);

    Отправитель.Вставить("phones", Телефоны);

    ОписаниеЗаявки.Вставить("sender", Отправитель);

    ТочкаОтправления = Новый Структура;
    ТочкаОтправления.Вставить("code"        , "44");
    ТочкаОтправления.Вставить("fias_guid"   , "0c5b2444-70a0-4932-980c-b4dc0d3f02b5");
    ТочкаОтправления.Вставить("postal_code" , "109004");
    ТочкаОтправления.Вставить("longitude"   , 37.6204);
    ТочкаОтправления.Вставить("latitude"    , 55.754);
    ТочкаОтправления.Вставить("country_code", "RU");
    ТочкаОтправления.Вставить("region"      , "Москва");
    ТочкаОтправления.Вставить("sub_region"  , "Москва");
    ТочкаОтправления.Вставить("city"        , "Москва");
    ТочкаОтправления.Вставить("kladr_code"  , "7700000000000");
    ТочкаОтправления.Вставить("address"     , "ул. Блюхера, 32");

    ОписаниеЗаявки.Вставить("from_location", ТочкаОтправления);

    Результат = OPI_CDEK.СоздатьЗаявкуНаВызовКурьера(Токен, ОписаниеЗаявки, Истина);

    // END

    Обработать(Результат, "CDEK", "СоздатьЗаявкуНаВызовКурьера", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьЗаявкуНаВызовКурьера(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_IntakeUUID"];

    Результат = OPI_CDEK.ПолучитьЗаявкуНаВызовКурьера(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьЗаявкуНаВызовКурьера");

КонецПроцедуры

Процедура CDEK_УдалитьЗаявкуНаВызовКурьера(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_IntakeUUID"];

    Результат = OPI_CDEK.УдалитьЗаявкуНаВызовКурьера(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "УдалитьЗаявкуНаВызовКурьера");

КонецПроцедуры

Процедура CDEK_СформироватьКвитанцию(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];
    Тип   = "tpl_russia";
    Копий = 1;

    Результат = OPI_CDEK.СформироватьКвитанцию(Токен, UUID, Тип, Копий, Истина);

    // END

    Обработать(Результат, "CDEK", "СформироватьКвитанцию", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьКвитанцию(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_PrintUUID"];

    Результат = OPI_CDEK.ПолучитьКвитанцию(Токен, UUID, , Истина); // Ответ сервера с ссылкой

    // END

    Обработать(Результат, "CDEK", "ПолучитьКвитанцию");

КонецПроцедуры

Процедура CDEK_СформироватьШтрихкод(ПараметрыФункции)

    Токен  = ПараметрыФункции["CDEK_Token"];
    UUID   = ПараметрыФункции["CDEK_OrderUUID"];
    Формат = "A5";
    Копий  = 1;

    Результат = OPI_CDEK.СформироватьШтрихкод(Токен, UUID, Копий, Формат, , Истина);

    // END

    Обработать(Результат, "CDEK", "СформироватьШтрихкод", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьШтрихкод(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_BarcodeUUID"];

    Результат = OPI_CDEK.ПолучитьШтрихкод(Токен, UUID, , Истина); // Ответ сервера с ссылкой

    // END

    Обработать(Результат, "CDEK", "ПолучитьШтрихкод");

КонецПроцедуры

Процедура CDEK_ПолучитьДоступныеИнтервалыДоставки(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.ПолучитьДоступныеИнтервалыДоставки(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьДоступныеИнтервалыДоставки");

КонецПроцедуры

Процедура CDEK_ПолучитьОписаниеДоговоренности(ПараметрыФункции)

    Результат = OPI_CDEK.ПолучитьОписаниеДоговоренности();

    // END

    Обработать(Результат, "CDEK", "ПолучитьОписаниеДоговоренности");

    Результат = OPI_CDEK.ПолучитьОписаниеДоговоренности(Истина);

    Обработать(Результат, "CDEK", "ПолучитьОписаниеДоговоренности", "Пустая");

КонецПроцедуры

Процедура CDEK_ЗафиксироватьДоговоренностьОДоставке(ПараметрыФункции)

    Токен      = ПараметрыФункции["CDEK_Token"];
    UUIDЗаказа = ПараметрыФункции["CDEK_OrderUUID"];

    Сутки        = 60 * 60 * 24;
    ТекущаяДата  = НачалоДня(OPI_Инструменты.ПолучитьТекущуюДату());
    ДатаДоставки = ТекущаяДата + Сутки * 14;

    Пока ДеньНедели(ДатаДоставки) > 5 Цикл
        ДатаДоставки = ДатаДоставки + Сутки;
    КонецЦикла;

    Договоренность = Новый Структура;

    Договоренность.Вставить("cdek_number", "1106207236");
    Договоренность.Вставить("order_uuid" , UUIDЗаказа);
    Договоренность.Вставить("date"       , Формат(ДатаДоставки, "ДФ=yyyy-MM-dd"));
    Договоренность.Вставить("time_from"  , "10:00");
    Договоренность.Вставить("time_to"    , "17:00");
    Договоренность.Вставить("comment"    , "Офис группы компаний");

    МестоДоставки = Новый Структура;
    МестоДоставки.Вставить("code"        , "270");
    МестоДоставки.Вставить("fias_guid"   , "0c5b2444-70a0-4932-980c-b4dc0d3f02b5");
    МестоДоставки.Вставить("postal_code" , "109004");
    МестоДоставки.Вставить("longitude"   , 37.6204);
    МестоДоставки.Вставить("latitude"    , 55.754);
    МестоДоставки.Вставить("country_code", "RU");
    МестоДоставки.Вставить("region"      , "Новосибирск");
    МестоДоставки.Вставить("sub_region"  , "Новосибирск");
    МестоДоставки.Вставить("city"        , "Новосибирск");
    МестоДоставки.Вставить("kladr_code"  , "7700000000000");
    МестоДоставки.Вставить("address"     , "ул. Блюхера, 33");

    Договоренность.Вставить("to_location", МестоДоставки);

    Результат = OPI_CDEK.ЗафиксироватьДоговоренностьОДоставке(Токен, Договоренность, Истина);

    // END

    Обработать(Результат, "CDEK", "ЗафиксироватьДоговоренностьОДоставке", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьДоговоренностьОДоставке(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_ApptUUID"];

    Результат = OPI_CDEK.ПолучитьДоговоренностьОДоставке(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьДоговоренностьОДоставке");

КонецПроцедуры

Процедура CDEK_СоздатьПреалерт(ПараметрыФункции)

    Токен        = ПараметрыФункции["CDEK_Token"];
    UUID         = ПараметрыФункции["CDEK_OrderUUID"];
    ПВЗ          = "NSK27";
    ДатаПередачи = OPI_Инструменты.ПолучитьТекущуюДату() + 60 * 60 * 24;

    Результат = OPI_CDEK.СоздатьПреалерт(Токен, UUID, ДатаПередачи, ПВЗ, Истина);

    // END

    Обработать(Результат, "CDEK", "СоздатьПреалерт", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьПреалерт(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_PrealertUUID"];

    Результат = OPI_CDEK.ПолучитьПреалерт(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьПреалерт");

КонецПроцедуры

Процедура CDEK_ПолучитьСтатусПаспортныхДанных(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.ПолучитьСтатусПаспортныхДанных(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьСтатусПаспортныхДанных");

КонецПроцедуры

Процедура CDEK_ПолучитьЧекЗаказа(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.ПолучитьЧекЗаказа(Токен, UUID, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьЧекЗаказа");

КонецПроцедуры

Процедура CDEK_ПолучитьЧекиНаДату(ПараметрыФункции)

    Токен         = ПараметрыФункции["CDEK_Token"];
    ДатаПолучения = OPI_Инструменты.ПолучитьТекущуюДату();

    Результат = OPI_CDEK.ПолучитьЧекиНаДату(Токен, ДатаПолучения, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьЧекиНаДату");

КонецПроцедуры

Процедура CDEK_ПолучитьРеестрыПлатежейНаДату(ПараметрыФункции)

    Токен         = ПараметрыФункции["CDEK_Token"];
    ДатаПолучения = OPI_Инструменты.ПолучитьТекущуюДату();

    Результат = OPI_CDEK.ПолучитьРеестрыПлатежейНаДату(Токен, ДатаПолучения, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьРеестрыПлатежейНаДату");

КонецПроцедуры

Процедура CDEK_ПолучитьПереводыПлатежейНаДату(ПараметрыФункции)

    Токен         = ПараметрыФункции["CDEK_Token"];
    ДатаПолучения = OPI_Инструменты.ПолучитьТекущуюДату();

    Результат = OPI_CDEK.ПолучитьПереводыПлатежейНаДату(Токен, ДатаПолучения, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьПереводыПлатежейНаДату");

КонецПроцедуры

Процедура CDEK_ПолучитьОписаниеФильтраОфисов(ПараметрыФункции)

    Результат = OPI_CDEK.ПолучитьОписаниеФильтраОфисов();

    // END

    Обработать(Результат, "CDEK", "ПолучитьОписаниеФильтраОфисов");

    Результат = OPI_CDEK.ПолучитьОписаниеФильтраОфисов(Истина);

    Обработать(Результат, "CDEK", "ПолучитьОписаниеФильтраОфисов", "Пустая");

КонецПроцедуры

Процедура CDEK_ПолучитьСписокОфисов(ПараметрыФункции)

    Токен  = ПараметрыФункции["CDEK_Token"];
    Фильтр = Новый Структура;
    Фильтр.Вставить("weight_max" , 50);
    Фильтр.Вставить("city_code"  , 270);
    Фильтр.Вставить("allowed_cod", Истина);

    Результат = OPI_CDEK.ПолучитьСписокОфисов(Токен, Фильтр, Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьСписокОфисов");

КонецПроцедуры

Процедура CDEK_ПолучитьСписокРегионов(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];

    Результат = OPI_CDEK.ПолучитьСписокРегионов(Токен, , , , Истина);

    // END

    Обработать(Результат, "CDEK", "ПолучитьСписокРегионов");

КонецПроцедуры

#КонецОбласти

#Область YandexMetrika

Процедура YandexMetrika_ПолучитьСписокМеток(ПараметрыФункции)

    Токен = ПараметрыФункции["Metrika_Token"];

    Результат = OPI_YandexMetrika.ПолучитьСписокМеток(Токен);

    // END

    Обработать(Результат, "YandexMetrika", "ПолучитьСписокМеток");

КонецПроцедуры

Процедура YandexMetrika_СоздатьМетку(ПараметрыФункции)

    Токен        = ПараметрыФункции["Metrika_Token"];
    Наименование = "Новая метка";

    Результат = OPI_YandexMetrika.СоздатьМетку(Токен, Наименование);

    // END

    Обработать(Результат, "YandexMetrika", "СоздатьМетку", , ПараметрыФункции, Наименование);

КонецПроцедуры

Процедура YandexMetrika_УдалитьМетку(ПараметрыФункции)

    Токен   = ПараметрыФункции["Metrika_Token"];
    IDМетки = ПараметрыФункции["Metrika_LabelID"];

    Результат = OPI_YandexMetrika.УдалитьМетку(Токен, IDМетки);

    // END

    Обработать(Результат, "YandexMetrika", "УдалитьМетку");

КонецПроцедуры

Процедура YandexMetrika_ИзменитьМетку(ПараметрыФункции)

    Токен        = ПараметрыФункции["Metrika_Token"];
    IDМетки      = ПараметрыФункции["Metrika_LabelID"];
    Наименование = "Новое имя метки";

    Результат = OPI_YandexMetrika.ИзменитьМетку(Токен, IDМетки, Наименование);

    // END

    Обработать(Результат, "YandexMetrika", "ИзменитьМетку", , Наименование);

КонецПроцедуры

Процедура YandexMetrika_ПолучитьМетку(ПараметрыФункции)

    Токен   = ПараметрыФункции["Metrika_Token"];
    IDМетки = ПараметрыФункции["Metrika_LabelID"];

    Результат = OPI_YandexMetrika.ПолучитьМетку(Токен, IDМетки);

    // END

    Обработать(Результат, "YandexMetrika", "ПолучитьМетку");

КонецПроцедуры

Процедура YandexMetrika_ПолучитьСтруктуруСчетчика(ПараметрыФункции)

    Пустая    = Ложь;
    Результат = OPI_YandexMetrika.ПолучитьСтруктуруСчетчика(Пустая);

    // END

    Обработать(Результат, "YandexMetrika", "ПолучитьСтруктуруСчетчика");

КонецПроцедуры

Процедура YandexMetrika_СоздатьСчетчик(ПараметрыФункции)

    Токен = ПараметрыФункции["Metrika_Token"];

    СтруктураСчетчика = Новый Структура;
    СтруктураСчетчика.Вставить("autogoals_enabled", Истина);

    СтруктураНастроекКода = Новый Структура;
    СтруктураНастроекКода.Вставить("async"          , 0);
    СтруктураНастроекКода.Вставить("clickmap"       , 1);
    СтруктураНастроекКода.Вставить("ecommerce"      , 1);
    СтруктураНастроекКода.Вставить("in_one_line"    , 0);
    СтруктураНастроекКода.Вставить("track_hash"     , 1);
    СтруктураНастроекКода.Вставить("visor"          , 1);
    СтруктураНастроекКода.Вставить("xml_site"       , 0);
    СтруктураНастроекКода.Вставить("ytm"            , 0);
    СтруктураНастроекКода.Вставить("alternative_cdn", 1);

    СтруктураИнформера = Новый Структура;
    СтруктураИнформера.Вставить("color_arrow", 1);
    СтруктураИнформера.Вставить("color_end"  , "EFEFEFFE");
    СтруктураИнформера.Вставить("color_start", "EEEEEEEE");
    СтруктураИнформера.Вставить("color_text" , 0);
    СтруктураИнформера.Вставить("enabled"    , 1);
    СтруктураИнформера.Вставить("indicator"  , "uniques");
    СтруктураИнформера.Вставить("size"       , 2);
    СтруктураИнформера.Вставить("type"       , "ext");

    СтруктураНастроекКода.Вставить("informer", СтруктураИнформера);

    СтруктураСчетчика.Вставить("code_options", СтруктураНастроекКода);

    СтруктураФлагов = Новый Структура;
    СтруктураФлагов.Вставить("collect_first_party_data"             , Истина);
    СтруктураФлагов.Вставить("measurement_enabled"                  , Истина);
    СтруктураФлагов.Вставить("use_in_benchmarks"                    , Истина);
    СтруктураФлагов.Вставить("direct_allow_use_goals_without_access", Истина);

    СтруктураСчетчика.Вставить("counter_flags"          , СтруктураФлагов);
    СтруктураСчетчика.Вставить("favorite"               , 1);
    СтруктураСчетчика.Вставить("filter_robots"          , 2);
    СтруктураСчетчика.Вставить("gdpr_agreement_accepted", 1);

    СтруктураДомена = Новый Структура("site", "openintegrations.dev");

    СтруктураСчетчика.Вставить("site2", СтруктураДомена);

    Результат = OPI_YandexMetrika.СоздатьСчетчик(Токен, СтруктураСчетчика);

    // END

    Обработать(Результат, "YandexMetrika", "СоздатьСчетчик", , ПараметрыФункции);

КонецПроцедуры

Процедура YandexMetrika_УдалитьСчетчик(ПараметрыФункции)

    Токен      = ПараметрыФункции["Metrika_Token"];
    IDСчетчика = ПараметрыФункции["Metrika_CounterID"];

    Результат = OPI_YandexMetrika.УдалитьСчетчик(Токен, IDСчетчика);

    // END

    Обработать(Результат, "YandexMetrika", "УдалитьСчетчик");

КонецПроцедуры

Процедура YandexMetrika_ИзменитьСчетчик(ПараметрыФункции)

    Токен      = ПараметрыФункции["Metrika_Token"];
    IDСчетчика = ПараметрыФункции["Metrika_CounterID"];

    СтруктураСчетчика = Новый Структура;
    СтруктураСчетчика.Вставить("autogoals_enabled", Истина);

    СтруктураФлагов = Новый Структура;
    СтруктураФлагов.Вставить("collect_first_party_data"             , Ложь);
    СтруктураФлагов.Вставить("measurement_enabled"                  , Ложь);
    СтруктураФлагов.Вставить("use_in_benchmarks"                    , Ложь);
    СтруктураФлагов.Вставить("direct_allow_use_goals_without_access", Ложь);

    СтруктураСчетчика.Вставить("counter_flags", СтруктураФлагов);
    СтруктураСчетчика.Вставить("favorite"     , 0);
    СтруктураСчетчика.Вставить("filter_robots", 1);

    Результат = OPI_YandexMetrika.ИзменитьСчетчик(Токен, IDСчетчика, СтруктураСчетчика);

    // END

    Обработать(Результат, "YandexMetrika", "ИзменитьСчетчик");

КонецПроцедуры

Процедура YandexMetrika_ПолучитьСчетчик(ПараметрыФункции)

    Токен      = ПараметрыФункции["Metrika_Token"];
    IDСчетчика = ПараметрыФункции["Metrika_CounterID"];

    Результат = OPI_YandexMetrika.ПолучитьСчетчик(Токен, IDСчетчика);

    // END

    Обработать(Результат, "YandexMetrika", "ПолучитьСчетчик");

КонецПроцедуры

Процедура YandexMetrika_ВосстановитьСчетчик(ПараметрыФункции)

    Токен      = ПараметрыФункции["Metrika_Token"];
    IDСчетчика = ПараметрыФункции["Metrika_CounterID"];

    Результат = OPI_YandexMetrika.ВосстановитьСчетчик(Токен, IDСчетчика);

    // END

    Обработать(Результат, "YandexMetrika", "ВосстановитьСчетчик");

КонецПроцедуры

Процедура YandexMetrika_ПолучитьСписокСчетчиков(ПараметрыФункции)

    Токен      = ПараметрыФункции["Metrika_Token"];
    IDСчетчика = ПараметрыФункции["Metrika_CounterID"];

    Результат = OPI_YandexMetrika.ПолучитьСписокСчетчиков(Токен);

    Обработать(Результат, "YandexMetrika", "ПолучитьСписокСчетчиков"); // SKIP

    // Фильтр по списку ID

    Фильтр = Новый Структура;

    МассивСчетчиков = Новый Массив;
    МассивСчетчиков.Добавить(IDСчетчика);

    Фильтр.Вставить("counter_ids", МассивСчетчиков);

    Результат = OPI_YandexMetrika.ПолучитьСписокСчетчиков(Токен, Фильтр);

    // END

    Обработать(Результат, "YandexMetrika", "ПолучитьСписокСчетчиков", "Фильтр");

КонецПроцедуры

Процедура YandexMetrika_ПолучитьСписокОпераций(ПараметрыФункции)

    Токен      = ПараметрыФункции["Metrika_Token"];
    IDСчетчика = ПараметрыФункции["Metrika_CounterID"];

    Результат = OPI_YandexMetrika.ПолучитьСписокОпераций(Токен, IDСчетчика);

    // END

    Обработать(Результат, "YandexMetrika", "ПолучитьСписокОпераций");

КонецПроцедуры

#КонецОбласти

#Область S3

Процедура S3_ПолучитьСтруктуруДанных(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Результат = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    // END

    Обработать(Результат, "S3", "ПолучитьСтруктуруДанных");

КонецПроцедуры

Процедура S3_ОтправитьЗапросБезТела(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"] + "/opi-newbucket2";
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);
    Метод          = "GET";

    Результат = OPI_S3.ОтправитьЗапросБезТела(Метод, ОсновныеДанные);

    // END

    Обработать(Результат, "S3", "ОтправитьЗапросБезТела");

КонецПроцедуры

Процедура S3_ОтправитьЗапросСТелом(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Метод = "PUT";
    Тело  = "C:\test_data\document.docx";  // URL, Путь или Двоичные данные

    Результат = OPI_S3.ОтправитьЗапросСТелом(Метод, ОсновныеДанные, Тело);

    // END

    Обработать(Результат, "S3", "ОтправитьЗапросСТелом");

КонецПроцедуры

Процедура S3_СоздатьБакет(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УдалитьБакет(Наименование, ОсновныеДанные, Каталог); // SKIP
    Обработать(Результат, "S3", "СоздатьБакет", "Удаление");                // SKIP

    Результат = OPI_S3.СоздатьБакет(Наименование, ОсновныеДанные, Каталог);

    // END

    Обработать(Результат, "S3", "СоздатьБакет");

КонецПроцедуры

Процедура S3_УдалитьБакет(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УдалитьБакет(Наименование, ОсновныеДанные, Каталог);

    // END

    Обработать(Результат, "S3", "УдалитьБакет");

КонецПроцедуры

Процедура S3_ПолучитьСписокБакетов(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);
    Результат      = OPI_S3.ПолучитьСписокБакетов(ОсновныеДанные);

    // END

    Обработать(Результат, "S3", "ПолучитьСписокБакетов");

КонецПроцедуры

Процедура S3_ПроверитьДоступностьБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПроверитьДоступностьБакета(Наименование, ОсновныеДанные, Каталог);

    Обработать(Результат, "S3", "ПроверитьДоступностьБакета"); // SKIP

    Результат = OPI_S3.ПроверитьДоступностьБакета(Наименование, ОсновныеДанные, Каталог, "1234");

    // END

    Обработать(Результат, "S3", "ПроверитьДоступностьБакета", "Аккаунт");

КонецПроцедуры

Процедура S3_ПолучитьШифрованиеБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПолучитьШифрованиеБакета(Наименование, ОсновныеДанные, Каталог);

    // END

    Обработать(Результат, "S3", "ПолучитьШифрованиеБакета");

КонецПроцедуры

Процедура S3_УдалитьШифрованиеБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УдалитьШифрованиеБакета(Наименование, ОсновныеДанные, Каталог);

    // END

    Обработать(Результат, "S3", "УдалитьШифрованиеБакета");

КонецПроцедуры

Процедура S3_УстановитьШифрованиеБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    XMLКонфигурация = "<ServerSideEncryptionConfiguration xmlns=""http://s3.amazonaws.com/doc/2006-03-01/"">
                      | <Rule>
                      | <ApplyServerSideEncryptionByDefault>
                      | <SSEAlgorithm>AES256</SSEAlgorithm>
                      | </ApplyServerSideEncryptionByDefault>
                      | </Rule>
                      |</ServerSideEncryptionConfiguration>";

    ИВФ             = ПолучитьИмяВременногоФайла("xml");                       // SKIP
    ПолучитьДвоичныеДанныеИзСтроки(XMLКонфигурация).Записать(ИВФ); // SKIP
    XMLКонфигурация = ИВФ;                                         // SKIP

    Результат = OPI_S3.УстановитьШифрованиеБакета(Наименование, ОсновныеДанные, XMLКонфигурация, Каталог);

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(XMLКонфигурация, "Ошибка удаления файла после теста");

    Обработать(Результат, "S3", "УстановитьШифрованиеБакета");

КонецПроцедуры

Процедура S3_ПолучитьТегиБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПолучитьТегиБакета(Наименование, ОсновныеДанные, Каталог);

    // END

    Обработать(Результат, "S3", "ПолучитьТегиБакета");

КонецПроцедуры

Процедура S3_УстановитьТегиБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    СтруктураТегов = Новый Структура;
    СтруктураТегов.Вставить("MyTag1", "SomeValue");
    СтруктураТегов.Вставить("MyTag2", "AnotherOne");

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УстановитьТегиБакета(Наименование, ОсновныеДанные, СтруктураТегов);

    // END

    Обработать(Результат, "S3", "УстановитьТегиБакета");

КонецПроцедуры

Процедура S3_УдалитьТегиБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УдалитьТегиБакета(Наименование, ОсновныеДанные);

    // END

    Обработать(Результат, "S3", "УдалитьТегиБакета");

КонецПроцедуры

Процедура S3_ПолучитьНастройкийВерсионированияБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПолучитьНастройкийВерсионированияБакета(Наименование, ОсновныеДанные);

    // END

    Обработать(Результат, "S3", "ПолучитьНастройкийВерсионированияБакета");

КонецПроцедуры

Процедура S3_УстановитьНастройкиВерсионированияБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);
    Статус         = Истина;

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УстановитьНастройкиВерсионированияБакета(Наименование, ОсновныеДанные, Статус);

    // END

    Обработать(Результат, "S3", "УстановитьНастройкиВерсионированияБакета");

КонецПроцедуры

Процедура S3_ЗагрузитьОбъект(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Наименование = "picture.jpg";
    Содержимое   = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_S3.ЗагрузитьОбъект(Наименование, Бакет, Содержимое, ОсновныеДанные, , Каталог);

    Обработать(Результат, "S3", "ЗагрузитьОбъект"); // SKIP

    Наименование = "fileChunked.mp3";
    Содержимое   = ПараметрыФункции["Audio"]; // URL, Путь или Двоичные данные

    ОсновныеДанные.Вставить("ChunkSize", 5242880); // Размер части для загрузки в несколько запросов

    Результат = OPI_S3.ЗагрузитьОбъект(Наименование, Бакет, Содержимое, ОсновныеДанные, , Каталог);

    // END

    Обработать(Результат, "S3", "ЗагрузитьОбъект", "Частями");

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные, , , Каталог);

КонецПроцедуры

Процедура S3_ЗагрузитьОбъектЦеликом(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "pictureSmall.jpg";
    Содержимое   = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ЗагрузитьОбъектЦеликом(Наименование, Бакет, Содержимое, ОсновныеДанные, , Каталог);

    // END

    Обработать(Результат, "S3", "ЗагрузитьОбъектЦеликом");

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные, , , Каталог);

КонецПроцедуры

Процедура S3_УдалитьОбъект(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные, , , Каталог);

    // END

    Обработать(Результат, "S3", "УдалитьОбъект");

КонецПроцедуры

Процедура S3_ПолучитьОписаниеОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПолучитьОписаниеОбъекта(Наименование, Бакет, ОсновныеДанные, , , Каталог);

    // END

    Обработать(Результат, "S3", "ПолучитьОписаниеОбъекта");

КонецПроцедуры

Процедура S3_КопироватьОбъект(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    ПутьИсточник  = "picture.jpg";
    БакетИсточник = "newbucket2";

    ПутьПриемник  = "new_picture.jpg";
    БакетПриемник = ПараметрыФункции["S3_DB"];
    БакетПриемник = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.КопироватьОбъект(ПутьИсточник, БакетИсточник, ПутьПриемник, БакетПриемник, ОсновныеДанные, , Каталог);

    // END

    Обработать(Результат, "S3", "КопироватьОбъект");

    OPI_S3.УдалитьОбъект(ПутьПриемник, БакетПриемник, ОсновныеДанные, , , Каталог);

КонецПроцедуры

Процедура S3_УстановитьТегиОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    СтруктураТегов = Новый Структура;

    СтруктураТегов.Вставить("MyTag1", "SomeValue");
    СтруктураТегов.Вставить("MyTag2", "AnotherOne");

    Результат = OPI_S3.УстановитьТегиОбъекта(Наименование, Бакет, ОсновныеДанные, СтруктураТегов, , Каталог);

    // END

    Обработать(Результат, "S3", "УстановитьТегиОбъекта");

КонецПроцедуры

Процедура S3_ПолучитьТегиОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПолучитьТегиОбъекта(Наименование, Бакет, ОсновныеДанные, , , Каталог);

    // END

    Обработать(Результат, "S3", "ПолучитьТегиОбъекта");

КонецПроцедуры

Процедура S3_УдалитьТегиОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УдалитьТегиОбъекта(Наименование, Бакет, ОсновныеДанные, , , Каталог);

    // END

    Обработать(Результат, "S3", "УдалитьТегиОбъекта");

КонецПроцедуры

Процедура S3_ПолучитьСписокОбъектов(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПолучитьСписокОбъектов(Бакет, ОсновныеДанные, , , , Каталог);

    // END

    Обработать(Результат, "S3", "ПолучитьСписокОбъектов");

КонецПроцедуры

Процедура S3_ПолучитьСписокВерсийОбъектов(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Префикс   = "pic";
    Результат = OPI_S3.ПолучитьСписокВерсийОбъектов(Бакет, ОсновныеДанные, Префикс, , , Каталог);

    // END

    Обработать(Результат, "S3", "ПолучитьСписокВерсийОбъектов");

КонецПроцедуры

Процедура S3_ПолучитьОбъект(ПараметрыФункции)

    Картинка          = ПараметрыФункции["Picture"];          // SKIP
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // SKIP
    НеобходимыйРазмер = Картинка.Размер();                    // SKIP

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПолучитьОбъект(Наименование, Бакет, ОсновныеДанные, , , , Каталог);

    Обработать(Результат, "S3", "ПолучитьОбъект", , НеобходимыйРазмер); // SKIP

    ВременныйФайл = ПолучитьИмяВременногоФайла();
    ОсновныеДанные.Вставить("ChunkSize", 200000);

    Результат = OPI_S3.ПолучитьОбъект(Наименование, Бакет, ОсновныеДанные, , , ВременныйФайл);

    // END

    Обработать(Результат, "S3", "ПолучитьОбъект", "Файл", НеобходимыйРазмер);

    Наименование = "bigfile.exe";
    Бакет        = "newbucket2";

    ВременныйФайлБольшой = ПолучитьИмяВременногоФайла();
    Результат            = OPI_S3.ПолучитьОбъект(Наименование, Бакет, ОсновныеДанные, , , ВременныйФайлБольшой);

    Обработать(Результат, "S3", "ПолучитьОбъект", "Большой файл", 34432400);

    Результат = OPI_S3.ПолучитьОбъект(Наименование, Бакет, ОсновныеДанные);

    Обработать(Результат, "S3", "ПолучитьОбъект", "Большой ДД", 34432400);

    OPI_Инструменты.УдалитьФайлВПопытке(ВременныйФайлБольшой, "Не удалось удалить временный файл после теста!");
    OPI_Инструменты.УдалитьФайлВПопытке(ВременныйФайл       , "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура S3_ИнициализироватьЗагрузкуЧастями(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "fileChunked.mp3";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Содержимое = ПараметрыФункции["Audio"]; // URL, Путь или Двоичные данные
    Содержимое = OPI_ЗапросыHTTP.Get(Содержимое);

    Результат = OPI_S3.ИнициализироватьЗагрузкуЧастями(Наименование, Бакет, ОсновныеДанные, , Каталог);
    // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

    Обработать(Результат, "S3", "ИнициализироватьЗагрузкуЧастями"); // SKIP

    IDЗагрузки    = Результат["response"]["InitiateMultipartUploadResult"]["UploadId"];
    ОбщийРазмер   = Содержимое.Размер();
    РазмерУчастка = 5242880;
    ПрочитаноБайт = 0;
    НомерЧасти    = 1;

    ЧтениеДанных  = Новый ЧтениеДанных(Содержимое);
    ИсходныйПоток = ЧтениеДанных.ИсходныйПоток();
    МассивТегов   = Новый Массив;

    Пока ПрочитаноБайт < ОбщийРазмер Цикл

        ТекущееЧтение = ЧтениеДанных.Прочитать(РазмерУчастка);
        ТекущиеДанные = ТекущееЧтение.ПолучитьДвоичныеДанные();

        Если ТекущиеДанные.Размер() = 0 Тогда
            Прервать;
        КонецЕсли;

        Результат = OPI_S3.ЗагрузитьЧастьОбъекта(Наименование
            , Бакет
            , ОсновныеДанные
            , IDЗагрузки
            , НомерЧасти
            , ТекущиеДанные
            , Каталог);

        Обработать(Результат, "S3", "ИнициализироватьЗагрузкуЧастями", "Часть"); // SKIP

        ПрочитаноБайт = ИсходныйПоток.ТекущаяПозиция();

        ETag = Результат["headers"]["Etag"];
        ETag = ?(ETag = Неопределено, Результат["headers"]["ETag"], ETag);

        МассивТегов.Добавить(ETag);

        НомерЧасти = НомерЧасти + 1;

    КонецЦикла;

    Результат = OPI_S3.ЗавершитьЗагрузкуЧастями(Наименование, Бакет, ОсновныеДанные, IDЗагрузки, МассивТегов, , Каталог);

    // END

    Обработать(Результат, "S3", "ИнициализироватьЗагрузкуЧастями", "Завершение");

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные);

КонецПроцедуры

Процедура S3_ЗавершитьЗагрузкуЧастями(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "fileChunked.mp3";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Содержимое = ПараметрыФункции["Audio"]; // URL, Путь или Двоичные данные
    Содержимое = OPI_ЗапросыHTTP.Get(Содержимое);

    Результат = OPI_S3.ИнициализироватьЗагрузкуЧастями(Наименование, Бакет, ОсновныеДанные, , Каталог);

    Обработать(Результат, "S3", "ЗавершитьЗагрузкуЧастями", "Начало"); // SKIP

    IDЗагрузки    = Результат["response"]["InitiateMultipartUploadResult"]["UploadId"];
    ОбщийРазмер   = Содержимое.Размер();
    РазмерУчастка = 5242880;
    ПрочитаноБайт = 0;
    НомерЧасти    = 1;

    ЧтениеДанных  = Новый ЧтениеДанных(Содержимое);
    ИсходныйПоток = ЧтениеДанных.ИсходныйПоток();
    МассивТегов   = Новый Массив;

    Пока ПрочитаноБайт < ОбщийРазмер Цикл

        ТекущееЧтение = ЧтениеДанных.Прочитать(РазмерУчастка);
        ТекущиеДанные = ТекущееЧтение.ПолучитьДвоичныеДанные();

        Если ТекущиеДанные.Размер() = 0 Тогда
            Прервать;
        КонецЕсли;

        Результат = OPI_S3.ЗагрузитьЧастьОбъекта(Наименование
            , Бакет
            , ОсновныеДанные
            , IDЗагрузки
            , НомерЧасти
            , ТекущиеДанные
            , Каталог);

        Обработать(Результат, "S3", "ЗавершитьЗагрузкуЧастями", "Часть"); // SKIP

        ПрочитаноБайт = ИсходныйПоток.ТекущаяПозиция();

        ETag = Результат["headers"]["Etag"];
        ETag = ?(ETag = Неопределено, Результат["headers"]["ETag"], ETag);

        МассивТегов.Добавить(ETag);

        НомерЧасти = НомерЧасти + 1;

    КонецЦикла;

    Результат = OPI_S3.ЗавершитьЗагрузкуЧастями(Наименование, Бакет, ОсновныеДанные, IDЗагрузки, МассивТегов, , Каталог);
    // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

    // END

    Обработать(Результат, "S3", "ЗавершитьЗагрузкуЧастями");

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные);

КонецПроцедуры

Процедура S3_ЗагрузитьЧастьОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "fileChunked.mp3";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Содержимое = ПараметрыФункции["Audio"]; // URL, Путь или Двоичные данные
    Содержимое = OPI_ЗапросыHTTP.Get(Содержимое);

    Результат = OPI_S3.ИнициализироватьЗагрузкуЧастями(Наименование, Бакет, ОсновныеДанные, , Каталог);

    Обработать(Результат, "S3", "ЗагрузитьЧастьОбъекта", "Начало"); // SKIP

    IDЗагрузки    = Результат["response"]["InitiateMultipartUploadResult"]["UploadId"];
    ОбщийРазмер   = Содержимое.Размер();
    РазмерУчастка = 5242880;
    ПрочитаноБайт = 0;
    НомерЧасти    = 1;

    ЧтениеДанных  = Новый ЧтениеДанных(Содержимое);
    ИсходныйПоток = ЧтениеДанных.ИсходныйПоток();
    МассивТегов   = Новый Массив;

    Пока ПрочитаноБайт < ОбщийРазмер Цикл

        ТекущееЧтение = ЧтениеДанных.Прочитать(РазмерУчастка);
        ТекущиеДанные = ТекущееЧтение.ПолучитьДвоичныеДанные();

        Если ТекущиеДанные.Размер() = 0 Тогда
            Прервать;
        КонецЕсли;

        Результат = OPI_S3.ЗагрузитьЧастьОбъекта(Наименование
            , Бакет
            , ОсновныеДанные
            , IDЗагрузки
            , НомерЧасти
            , ТекущиеДанные
            , Каталог);

        // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

        Обработать(Результат, "S3", "ЗагрузитьЧастьОбъекта"); // SKIP

        ПрочитаноБайт = ИсходныйПоток.ТекущаяПозиция();

        ETag = Результат["headers"]["Etag"];
        ETag = ?(ETag = Неопределено, Результат["headers"]["ETag"], ETag);

        МассивТегов.Добавить(ETag);

        НомерЧасти = НомерЧасти + 1;

    КонецЦикла;

    Результат = OPI_S3.ЗавершитьЗагрузкуЧастями(Наименование, Бакет, ОсновныеДанные, IDЗагрузки, МассивТегов, , Каталог);

    // END

    Обработать(Результат, "S3", "ЗагрузитьЧастьОбъекта", "Завершение"); // SKIP

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные);

КонецПроцедуры

Процедура S3_ОтменитьЗагрузкуЧастями(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "fileChunked.mp3";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Начало     = OPI_S3.ИнициализироватьЗагрузкуЧастями(Наименование, Бакет, ОсновныеДанные, , Каталог);
    IDЗагрузки = Начало["response"]["InitiateMultipartUploadResult"]["UploadId"];

    Результат = OPI_S3.ОтменитьЗагрузкуЧастями(Наименование, Бакет, ОсновныеДанные, IDЗагрузки, , Каталог);

    // END

    Обработать(Результат, "S3", "ОтменитьЗагрузкуЧастями");

КонецПроцедуры

Процедура S3_ПолучитьСсылкуСкачиванияОбъекта(ПараметрыФункции)

    Картинка          = ПараметрыФункции["Picture"];          // SKIP
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // SKIP
    НеобходимыйРазмер = Картинка.Размер();                    // SKIP

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.ПолучитьСсылкуСкачиванияОбъекта(Наименование, Бакет, ОсновныеДанные, 7200, , Каталог);

    // END

    Обработать(Результат, "S3", "ПолучитьСсылкуСкачиванияОбъекта");

    Результат = OPI_ЗапросыHTTP.Get(Результат);

    Обработать(Результат, "S3", "ПолучитьСсылкуСкачиванияОбъекта", "Проверка", НеобходимыйРазмер);

КонецПроцедуры

Процедура S3_ПолучитьСсылкуЗагрузкиОбъекта(ПараметрыФункции)

    Картинка          = ПараметрыФункции["Picture"];          // SKIP
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // SKIP
    НеобходимыйРазмер = Картинка.Размер();                    // SKIP

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(URL, AccessKey, SecretKey, Region);

    Наименование = "pictureU.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = "newbucket2";

    Результат = OPI_S3.ПолучитьСсылкуЗагрузкиОбъекта(Наименование, Бакет, ОсновныеДанные, 7200, , Каталог);

    // END

    Обработать(Результат, "S3", "ПолучитьСсылкуЗагрузкиОбъекта");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(Результат)
        .УстановитьДвоичноеТело(Картинка)
        .ОбработатьЗапрос("PUT");

    Обработать(Результат, "S3", "ПолучитьСсылкуЗагрузкиОбъекта", "Загрузка");

    Проверка = OPI_S3.ПолучитьОписаниеОбъекта(Наименование, Бакет, ОсновныеДанные);

    Обработать(Проверка, "S3", "ПолучитьСсылкуЗагрузкиОбъекта", "Проверка", НеобходимыйРазмер);

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные);

КонецПроцедуры

#КонецОбласти

#Область TCP

Процедура TCP_ОткрытьСоединение(ПараметрыФункции)

    Адрес      = ПараметрыФункции["TCP_Address"];
    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);

    Обработать(Соединение, "TCP", "ОткрытьСоединение"); // SKIP

    OPI_TCP.ЗакрытьСоединение(Соединение);

    Адрес = "tcpbin.com:4243";
    Tls   = OPI_TCP.ПолучитьНастройкиTLS(Истина);

    ПроксиПользователь = ПараметрыФункции["Proxy_User"];
    ПроксиПароль       = ПараметрыФункции["Proxy_Password"];
    ПроксиАдрес        = ПараметрыФункции["Socks5_IP"];
    ПроксиПорт         = ПараметрыФункции["Socks5_Port"];

    ПроксиАдрес = ?(ПроксиАдрес = "127.0.0.1", OPI_ПолучениеДанныхТестов.ПолучитьLocalhost(), ПроксиАдрес); // SKIP

    Прокси = OPI_TCP.ПолучитьНастройкиПрокси(ПроксиАдрес, ПроксиПорт, "socks5", ПроксиПользователь, ПроксиПароль);
    Tls    = OPI_TCP.ПолучитьНастройкиTLS(Истина);

    Соединение = OPI_TCP.ОткрытьСоединение(Адрес, TLS, Прокси);

    // END

    Обработать(Соединение, "TCP", "ОткрытьСоединение", "TLS");

КонецПроцедуры

Процедура TCP_ЗакрытьСоединение(ПараметрыФункции)

    Адрес      = ПараметрыФункции["TCP_Address"];
    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);

    Результат = OPI_TCP.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "TCP", "ЗакрытьСоединение");

КонецПроцедуры

Процедура TCP_ПрочитатьДвоичныеДанные(ПараметрыФункции)

    Адрес      = ПараметрыФункции["TCP_Address"];
    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);
    Сообщение  = "Hello server!" + Символы.ПС;
    Данные     = ПолучитьДвоичныеДанныеИзСтроки(Сообщение);

    OPI_TCP.ОтправитьДвоичныеДанные(Соединение, Данные);

    // Маркер конца сообщения для исключения ожидания конца таймаута
    Маркер    = Символы.ПС;
    Результат = OPI_TCP.ПрочитатьДвоичныеДанные(Соединение, , Маркер);
    // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

    OPI_TCP.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "TCP", "ПрочитатьДвоичныеДанные", , Сообщение);

    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);

    OPI_TCP.ОтправитьДвоичныеДанные(Соединение, Данные);
    Результат = OPI_TCP.ПрочитатьДвоичныеДанные(Соединение, , , 50000);

    OPI_TCP.ЗакрытьСоединение(Соединение);

    Обработать(Результат, "TCP", "ПрочитатьДвоичныеДанные", "Таймаут", Сообщение);

КонецПроцедуры

Процедура TCP_ОтправитьДвоичныеДанные(ПараметрыФункции)

    Адрес      = ПараметрыФункции["TCP_Address"];
    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);
    Сообщение  = "Hello server!" + Символы.ПС;
    Данные     = ПолучитьДвоичныеДанныеИзСтроки(Сообщение);

    Результат = OPI_TCP.ОтправитьДвоичныеДанные(Соединение, Данные);
    // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

    // Маркер конца сообщения для исключения ожидания конца таймаута
    Маркер = Символы.ПС;
    Ответ  = OPI_TCP.ПрочитатьДвоичныеДанные(Соединение, , Маркер);

    OPI_TCP.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Ответ, "TCP", "ОтправитьДвоичныеДанные", , Сообщение);

    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);

    OPI_TCP.ОтправитьДвоичныеДанные(Соединение, Данные);
    Результат = OPI_TCP.ПрочитатьДвоичныеДанные(Соединение, , , 50000);

    OPI_TCP.ЗакрытьСоединение(Соединение);

    Обработать(Результат, "TCP", "ОтправитьДвоичныеДанные", "Таймаут", Сообщение);

КонецПроцедуры

Процедура TCP_ОбработатьЗапрос(ПараметрыФункции)

    Адрес  = ПараметрыФункции["TCP_Address"];
    Данные = "Echo this!" + Символы.ПС;

    Результат = OPI_TCP.ОбработатьЗапрос(Адрес, Данные);

    Обработать(Результат, "TCP", "ОбработатьЗапрос", , "Echo this!" + Символы.ПС); // SKIP

    Адрес = ПараметрыФункции["TCP_AddressTLS"];

    ПроксиПользователь = ПараметрыФункции["Proxy_User"];
    ПроксиПароль       = ПараметрыФункции["Proxy_Password"];
    ПроксиАдрес        = ПараметрыФункции["Socks5_IP"];
    ПроксиПорт         = ПараметрыФункции["Socks5_Port"];

    ПроксиАдрес = ?(ПроксиАдрес = "127.0.0.1", OPI_ПолучениеДанныхТестов.ПолучитьLocalhost(), ПроксиАдрес); // SKIP

    Прокси = OPI_TCP.ПолучитьНастройкиПрокси(ПроксиАдрес, ПроксиПорт, "socks5", ПроксиПользователь, ПроксиПароль);
    Tls    = OPI_TCP.ПолучитьНастройкиTLS(Истина);

    Результат = OPI_TCP.ОбработатьЗапрос(Адрес, Данные, , Tls, Прокси);

    // END

    Обработать(Результат, "TCP", "ОбработатьЗапрос", "TLS", "Echo this!" + Символы.ПС);

КонецПроцедуры

Процедура TCP_ПрочитатьСтроку(ПараметрыФункции)

    Адрес      = ПараметрыФункции["TCP_Address"];
    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);
    Данные     = "Hello server!" + Символы.ПС;

    OPI_TCP.ОтправитьСтроку(Соединение, Данные);

    // Маркер конца сообщения для исключения ожидания конца таймаута
    Маркер    = Символы.ПС;
    Результат = OPI_TCP.ПрочитатьСтроку(Соединение, , Маркер);
    // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

    OPI_TCP.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "TCP", "ПрочитатьСтроку", , Данные);

    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);

    OPI_TCP.ОтправитьСтроку(Соединение, Данные);
    Результат = OPI_TCP.ПрочитатьСтроку(Соединение, , , 50000);

    OPI_TCP.ЗакрытьСоединение(Соединение);

    Обработать(Результат, "TCP", "ПрочитатьСтроку", "Таймаут", Данные);

КонецПроцедуры

Процедура TCP_ОтправитьСтроку(ПараметрыФункции)

    Адрес      = ПараметрыФункции["TCP_Address"];
    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);
    Данные     = "Hello server!" + Символы.ПС;

    Результат = OPI_TCP.ОтправитьСтроку(Соединение, Данные);
    // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

    // Маркер конца сообщения для исключения ожидания конца таймаута
    Маркер = Символы.ПС;
    Ответ  = OPI_TCP.ПрочитатьСтроку(Соединение, , Маркер);

    OPI_TCP.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Ответ, "TCP", "ОтправитьСтроку", , Данные);

    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);

    OPI_TCP.ОтправитьСтроку(Соединение, Данные);
    Результат = OPI_TCP.ПрочитатьСтроку(Соединение, , , 50000);

    OPI_TCP.ЗакрытьСоединение(Соединение);

    Обработать(Результат, "TCP", "ОтправитьСтроку", "Таймаут", Данные);

КонецПроцедуры

Процедура TCP_ПолучитьНастройкиTLS(ПараметрыФункции)

    Результат = OPI_TCP.ПолучитьНастройкиTLS(Истина);

    // END

    Обработать(Результат, "TCP", "ПолучитьНастройкиTLS");

КонецПроцедуры

Процедура TCP_ПолучитьПоследнююОшибку(ПараметрыФункции)

    Адрес      = ПараметрыФункции["TCP_Address"];
    Соединение = OPI_TCP.ОткрытьСоединение(Адрес);
    Данные     = "Hello server!" + Символы.ПС;

    Отправка  = OPI_TCP.ОтправитьСтроку(Соединение, Данные);
    Результат = OPI_TCP.ПолучитьПоследнююОшибку(Соединение);                                               // SKIP

    // END

    Обработать(Результат, "TCP", "ПолучитьПоследнююОшибку");

КонецПроцедуры

Процедура TCP_ПолучитьНастройкиПрокси(ПараметрыФункции)

    ТипПрокси = "socks5"; // http, socks5, socks4

    АдресПрокси  = ПараметрыФункции["Socks5_IP"];
    ПортПрокси   = ПараметрыФункции["Socks5_Port"];
    ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
    ПарольПрокси = ПараметрыФункции["Proxy_Password"];

    Результат = OPI_TCP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    // END

    Обработать(Результат, "TCP", "ПолучитьНастройкиПрокси");

КонецПроцедуры

#КонецОбласти

#Область SQLite

Процедура SQLite_ОткрытьСоединение(ПараметрыФункции)

    ИВФ = ПолучитьИмяВременногоФайла("sqlite");

    БазаНаДиске = OPI_SQLite.ОткрытьСоединение(ИВФ);
    БазаВПамяти = OPI_SQLite.ОткрытьСоединение();

    // END

    Обработать(БазаНаДиске, "SQLite", "ОткрытьСоединение");
    Обработать(БазаВПамяти, "SQLite", "ОткрытьСоединение", "IM");

    Закрытие = OPI_SQLite.ЗакрытьСоединение(БазаНаДиске);

    Обработать(Закрытие, "SQLite", "ОткрытьСоединение", "Закрытие");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла базы");

КонецПроцедуры

Процедура SQLite_ЗакрытьСоединение(ПараметрыФункции)

    ИВФ = ПолучитьИмяВременногоФайла("sqlite");

    Соединение = OPI_SQLite.ОткрытьСоединение(ИВФ);

    Обработать(Соединение, "SQLite", "ЗакрытьСоединение", "Открытие"); // SKIP

    Закрытие = OPI_SQLite.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Закрытие, "SQLite", "ЗакрытьСоединение");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла базы");

КонецПроцедуры

Процедура SQLite_ВыполнитьЗапросSQL(ПараметрыФункции)

    ИВФ = ПолучитьИмяВременногоФайла("sqlite");

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    Соединение = OPI_SQLite.ОткрытьСоединение(ИВФ);

    Обработать(Соединение, "SQLite", "ВыполнитьЗапросSQL", "Открытие");  // SKIP

    // CREATE

    ТекстЗапроса = "
                   |CREATE TABLE test_table (
                   |id INTEGER PRIMARY KEY,
                   |name TEXT,
                   |age INTEGER,
                   |salary REAL,
                   |is_active BOOLEAN,
                   |created_at DATETIME,
                   |data BLOB
                   |);";

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Create"); // SKIP

    // INSERT с параметрами

    ТекстЗапроса = "
                   |INSERT INTO test_table (name, age, salary, is_active, created_at, data)
                   |VALUES (?1, ?2, ?3, ?4, ?5, ?6);";

    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить("Vitaly");                              // TEXT
    МассивПараметров.Добавить(25);                                    // INTEGER
    МассивПараметров.Добавить(1000.12);                               // REAL
    МассивПараметров.Добавить(Истина);                                // BOOL
    МассивПараметров.Добавить(OPI_Инструменты.ПолучитьТекущуюДату()); // DATETIME
    МассивПараметров.Добавить(Новый Структура("blob", Картинка));     // BLOB

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, МассивПараметров, , Соединение);

    Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Insert"); // SKIP

    // SELECT (Результат этого запроса приведен в следующем блоке)

    ТекстЗапроса = "SELECT id, name, age, salary, is_active, created_at, data FROM test_table;";

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", , Картинка); // SKIP

    // Транзакция

    ТекстЗапроса = "BEGIN TRANSACTION;
                   |    CREATE TABLE IF NOT EXISTS users (
                   |        id INTEGER PRIMARY KEY AUTOINCREMENT,
                   |        name TEXT NOT NULL,
                   |        age INTEGER NOT NULL
                   |    );
                   |    INSERT INTO users (name, age) VALUES ('Alice', 30);
                   |    INSERT INTO users (name, age) VALUES ('Bob', 25);
                   |    INSERT INTO users (name, age) VALUES ('Charlie', 35);
                   |    COMMIT;";

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Transaction");  // SKIP

    // С расширением

    Если OPI_Инструменты.ЭтоWindows() Тогда
        Расширение = ПараметрыФункции["SQLite_Ext"];      // URL, Путь или Двоичные данные
    Иначе
        Расширение = ПараметрыФункции["SQLite_ExtLinux"]; // URL, Путь или Двоичные данные
    КонецЕсли;

    ТочкаВхода = "sqlite3_uuid_init";

    СоответствиеРасширений = Новый Соответствие;
    СоответствиеРасширений.Вставить(Расширение, ТочкаВхода);

    ТекстЗапроса = "SELECT uuid4();";

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение, СоответствиеРасширений);

    Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Расширение"); // SKIP

    Закрытие = OPI_SQLite.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Закрытие");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла базы");

КонецПроцедуры

Процедура SQLite_ЭтоКоннектор(ПараметрыФункции)

    Соединение = OPI_SQLite.ОткрытьСоединение();
    Результат  = OPI_SQLite.ЭтоКоннектор(Соединение);

    // END

    Обработать(Результат, "SQLite", "ЭтоКоннектор");

КонецПроцедуры

Процедура SQLite_СоздатьТаблицу(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("id"        , "INTEGER PRIMARY KEY");
    СтруктураКолонок.Вставить("name"      , "TEXT");
    СтруктураКолонок.Вставить("age"       , "INTEGER");
    СтруктураКолонок.Вставить("salary"    , "REAL");
    СтруктураКолонок.Вставить("is_active" , "BOOLEAN");
    СтруктураКолонок.Вставить("created_at", "DATETIME");
    СтруктураКолонок.Вставить("data"      , "BLOB");

    Результат = OPI_SQLite.СоздатьТаблицу(Таблица, СтруктураКолонок, База);

    // END

    Обработать(Результат, "SQLite", "СоздатьТаблицу");

    СоответствиеКолонок = Новый Соответствие;
    СоответствиеКолонок.Вставить("id"                  , "INTEGER PRIMARY KEY");
    СоответствиеКолонок.Вставить("[Непонятная колонка]", "TEXT");

    Результат = OPI_SQLite.СоздатьТаблицу("test1", СоответствиеКолонок, База);

    Обработать(Результат, "SQLite", "СоздатьТаблицу", "Непонятная колонка");

КонецПроцедуры

Процедура SQLite_ДобавитьЗаписи(ПараметрыФункции)

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    ФайлКартинки = ПолучитьИмяВременногоФайла("png");
    Картинка.Записать(ФайлКартинки);                          // ФайлКартинки - Файл на диске

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    МассивДанных = Новый Массив;

    СтруктураСтроки1 = Новый Структура;
    СтруктураСтроки1.Вставить("name"      , "Vitaly");                              // TEXT
    СтруктураСтроки1.Вставить("age"       , 25);                                    // INTEGER
    СтруктураСтроки1.Вставить("salary"    , 1000.12);                               // REAL
    СтруктураСтроки1.Вставить("is_active" , Истина);                                // BOOL
    СтруктураСтроки1.Вставить("created_at", OPI_Инструменты.ПолучитьТекущуюДату()); // DATETIME
    СтруктураСтроки1.Вставить("data"      , Новый Структура("blob", Картинка));     // BLOB

    СтруктураСтроки2 = Новый Структура;
    СтруктураСтроки2.Вставить("name"      , "Lesha");                               // TEXT
    СтруктураСтроки2.Вставить("age"       , 20);                                    // INTEGER
    СтруктураСтроки2.Вставить("salary"    , 200.20);                                // REAL
    СтруктураСтроки2.Вставить("is_active" , Ложь);                                  // BOOL
    СтруктураСтроки2.Вставить("created_at", OPI_Инструменты.ПолучитьТекущуюДату()); // DATETIME
    СтруктураСтроки2.Вставить("data"      , Новый Структура("blob", ФайлКартинки)); // BLOB

    МассивДанных.Добавить(СтруктураСтроки1);
    МассивДанных.Добавить(СтруктураСтроки2);

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, МассивДанных, , База);

    // END

    Обработать(Результат, "SQLite", "ДобавитьЗаписи");

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, МассивДанных, Ложь, База);

    Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Без транзакции");

    СтруктураСтроки2.Вставить("error", "Lesha");
    МассивДанных.Добавить(СтруктураСтроки2);

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, МассивДанных, , База);
    Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Ошибка поля");

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, МассивДанных, Ложь, База);
    Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Ошибка без транзакции");

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, "not valid json", , База);
    Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Ошибка JSON");

    СоответствиеСтроки = Новый Соответствие;
    СоответствиеСтроки.Вставить("[Непонятная колонка]", "yo");

    Результат = OPI_SQLite.ДобавитьЗаписи("test1", СоответствиеСтроки, , База);
    Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Непонятная колонка");

    OPI_Инструменты.УдалитьФайлВПопытке(ФайлКартинки, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура SQLite_ПолучитьЗаписи(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Поля = Новый Массив;
    Поля.Добавить("name");
    Поля.Добавить("salary");

    Фильтры = Новый Массив;

    СтруктураФильтра1 = Новый Структура;

    СтруктураФильтра1.Вставить("field", "name");
    СтруктураФильтра1.Вставить("type" , "=");
    СтруктураФильтра1.Вставить("value", "Vitaly");
    СтруктураФильтра1.Вставить("union", "AND");
    СтруктураФильтра1.Вставить("raw"  , Ложь);

    СтруктураФильтра2 = Новый Структура;

    СтруктураФильтра2.Вставить("field", "age");
    СтруктураФильтра2.Вставить("type" , "BETWEEN");
    СтруктураФильтра2.Вставить("value", "20 AND 30");
    СтруктураФильтра2.Вставить("raw"  , Истина);

    Фильтры.Добавить(СтруктураФильтра1);
    Фильтры.Добавить(СтруктураФильтра2);

    Сортировка = Новый Структура("created_at", "DESC");
    Количество = 1;

    Результат = OPI_SQLite.ПолучитьЗаписи(Таблица, Поля, Фильтры, Сортировка, Количество, База);

    // END

    Обработать(Результат, "SQLite", "ПолучитьЗаписи");

    Результат = OPI_SQLite.ПолучитьЗаписи(Таблица, "['name','age','salary','is_active','created_at']", , , , База);

    Обработать(Результат, "SQLite", "ПолучитьЗаписи", "Без параметров");

    СтруктураФильтра2.Вставить("type", "BEETWEEN");
    Фильтры.Добавить(СтруктураФильтра2);

    Результат = OPI_SQLite.ПолучитьЗаписи(Таблица
        , "['name','age','salary','is_active','created_at']"
        , Фильтры
        ,
        ,
        , База);

    Обработать(Результат, "SQLite", "ПолучитьЗаписи", "Ошибка");

    Результат = OPI_SQLite.ПолучитьЗаписи("test1", , , , , База);

    Обработать(Результат, "SQLite", "ПолучитьЗаписи", "Непонятная колонка");

КонецПроцедуры

Процедура SQLite_ОбновитьЗаписи(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("name"  , "Vitaly A.");
    СтруктураПолей.Вставить("salary", "999999");

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "name");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", "Vitaly");
    СтруктураФильтра.Вставить("union", "AND");
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Результат = OPI_SQLite.ОбновитьЗаписи(Таблица, СтруктураПолей, СтруктураФильтра, База);

    // END

    Обработать(Результат, "SQLite", "ОбновитьЗаписи");

    СтруктураФильтра.Вставить("value", "Vitaly A.");

    Фильтры = Новый Массив;
    Фильтры.Добавить(СтруктураФильтра);

    Проверка = OPI_SQLite.ПолучитьЗаписи(Таблица, "['name','salary']", Фильтры, , , База);

    Обработать(Проверка, "SQLite", "ОбновитьЗаписи", "Проверка", СтруктураПолей);

КонецПроцедуры

Процедура SQLite_УдалитьЗаписи(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "name");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", "Vitaly A.");
    СтруктураФильтра.Вставить("union", "AND");
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Результат = OPI_SQLite.УдалитьЗаписи(Таблица, СтруктураФильтра, База);

    // END

    Обработать(Результат, "SQLite", "УдалитьЗаписи");

    Проверка = OPI_SQLite.ПолучитьЗаписи(Таблица, "['name','salary']", Фильтры, , , База);

    Обработать(Проверка, "SQLite", "УдалитьЗаписи", "Проверка");

КонецПроцедуры

Процедура SQLite_ПолучитьИнформациюОТаблице(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Результат = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    // END

    Обработать(Результат, "SQLite", "ПолучитьИнформациюОТаблице");

КонецПроцедуры

Процедура SQLite_ПолучитьСтруктуруФильтраЗаписей(ПараметрыФункции)

    Результат = OPI_SQLite.ПолучитьСтруктуруФильтраЗаписей();

    // END

    Обработать(Результат, "SQLite", "ПолучитьСтруктуруФильтраЗаписей");

    Результат = OPI_SQLite.ПолучитьСтруктуруФильтраЗаписей(Истина);

    Обработать(Результат, "SQLite", "ПолучитьСтруктуруФильтраЗаписей", "Пустая");

КонецПроцедуры

Процедура SQLite_УдалитьТаблицу(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Результат = OPI_SQLite.УдалитьТаблицу(Таблица, База);

    // END

    Обработать(Результат, "SQLite", "УдалитьТаблицу");

    Проверка = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    Обработать(Проверка, "SQLite", "УдалитьТаблицу", "Проверка");

    OPI_SQLite.УдалитьТаблицу("test1", База);

КонецПроцедуры

Процедура SQLite_ОчиститьТаблицу(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Результат = OPI_SQLite.ОчиститьТаблицу(Таблица, База);

    // END

    Обработать(Результат, "SQLite", "ОчиститьТаблицу");

    Проверка = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    Обработать(Проверка, "SQLite", "ОчиститьТаблицу", "Таблица");

    Проверка = OPI_SQLite.ПолучитьЗаписи(Таблица, , , , , База);

    Обработать(Проверка, "SQLite", "ОчиститьТаблицу", "Проверка");

КонецПроцедуры

Процедура SQLite_ПодключитьРасширение(ПараметрыФункции)

    Если OPI_Инструменты.ЭтоWindows() Тогда
        Расширение = ПараметрыФункции["SQLite_Ext"];      // URL, Путь или Двоичные данные
    Иначе
        Расширение = ПараметрыФункции["SQLite_ExtLinux"]; // URL, Путь или Двоичные данные
    КонецЕсли;

    База       = ПараметрыФункции["SQLite_DB"];
    ТочкаВхода = "sqlite3_uuid_init";

    Соединение = OPI_SQLite.ОткрытьСоединение(База);
    Результат  = OPI_SQLite.ПодключитьРасширение(Расширение, ТочкаВхода, Соединение);

    // END

    Обработать(Результат, "SQLite", "ПодключитьРасширение");

    ИВФ = ПолучитьИмяВременногоФайла("dll");
    КопироватьФайл(Расширение, ИВФ);

    Результат = OPI_SQLite.ПодключитьРасширение(ИВФ, ТочкаВхода, Соединение);

    Обработать(Результат, "SQLite", "ПодключитьРасширение", "Путь");

    Результат = OPI_SQLite.ПодключитьРасширение(Новый ДвоичныеДанные(ИВФ), ТочкаВхода, Соединение);

    Обработать(Результат, "SQLite", "ПодключитьРасширение", "Двоичные");

    Результат = OPI_SQLite.ЗакрытьСоединение(Соединение);

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла расширение");

КонецПроцедуры

Процедура SQLite_ДобавитьКолонкуТаблицы(ПараметрыФункции)

    База      = ПараметрыФункции["SQLite_DB"];
    Таблица   = "test";
    Имя       = "new_col";
    ТипДанных = "TEXT";

    Результат = OPI_SQLite.ДобавитьКолонкуТаблицы(Таблица, Имя, ТипДанных, База);

    // END

    Обработать(Результат, "SQLite", "ДобавитьКолонкуТаблицы");

    Результат = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    Обработать(Результат, "SQLite", "ДобавитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура SQLite_УдалитьКолонкуТаблицы(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";
    Имя     = "new_col";

    Результат = OPI_SQLite.УдалитьКолонкуТаблицы(Таблица, Имя, База);

    // END

    Обработать(Результат, "SQLite", "УдалитьКолонкуТаблицы");

    Результат = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    Обработать(Результат, "SQLite", "УдалитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура SQLite_ГарантироватьТаблицу(ПараметрыФункции)

    База = ПараметрыФункции["SQLite_DB"];

    Таблица = "test";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("id"        , "INTEGER");
    СтруктураКолонок.Вставить("code"      , "INTEGER");
    СтруктураКолонок.Вставить("name"      , "TEXT");
    СтруктураКолонок.Вставить("age"       , "INTEGER");
    СтруктураКолонок.Вставить("info"      , "TEXT");

    Результат = OPI_SQLite.ГарантироватьТаблицу(Таблица, СтруктураКолонок, База);

    // END

    Обработать(Результат, "SQLite", "ГарантироватьТаблицу");

    Проверка = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    Обработать(Проверка, "SQLite", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

    Таблица = "test_new";

    Результат = OPI_SQLite.ГарантироватьТаблицу(Таблица, СтруктураКолонок, База);

    Обработать(Результат, "SQLite", "ГарантироватьТаблицу", "Новая");

    Проверка = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    Обработать(Проверка, "SQLite", "ГарантироватьТаблицу", "Проверка 2", СтруктураКолонок);

КонецПроцедуры

#КонецОбласти

#Область PostgreSQL

Процедура PostgreSQL_СформироватьСтрокуПодключения(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "postgres";

    Результат = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    // END

    Результат = СтрЗаменить(Результат, Пароль, "***");
    Результат = СтрЗаменить(Результат, Адрес , "127.0.0.1");

    Обработать(Результат, "PostgreSQL", "СформироватьСтрокуПодключения");

КонецПроцедуры

Процедура PostgreSQL_ОткрытьСоединение(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "postgres";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Результат = OPI_PostgreSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    // END

    OPI_PostgreSQL.ЗакрытьСоединение(Результат);

    Обработать(Результат, "PostgreSQL", "ОткрытьСоединение");

КонецПроцедуры

Процедура PostgreSQL_ЗакрытьСоединение(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "postgres";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_PostgreSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);
    Результат  = OPI_PostgreSQL.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "PostgreSQL", "ЗакрытьСоединение");

КонецПроцедуры

Процедура PostgreSQL_ЭтоКоннектор(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "postgres";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_PostgreSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);
    Результат  = OPI_PostgreSQL.ЭтоКоннектор(Соединение);

    OPI_PostgreSQL.ЗакрытьСоединение(Результат);

    // END

    Обработать(Результат, "PostgreSQL", "ЭтоКоннектор");

КонецПроцедуры

Процедура PostgreSQL_ВыполнитьЗапросSQL(ПараметрыФункции)

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_PostgreSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    OPI_PostgreSQL.УдалитьТаблицу("users"     , Соединение);      // SKIP
    OPI_PostgreSQL.УдалитьТаблицу("test_data" , Соединение);      // SKIP
    OPI_PostgreSQL.УдалитьТаблицу("test_table", Соединение);     // SKIP

    Обработать(Соединение, "PostgreSQL", "ВыполнитьЗапросSQL", "Соединение");  // SKIP

    // CREATE

    ТекстЗапроса = "
                   |CREATE TABLE test_table (
                   |id SERIAL PRIMARY KEY,
                   |name NAME,
                   |age INT,
                   |salary REAL,
                   |is_active BOOL,
                   |created_at DATE,
                   |data BYTEA
                   |);";

    Результат = OPI_PostgreSQL.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "PostgreSQL", "ВыполнитьЗапросSQL", "Create"); // SKIP

    // INSERT с параметрами

    ТекстЗапроса = "
                   |INSERT INTO test_table (name, age, salary, is_active, created_at, data)
                   |VALUES ($1, $2, $3, $4, $5, $6);";

    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(Новый Структура("NAME" , "Vitaly"));
    МассивПараметров.Добавить(Новый Структура("INT"  , 25));
    МассивПараметров.Добавить(Новый Структура("REAL" , 1000.12));
    МассивПараметров.Добавить(Новый Структура("BOOL" , Истина));
    МассивПараметров.Добавить(Новый Структура("DATE" , OPI_Инструменты.ПолучитьТекущуюДату()));
    МассивПараметров.Добавить(Новый Структура("BYTEA", Картинка));

    Результат = OPI_PostgreSQL.ВыполнитьЗапросSQL(ТекстЗапроса, МассивПараметров, , Соединение);

    Обработать(Результат, "PostgreSQL", "ВыполнитьЗапросSQL", "Insert"); // SKIP

    // SELECT (Результат этого запроса приведен в следующем блоке)

    ТекстЗапроса = "SELECT id, name, age, salary, is_active, created_at, data FROM test_table;";

    Результат = OPI_PostgreSQL.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "PostgreSQL", "ВыполнитьЗапросSQL", , Картинка); // SKIP

    // DO + Транзакция

    ТекстЗапроса = "DO $$
                   |BEGIN
                   |    CREATE TABLE users (
                   |        id SMALLSERIAL,
                   |        name TEXT NOT NULL,
                   |        age INT NOT NULL
                   |    );
                   |    INSERT INTO users (name, age) VALUES ('Alice', 30);
                   |    INSERT INTO users (name, age) VALUES ('Bob', 25);
                   |    INSERT INTO users (name, age) VALUES ('Charlie', 35);
                   |END $$ LANGUAGE plpgsql;";

    Результат = OPI_PostgreSQL.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "PostgreSQL", "ВыполнитьЗапросSQL", "Transaction"); // SKIP

    // SQL запрос из файла

    ФайлSQL = ПараметрыФункции["SQL"]; // Двоичные данные, URL или путь к файлу

    Результат = OPI_PostgreSQL.ВыполнитьЗапросSQL(ФайлSQL, , , Соединение);

    Обработать(Результат, "PostgreSQL", "ВыполнитьЗапросSQL", "Файл"); // SKIP

    Закрытие = OPI_PostgreSQL.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "PostgreSQL", "ВыполнитьЗапросSQL", "Закрытие");

КонецПроцедуры

Процедура PostgreSQL_СоздатьБазуДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "postgres";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    База = "testbase1";

    Удаление = OPI_PostgreSQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS);                           // SKIP
    OPI_ПолучениеДанныхТестов.ВывестиСлужебнуюИнформацию(Удаление, "СоздатьБазуДанных (удаление)", "PostgreSQL"); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.СоздатьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "СоздатьБазуДанных");

    Подключение = OPI_PostgreSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    Обработать(Подключение, "PostgreSQL", "СоздатьБазуДанных", "Открытие");

    Результат = OPI_PostgreSQL.СоздатьБазуДанных(База, Подключение);

    Обработать(Результат, "PostgreSQL", "СоздатьБазуДанных", "Существующая");

    База = "testbase2";

    OPI_PostgreSQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS);
    Результат = OPI_PostgreSQL.СоздатьБазуДанных(База, Подключение);

    Обработать(Результат, "PostgreSQL", "СоздатьБазуДанных", "Новая");

    OPI_PostgreSQL.ЗакрытьСоединение(Подключение);

КонецПроцедуры

Процедура PostgreSQL_СоздатьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("bool_field"       , "BOOL");
    СтруктураКолонок.Вставить("oldchar_field"    , """char""");
    СтруктураКолонок.Вставить("smallint_field"   , "SMALLINT");
    СтруктураКолонок.Вставить("smallserial_field", "SMALLSERIAL");
    СтруктураКолонок.Вставить("int_field"        , "INT");
    СтруктураКолонок.Вставить("serial_field"     , "SERIAL");
    СтруктураКолонок.Вставить("oid_field"        , "OID");
    СтруктураКолонок.Вставить("bigint_field"     , "BIGINT");
    СтруктураКолонок.Вставить("bigserial_field"  , "BIGSERIAL");
    СтруктураКолонок.Вставить("real_field"       , "REAL");
    СтруктураКолонок.Вставить("dp_field"         , "DOUBLE PRECISION");
    СтруктураКолонок.Вставить("text_field"       , "TEXT");
    СтруктураКолонок.Вставить("varchar_field"    , "VARCHAR");
    СтруктураКолонок.Вставить("charn_field"      , "CHAR(3)");
    СтруктураКолонок.Вставить("char_field"       , "CHAR");
    СтруктураКолонок.Вставить("name_field"       , "NAME");
    СтруктураКолонок.Вставить("bytea_field"      , "BYTEA");
    СтруктураКолонок.Вставить("ts_field"         , "TIMESTAMP");
    СтруктураКолонок.Вставить("tswtz_field"      , "TIMESTAMP WITH TIME ZONE");
    СтруктураКолонок.Вставить("ip_field"         , "INET");
    СтруктураКолонок.Вставить("json_field"       , "JSON");
    СтруктураКолонок.Вставить("jsonb_field"      , "JSONB");
    СтруктураКолонок.Вставить("date_field"       , "DATE");
    СтруктураКолонок.Вставить("time_field"       , "TIME");
    СтруктураКолонок.Вставить("uuid_field"       , "UUID");
    СтруктураКолонок.Вставить("numeric_field"    , "NUMERIC(15, 2)");

    OPI_PostgreSQL.УдалитьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "СоздатьТаблицу");

    Таблица = "АБВ ГДЕ";

    Результат = OPI_PostgreSQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "СоздатьТаблицу", "Ошибка имени");

    Таблица = "somename";
    СтруктураКолонок.Вставить("wtf_field", "WTF");

    Результат = OPI_PostgreSQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "СоздатьТаблицу", "Ошибка типа");

КонецПроцедуры

Процедура PostgreSQL_ПолучитьИнформациюОТаблице(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "ПолучитьИнформациюОТаблице");

    Таблица = "heyho";

    Результат = OPI_PostgreSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "ПолучитьИнформациюОТаблице", "Ошибка");

КонецПроцедуры

Процедура PostgreSQL_ДобавитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица       = "testtable";
    МассивЗаписей = Новый Массив;

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    СлучайнаяСтруктура = Новый Структура("key,value", "ItsKey", 10);

    ТекущаяДата   = OPI_Инструменты.ПолучитьТекущуюДату();
    ТекущаяДатаЧП = OPI_Инструменты.ДатаRFC3339(ТекущаяДата, "+05:00");

    СтруктураЗаписи = Новый Структура;
    СтруктураЗаписи.Вставить("bool_field"       , Новый Структура("BOOL"                    , Истина));
    СтруктураЗаписи.Вставить("oldchar_field"    , Новый Структура("OLDCHAR"                 , 1));                  // или "char"
    СтруктураЗаписи.Вставить("smallint_field"   , Новый Структура("SMALLINT"                , 5));
    СтруктураЗаписи.Вставить("smallserial_field", Новый Структура("SMALLSERIAL"             , 6));
    СтруктураЗаписи.Вставить("int_field"        , Новый Структура("INT"                     , 100));
    СтруктураЗаписи.Вставить("serial_field"     , Новый Структура("SERIAL"                  , 100));
    СтруктураЗаписи.Вставить("oid_field"        , Новый Структура("OID"                     , 24576));
    СтруктураЗаписи.Вставить("bigint_field"     , Новый Структура("BIGINT"                  , 9999999));
    СтруктураЗаписи.Вставить("bigserial_field"  , Новый Структура("BIGSERIAL"               , 9999999));
    СтруктураЗаписи.Вставить("real_field"       , Новый Структура("REAL"                    , 15.2));
    СтруктураЗаписи.Вставить("dp_field"         , Новый Структура("DOUBLE_PRECISION"        , 1.0002));            // или DOUBLE PRECISION
    СтруктураЗаписи.Вставить("text_field"       , Новый Структура("TEXT"                    , "Some text"));
    СтруктураЗаписи.Вставить("varchar_field"    , Новый Структура("VARCHAR"                 , "Some varchar"));
    СтруктураЗаписи.Вставить("charn_field"      , Новый Структура("CHAR"                    , "AAA"));
    СтруктураЗаписи.Вставить("char_field"       , Новый Структура("CHAR"                    , "A"));
    СтруктураЗаписи.Вставить("name_field"       , Новый Структура("NAME"                    , "Vitaly"));
    СтруктураЗаписи.Вставить("bytea_field"      , Новый Структура("BYTEA"                   , Картинка));
    СтруктураЗаписи.Вставить("ts_field"         , Новый Структура("TIMESTAMP"               , ТекущаяДата));
    СтруктураЗаписи.Вставить("tswtz_field"      , Новый Структура("TIMESTAMP_WITH_TIME_ZONE", ТекущаяДатаЧП));      // или TIMESTAMP WITH TIME ZONE
    СтруктураЗаписи.Вставить("ip_field"         , Новый Структура("INET"                    , "127.0.0.1"));
    СтруктураЗаписи.Вставить("json_field"       , Новый Структура("JSON"                    , СлучайнаяСтруктура));
    СтруктураЗаписи.Вставить("jsonb_field"      , Новый Структура("JSONB"                   , СлучайнаяСтруктура));
    СтруктураЗаписи.Вставить("date_field"       , Новый Структура("DATE"                    , ТекущаяДата));
    СтруктураЗаписи.Вставить("time_field"       , Новый Структура("TIME"                    , ТекущаяДата));
    СтруктураЗаписи.Вставить("uuid_field"       , Новый Структура("UUID"                    , Новый УникальныйИдентификатор));
    СтруктураЗаписи.Вставить("numeric_field"    , Новый Структура("NUMERIC"                 , "15.2"));

    МассивЗаписей.Добавить(СтруктураЗаписи);

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.ДобавитьЗаписи(Таблица, МассивЗаписей, Истина, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "ДобавитьЗаписи");

КонецПроцедуры

Процедура PostgreSQL_ПолучитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    // Все записи без отборов

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "ПолучитьЗаписи"); // SKIP

    // Отборы, выбранные поля, количество и сортировка

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, "test_data", Логин, Пароль, Порт);

    Таблица = "test_data";

    Поля = Новый Массив;
    Поля.Добавить("first_name");
    Поля.Добавить("last_name");
    Поля.Добавить("email");

    Фильтры = Новый Массив;

    СтруктураФильтра1 = Новый Структура;

    СтруктураФильтра1.Вставить("field", "gender");
    СтруктураФильтра1.Вставить("type" , "=");
    СтруктураФильтра1.Вставить("value", "Male");
    СтруктураФильтра1.Вставить("union", "AND");
    СтруктураФильтра1.Вставить("raw"  , Ложь);

    СтруктураФильтра2 = Новый Структура;

    СтруктураФильтра2.Вставить("field", "id");
    СтруктураФильтра2.Вставить("type" , "BETWEEN");
    СтруктураФильтра2.Вставить("value", "20 AND 50");
    СтруктураФильтра2.Вставить("raw"  , Истина);

    Фильтры.Добавить(СтруктураФильтра1);
    Фильтры.Добавить(СтруктураФильтра2);

    Сортировка = Новый Структура("ip_address", "DESC");
    Количество = 5;

    Результат = OPI_PostgreSQL.ПолучитьЗаписи(Таблица
        , Поля
        , Фильтры
        , Сортировка
        , Количество
        , СтрокаПодключения
        , НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "ПолучитьЗаписи", "Отборы");

КонецПроцедуры

Процедура PostgreSQL_ОбновитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "test_data";

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("ip_address", Новый Структура("VARCHAR", "127.0.0.1"));

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "gender");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "Male"));
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Количество = OPI_PostgreSQl.ПолучитьЗаписи(Таблица, , Фильтры, , , СтрокаПодключения); // SKIP
    Обработать(Количество, "PostgreSQL", "ОбновитьЗаписи", "Количество");                  // SKIP
    Количество = Количество["data"].Количество();                                          // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQl.ОбновитьЗаписи(Таблица
        , СтруктураПолей
        , СтруктураФильтра
        , СтрокаПодключения
        , НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "ОбновитьЗаписи");

    Проверка = OPI_PostgreSQl.ПолучитьЗаписи(Таблица, "['ip_address']", Фильтры, , , СтрокаПодключения);

    Обработать(Проверка, "PostgreSQL", "ОбновитьЗаписи", "Проверка", Количество, СтруктураПолей);

КонецПроцедуры

Процедура PostgreSQL_УдалитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "test_data";

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "gender");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "Male"));
    СтруктураФильтра.Вставить("raw"  , Ложь);
    СтруктураФильтра.Вставить("union", "AND");

    Фильтры.Добавить(СтруктураФильтра);

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "ip_address");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "127.0.0.1"));
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Получение = OPI_PostgreSQL.ПолучитьЗаписи(Таблица, , Фильтры, , , СтрокаПодключения, НастройкиTLS); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.УдалитьЗаписи(Таблица, Фильтры, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Получение, "PostgreSQL", "УдалитьЗаписи", "Получение");

    Количество = Получение["data"].Количество();
    Остаток    = 100 - Количество;

    Обработать(Результат, "PostgreSQL", "УдалитьЗаписи");

    Результат = OPI_PostgreSQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "УдалитьЗаписи", "Проверка", Остаток);

КонецПроцедуры

Процедура PostgreSQL_УдалитьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.УдалитьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "УдалитьТаблицу");

    База    = "test_data";
    Таблица = "test_data";

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);
    Результат         = OPI_PostgreSQL.УдалитьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "УдалитьТаблицу", "Тест");

КонецПроцедуры

Процедура PostgreSQL_УдалитьБазуДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "postgres";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    База = "testbase1";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "УдалитьБазуДанных");

    База = "testbase2";

    Подключение = OPI_PostgreSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    Обработать(Подключение, "PostgreSQL", "УдалитьБазуДанных", "Открытие");

    Результат = OPI_PostgreSQL.ОтключитьВсеСоединенияБазыДанных(База, Подключение);

    Обработать(Результат, "PostgreSQL", "УдалитьБазуДанных", "Отключение");

    Результат = OPI_PostgreSQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "PostgreSQL", "УдалитьБазуДанных", "Удаление");

    Результат = OPI_PostgreSQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "PostgreSQL", "УдалитьБазуДанных", "Ошибка");

    Закрытие = OPI_PostgreSQL.ЗакрытьСоединение(Подключение);

    Обработать(Закрытие, "PostgreSQL", "УдалитьБазуДанных", "Закрытие");

    Результат = OPI_PostgreSQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "PostgreSQL", "УдалитьБазуДанных", "Ошибка подключения");

КонецПроцедуры

Процедура PostgreSQL_ОчиститьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.ОчиститьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "ОчиститьТаблицу");

    Результат = OPI_PostgreSQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "ОчиститьТаблицу", "Проверка");

КонецПроцедуры

Процедура PostgreSQL_ОтключитьВсеСоединенияБазыДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_PostgreSQL.ОтключитьВсеСоединенияБазыДанных(База, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "ОтключитьВсеСоединенияБазыДанных");

КонецПроцедуры

Процедура PostgreSQL_ПолучитьСтруктуруФильтраЗаписей(ПараметрыФункции)

    Результат = OPI_PostgreSQL.ПолучитьСтруктуруФильтраЗаписей();

    // END

    Обработать(Результат, "PostgreSQL", "ПолучитьСтруктуруФильтраЗаписей");

    Результат = OPI_PostgreSQL.ПолучитьСтруктуруФильтраЗаписей(Истина);

    Обработать(Результат, "PostgreSQL", "ПолучитьСтруктуруФильтраЗаписей", "Пустая");

КонецПроцедуры

Процедура PostgreSQL_ПолучитьНастройкиTLS(ПараметрыФункции)

    Результат = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);

    // END

    Обработать(Результат, "PostgreSQL", "ПолучитьНастройкиTLS");

КонецПроцедуры

Процедура PostgreSQL_ДобавитьКолонкуТаблицы(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица   = "testtable";
    Имя       = "new_field";
    ТипДанных = "TEXT";

    Результат = OPI_PostgreSQL.ДобавитьКолонкуТаблицы(Таблица, Имя, ТипДанных, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "ДобавитьКолонкуТаблицы");

    Результат = OPI_PostgreSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "ДобавитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура PostgreSQL_УдалитьКолонкуТаблицы(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";
    Имя     = "new_field";

    Результат = OPI_PostgreSQL.УдалитьКолонкуТаблицы(Таблица, Имя, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "УдалитьКолонкуТаблицы");

    Результат = OPI_PostgreSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "УдалитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура PostgreSQL_ГарантироватьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 5432;
    Порт = ?(TLS, 5433, 5432); // SKIP

    СтрокаПодключения = OPI_PostgreSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_PostgreSQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("smallint_field" , "SMALLINT");
    СтруктураКолонок.Вставить("uuid_field"     , "uuid");
    СтруктураКолонок.Вставить("bigint_field"   , "BIGINT");
    СтруктураКолонок.Вставить("custom_field"   , "TEXT");

    Результат = OPI_PostgreSQL.ГарантироватьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "PostgreSQL", "ГарантироватьТаблицу");

    Проверка = OPI_PostgreSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Проверка, "PostgreSQL", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

    Таблица = "test_new";

    Результат = OPI_PostgreSQL.ГарантироватьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "PostgreSQL", "ГарантироватьТаблицу", "Новая");

    Проверка = OPI_PostgreSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Проверка, "PostgreSQL", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

КонецПроцедуры

#КонецОбласти

#Область MySQL

Процедура MySQL_СформироватьСтрокуПодключения(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    Результат = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    // END

    Результат = СтрЗаменить(Результат, Пароль, "***");
    Результат = СтрЗаменить(Результат, Адрес , "127.0.0.1");

    Обработать(Результат, "MySQL", "СформироватьСтрокуПодключения");

КонецПроцедуры

Процедура MySQL_ОткрытьСоединение(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Результат = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    // END

    OPI_MySQL.ЗакрытьСоединение(Результат);
    Обработать(Результат, "MySQL", "ОткрытьСоединение");

КонецПроцедуры

Процедура MySQL_ЗакрытьСоединение(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);
    Результат  = OPI_MySQL.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "MySQL", "ЗакрытьСоединение");

КонецПроцедуры

Процедура MySQL_ЭтоКоннектор(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);
    Результат  = OPI_MySQL.ЭтоКоннектор(Соединение);

    OPI_MySQL.ЗакрытьСоединение(Результат);

    // END

    Обработать(Результат, "MySQL", "ЭтоКоннектор");

КонецПроцедуры

Процедура MySQL_ВыполнитьЗапросSQL(ПараметрыФункции)

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    OPI_MySQL.УдалитьТаблицу("users"     , Соединение);                    // SKIP
    OPI_MySQL.УдалитьТаблицу("test_data" , Соединение);                    // SKIP
    OPI_MySQL.УдалитьТаблицу("test_table", Соединение);                   // SKIP

    Обработать(Соединение, "MySQL", "ВыполнитьЗапросSQL", "Соединение");  // SKIP

    // CREATE

    ТекстЗапроса = "
                   |CREATE TABLE test_table (
                   |id INT AUTO_INCREMENT PRIMARY KEY,
                   |name VARCHAR(255),
                   |age INT,
                   |salary DOUBLE,
                   |amount FLOAT,
                   |type TINYINT UNSIGNED,
                   |date DATE,
                   |time TIME,
                   |data MEDIUMBLOB
                   |);";

    Результат = OPI_MySQL.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "MySQL", "ВыполнитьЗапросSQL", "Create");  // SKIP

    // INSERT с параметрами

    ТекстЗапроса = "
                   |INSERT INTO test_table (name, age, salary, amount, type, date, time, data)
                   |VALUES (?, ?, ?, ?, ?, ?, ?, ?);";

    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(Новый Структура("TEXT"  , "Vitaly"));
    МассивПараметров.Добавить(Новый Структура("INT"   , 25));
    МассивПараметров.Добавить(Новый Структура("DOUBLE", 1000.12));
    МассивПараметров.Добавить(Новый Структура("FLOAT" , 1000.12));
    МассивПараметров.Добавить(Новый Структура("UINT"  , 1));
    МассивПараметров.Добавить(Новый Структура("DATE"  , OPI_Инструменты.ПолучитьТекущуюДату()));
    МассивПараметров.Добавить(Новый Структура("TIME"  , OPI_Инструменты.ПолучитьТекущуюДату()));
    МассивПараметров.Добавить(Новый Структура("BYTES" , Картинка));

    Результат = OPI_MySQL.ВыполнитьЗапросSQL(ТекстЗапроса, МассивПараметров, , Соединение);

    Обработать(Результат, "MySQL", "ВыполнитьЗапросSQL", "Insert");  // SKIP

    // SELECT (Результат этого запроса приведен в следующем блоке)

    ТекстЗапроса = "SELECT name, age, salary, amount, type, date, time, data FROM test_table;";

    Результат = OPI_MySQL.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "MySQL", "ВыполнитьЗапросSQL", , Картинка);  // SKIP

    Результат = OPI_MySQL.ВыполнитьЗапросSQL("create table test_data (id INT,first_name VARCHAR(50),last_name VARCHAR(50),email VARCHAR(50),gender VARCHAR(50),ip_address VARCHAR(20));",  , , Соединение); // SKIP
    Обработать(Результат, "MySQL", "ВыполнитьЗапросSQL", "Test data");  // SKIP

    // SQL запрос из файла

    ФайлSQL = ПараметрыФункции["SQL2"]; // Двоичные данные, URL или путь к файлу

    Результат = OPI_MySQL.ВыполнитьЗапросSQL(ФайлSQL, , , Соединение);

    Обработать(Результат, "MySQL", "ВыполнитьЗапросSQL", "Файл");  // SKIP

    Закрытие = OPI_MySQL.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Закрытие, "MySQL", "ВыполнитьЗапросSQL", "Закрытие");  // SKIP

КонецПроцедуры

Процедура MySQL_СоздатьБазуДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    База = "testbase1";

    OPI_MySQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.СоздатьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "СоздатьБазуДанных");

    База = "testbase2";
    OPI_MySQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    Подключение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    Обработать(Подключение, "MySQL", "СоздатьБазуДанных", "Открытие");

    Результат = OPI_MySQL.СоздатьБазуДанных(База, Подключение, НастройкиTLS);

    Обработать(Результат, "MySQL", "СоздатьБазуДанных", "Создание");

    Результат = OPI_MySQL.СоздатьБазуДанных(База, Подключение, НастройкиTLS);

    Обработать(Результат, "MySQL", "СоздатьБазуДанных", "Существующая");

    OPI_MySQL.ЗакрытьСоединение(Подключение);

КонецПроцедуры

Процедура MySQL_СоздатьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("char_field"      , "CHAR(5)");
    СтруктураКолонок.Вставить("varchar_field"   , "VARCHAR(255)");
    СтруктураКолонок.Вставить("tinytext_field"  , "TINYTEXT");
    СтруктураКолонок.Вставить("text_field"      , "TEXT");
    СтруктураКолонок.Вставить("mediumtext_field", "MEDIUMTEXT");
    СтруктураКолонок.Вставить("longtext_field"  , "LONGTEXT");
    СтруктураКолонок.Вставить("tinyint_field"   , "TINYINT");
    СтруктураКолонок.Вставить("smallint_field"  , "SMALLINT");
    СтруктураКолонок.Вставить("mediumint_field" , "MEDIUMINT");
    СтруктураКолонок.Вставить("int_field"       , "INT");
    СтруктураКолонок.Вставить("uint_field"      , "INT UNSIGNED");
    СтруктураКолонок.Вставить("bigint_field"    , "BIGINT");
    СтруктураКолонок.Вставить("float_field"     , "FLOAT");
    СтруктураКолонок.Вставить("double_field"    , "DOUBLE");
    СтруктураКолонок.Вставить("date_field"      , "DATE");
    СтруктураКолонок.Вставить("time_field"      , "TIME");
    СтруктураКолонок.Вставить("datetime_field"  , "DATETIME");
    СтруктураКолонок.Вставить("timestamp_field" , "TIMESTAMP");
    СтруктураКолонок.Вставить("mediumblob_field", "MEDIUMBLOB");
    СтруктураКолонок.Вставить("set_field"       , "SET('one','two','three')");

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "СоздатьТаблицу");

    Таблица = "АБВ ГДЕ";

    Результат = OPI_MySQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "СоздатьТаблицу", "Ошибка имени");

    Таблица = "somename";
    СтруктураКолонок.Вставить("wtf_field", "WTF");

    Результат = OPI_MySQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "СоздатьТаблицу", "Ошибка типа");

КонецПроцедуры

Процедура MySQL_ДобавитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица       = "testtable";
    МассивЗаписей = Новый Массив;

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();

    СтруктураЗаписи = Новый Структура;
    СтруктураЗаписи.Вставить("char_field"      , Новый Структура("TEXT"  , "AAAAA"));
    СтруктураЗаписи.Вставить("varchar_field"   , Новый Структура("TEXT"  , "Some varchar"));
    СтруктураЗаписи.Вставить("tinytext_field"  , Новый Структура("TEXT"  , "Some tiny text"));
    СтруктураЗаписи.Вставить("text_field"      , Новый Структура("TEXT"  , "Some text"));
    СтруктураЗаписи.Вставить("mediumtext_field", Новый Структура("TEXT"  , "Some medium text"));
    СтруктураЗаписи.Вставить("longtext_field"  , Новый Структура("TEXT"  , "Some looooooong text"));
    СтруктураЗаписи.Вставить("tinyint_field"   , Новый Структура("INT"   , 127));
    СтруктураЗаписи.Вставить("smallint_field"  , Новый Структура("INT"   , -32767));
    СтруктураЗаписи.Вставить("mediumint_field" , Новый Структура("INT"   , 8388607));
    СтруктураЗаписи.Вставить("int_field"       , Новый Структура("INT"   , -2147483647));
    СтруктураЗаписи.Вставить("uint_field"      , Новый Структура("UINT"  , 4294967295));
    СтруктураЗаписи.Вставить("bigint_field"    , Новый Структура("INT"   , 9223372036854775807));
    СтруктураЗаписи.Вставить("float_field"     , Новый Структура("FLOAT" , 100.50));
    СтруктураЗаписи.Вставить("double_field"    , Новый Структура("FLOAT" , 100.512123));
    СтруктураЗаписи.Вставить("date_field"      , Новый Структура("DATE"  , ТекущаяДата));
    СтруктураЗаписи.Вставить("time_field"      , Новый Структура("TIME"  , ТекущаяДата));
    СтруктураЗаписи.Вставить("datetime_field"  , Новый Структура("DATE"  , ТекущаяДата));
    СтруктураЗаписи.Вставить("timestamp_field" , Новый Структура("DATE"  , ТекущаяДата));
    СтруктураЗаписи.Вставить("mediumblob_field", Новый Структура("BYTES" , Картинка));
    СтруктураЗаписи.Вставить("set_field"       , Новый Структура("TEXT"  , "one"));

    МассивЗаписей.Добавить(СтруктураЗаписи);

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.ДобавитьЗаписи(Таблица, МассивЗаписей, Истина, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "ДобавитьЗаписи");

КонецПроцедуры

Процедура MySQL_ПолучитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    // Все записи без отборов

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "ПолучитьЗаписи"); // SKIP

    // Отборы, выбранные поля, количество и сортировка

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, "test_data", Логин, Пароль, Порт);

    Таблица = "test_data";

    Поля = Новый Массив;
    Поля.Добавить("first_name");
    Поля.Добавить("last_name");
    Поля.Добавить("email");

    Фильтры = Новый Массив;

    СтруктураФильтра1 = Новый Структура;

    СтруктураФильтра1.Вставить("field", "gender");
    СтруктураФильтра1.Вставить("type" , "=");
    СтруктураФильтра1.Вставить("value", "Male");
    СтруктураФильтра1.Вставить("union", "AND");
    СтруктураФильтра1.Вставить("raw"  , Ложь);

    СтруктураФильтра2 = Новый Структура;

    СтруктураФильтра2.Вставить("field", "id");
    СтруктураФильтра2.Вставить("type" , "BETWEEN");
    СтруктураФильтра2.Вставить("value", "20 AND 50");
    СтруктураФильтра2.Вставить("raw"  , Истина);

    Фильтры.Добавить(СтруктураФильтра1);
    Фильтры.Добавить(СтруктураФильтра2);

    Сортировка = Новый Структура("ip_address", "DESC");
    Количество = 5;

    Результат = OPI_MySQL.ПолучитьЗаписи(Таблица, Поля, Фильтры, Сортировка, Количество, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "ПолучитьЗаписи", "Отборы");

КонецПроцедуры

Процедура MySQL_ОбновитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "test_data";

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("ip_address", Новый Структура("VARCHAR", "127.0.0.1"));

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "gender");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "Male"));
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Количество = OPI_MySQL.ПолучитьЗаписи(Таблица, , Фильтры, , , СтрокаПодключения, НастройкиTLS); // SKIP
    Обработать(Количество, "MySQL", "ОбновитьЗаписи", "Количество");                                // SKIP
    Количество = Количество["data"].Количество();                                                   // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.ОбновитьЗаписи(Таблица, СтруктураПолей, СтруктураФильтра, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "ОбновитьЗаписи");

    Проверка = OPI_MySQL.ПолучитьЗаписи(Таблица, "['ip_address']", Фильтры, , , СтрокаПодключения, НастройкиTLS);

    Обработать(Проверка, "MySQL", "ОбновитьЗаписи", "Проверка", Количество, СтруктураПолей);

КонецПроцедуры

Процедура MySQL_УдалитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "test_data";

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "gender");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "Male"));
    СтруктураФильтра.Вставить("raw"  , Ложь);
    СтруктураФильтра.Вставить("union", "AND");

    Фильтры.Добавить(СтруктураФильтра);

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "ip_address");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "127.0.0.1"));
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Получение = OPI_MySQL.ПолучитьЗаписи(Таблица, , Фильтры, , , СтрокаПодключения, НастройкиTLS); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.УдалитьЗаписи(Таблица, Фильтры, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Получение, "MySQL", "УдалитьЗаписи", "Получение");

    Количество = Получение["data"].Количество();
    Остаток    = 100 - Количество;

    Обработать(Результат, "MySQL", "УдалитьЗаписи");

    Результат = OPI_MySQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "УдалитьЗаписи", "Проверка", Остаток);

КонецПроцедуры

Процедура MySQL_УдалитьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.УдалитьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "УдалитьТаблицу");

    База    = "test_data";
    Таблица = "test_data";

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);
    Результат         = OPI_MySQL.УдалитьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "УдалитьТаблицу", "Тест");

КонецПроцедуры

Процедура MySQL_УдалитьБазуДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    База = "testbase1";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "УдалитьБазуДанных");

    База = "testbase2";

    Подключение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    Обработать(Подключение, "MySQL", "УдалитьБазуДанных", "Открытие");

    Результат = OPI_MySQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "MySQL", "УдалитьБазуДанных", "Удаление");

    Результат = OPI_MySQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "MySQL", "УдалитьБазуДанных", "Ошибка");

    Закрытие = OPI_MySQL.ЗакрытьСоединение(Подключение);

    Обработать(Закрытие, "MySQL", "УдалитьБазуДанных", "Закрытие");

    Результат = OPI_MySQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "MySQL", "УдалитьБазуДанных", "Ошибка подключения");

КонецПроцедуры

Процедура MySQL_ОчиститьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.ОчиститьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "ОчиститьТаблицу");

    Результат = OPI_MySQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "ОчиститьТаблицу", "Проверка");

КонецПроцедуры

Процедура MySQL_ПолучитьСтруктуруФильтраЗаписей(ПараметрыФункции)

    Результат = OPI_MySQL.ПолучитьСтруктуруФильтраЗаписей();

    // END

    Обработать(Результат, "MySQL", "ПолучитьСтруктуруФильтраЗаписей");

    Результат = OPI_MySQL.ПолучитьСтруктуруФильтраЗаписей(Истина);

    Обработать(Результат, "MySQL", "ПолучитьСтруктуруФильтраЗаписей", "Пустая");

КонецПроцедуры

Процедура MySQL_ПолучитьНастройкиTLS(ПараметрыФункции)

    Результат = OPI_MySQL.ПолучитьНастройкиTLS(Истина);

    // END

    Обработать(Результат, "MySQL", "ПолучитьНастройкиTLS");

КонецПроцедуры

Процедура MySQL_ПолучитьИнформациюОТаблице(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "ПолучитьИнформациюОТаблице");

    Таблица = "heyho";

    Результат = OPI_MySQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "ПолучитьИнформациюОТаблице", "Ошибка");

КонецПроцедуры

Процедура MySQL_ДобавитьКолонкуТаблицы(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица   = "testtable";
    Имя       = "new_field";
    ТипДанных = "MEDIUMTEXT";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.ДобавитьКолонкуТаблицы(Таблица, Имя, ТипДанных, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "ДобавитьКолонкуТаблицы");

    Результат = OPI_MySQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "ДобавитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура MySQL_УдалитьКолонкуТаблицы(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";
    Имя     = "new_field";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.УдалитьКолонкуТаблицы(Таблица, Имя, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "УдалитьКолонкуТаблицы");

    Результат = OPI_MySQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "УдалитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура MySQL_ГарантироватьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    СтрокаПодключения = OPI_MySQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, Порт);

    Если TLS Тогда
        НастройкиTLS = OPI_MySQL.ПолучитьНастройкиTLS(Истина);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("smallint_field" , "SMALLINT");
    СтруктураКолонок.Вставить("double_field"   , "DOUBLE");
    СтруктураКолонок.Вставить("bigint_field"   , "BIGINT");
    СтруктураКолонок.Вставить("custom_field"   , "TEXT");

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MySQL.ГарантироватьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MySQL", "ГарантироватьТаблицу");

    Проверка = OPI_MySQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Проверка, "MySQL", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

    Таблица = "test_new";

    Результат = OPI_MySQL.ГарантироватьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MySQL", "ГарантироватьТаблицу", "Новая");

    Проверка = OPI_MySQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Проверка, "MySQL", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

КонецПроцедуры

#КонецОбласти

#Область GreenAPI

Процедура GreenAPI_СформироватьПараметрыДоступа(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Результат = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);

    // END

    Обработать(Результат, "GreenAPI", "СформироватьПараметрыДоступа");

КонецПроцедуры

Процедура GreenAPI_ПолучитьНастройкиИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьНастройкиИнстанса(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьНастройкиИнстанса", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПолучитьИнформациюОбАккаунте(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьИнформациюОбАккаунте(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьИнформациюОбАккаунте");

КонецПроцедуры

Процедура GreenAPI_ПолучитьСтруктуруНастроекИнстанса(ПараметрыФункции)

    Результат = OPI_GreenAPI.ПолучитьСтруктуруНастроекИнстанса();

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьСтруктуруНастроекИнстанса");

    Результат = OPI_GreenAPI.ПолучитьСтруктуруНастроекИнстанса(Истина);

    Обработать(Результат, "GreenAPI", "ПолучитьСтруктуруНастроекИнстанса", "Пустая");

КонецПроцедуры

Процедура GreenAPI_УстановитьНастройкиИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);

    СтруктураНастроек = Новый Структура;
    СтруктураНастроек.Вставить("pollMessageWebhook"       , "yes");
    СтруктураНастроек.Вставить("incomingBlockWebhook"     , "no");
    СтруктураНастроек.Вставить("incomingCallWebhook"      , "no");
    СтруктураНастроек.Вставить("editedMessageWebhook"     , "yes");
    СтруктураНастроек.Вставить("deletedMessageWebhook"    , "yes");
    СтруктураНастроек.Вставить("outgoingAPIMessageWebhook", "yes");

    Результат = OPI_GreenAPI.УстановитьНастройкиИнстанса(СтруктураНастроек, ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "УстановитьНастройкиИнстанса");

КонецПроцедуры

Процедура GreenAPI_ПолучитьСостояниеИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьСостояниеИнстанса(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьСостояниеИнстанса");

КонецПроцедуры

Процедура GreenAPI_ПерезапуститьИнстанс(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПерезапуститьИнстанс(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПерезапуститьИнстанс");

КонецПроцедуры

Процедура GreenAPI_ПолучитьQR(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьQR(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьQR");

КонецПроцедуры

Процедура GreenAPI_РазлогинитьИнстанс(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.РазлогинитьИнстанс(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "РазлогинитьИнстанс");

КонецПроцедуры

Процедура GreenAPI_ПолучитьКодАвторизации(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    НомерТелефона = 441234567890;

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьКодАвторизации(ПараметрыДоступа, НомерТелефона);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьКодАвторизации");

КонецПроцедуры

Процедура GreenAPI_УстановитьКартинкуПрофиля(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.УстановитьКартинкуПрофиля(ПараметрыДоступа, Картинка);

    // END

    Обработать(Результат, "GreenAPI", "УстановитьКартинкуПрофиля");

КонецПроцедуры

Процедура GreenAPI_СоздатьГруппу(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Имя = "New group";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.СоздатьГруппу(ПараметрыДоступа, Имя);

    // END

    Обработать(Результат, "GreenAPI", "СоздатьГруппу", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПокинутьГруппу(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы = ПараметрыФункции["GreenAPI_GroupID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПокинутьГруппу(ПараметрыДоступа, IDГруппы);

    // END

    Обработать(Результат, "GreenAPI", "ПокинутьГруппу");

КонецПроцедуры

Процедура GreenAPI_ПолучитьИнформациюОГруппе(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы = ПараметрыФункции["GreenAPI_GroupID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьИнформациюОГруппе(ПараметрыДоступа, IDГруппы);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьИнформациюОГруппе");

КонецПроцедуры

Процедура GreenAPI_ИзменитьИмяГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы = ПараметрыФункции["GreenAPI_GroupID"];
    Имя      = "New name";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ИзменитьИмяГруппы(ПараметрыДоступа, IDГруппы, Имя);

    // END

    Обработать(Результат, "GreenAPI", "ИзменитьИмяГруппы");

КонецПроцедуры

Процедура GreenAPI_ДобавитьУчастникаВГруппу(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы       = ПараметрыФункции["GreenAPI_GroupID"];
    IDПользователя = "123123123@c.us";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ДобавитьУчастникаВГруппу(ПараметрыДоступа, IDГруппы, IDПользователя);

    // END

    Обработать(Результат, "GreenAPI", "ДобавитьУчастникаВГруппу");

КонецПроцедуры

Процедура GreenAPI_ИсключитьУчастникаГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы       = ПараметрыФункции["GreenAPI_GroupID"];
    IDПользователя = "123123123@c.us";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ИсключитьУчастникаГруппы(ПараметрыДоступа, IDГруппы, IDПользователя);

    // END

    Обработать(Результат, "GreenAPI", "ИсключитьУчастникаГруппы");

КонецПроцедуры

Процедура GreenAPI_НазначитьПраваАдминистратора(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы       = ПараметрыФункции["GreenAPI_GroupID"];
    IDПользователя = "123123123@c.us";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.НазначитьПраваАдминистратора(ПараметрыДоступа, IDГруппы, IDПользователя);

    // END

    Обработать(Результат, "GreenAPI", "НазначитьПраваАдминистратора");

КонецПроцедуры

Процедура GreenAPI_ОтозватьПраваАдминистратора(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы       = ПараметрыФункции["GreenAPI_GroupID"];
    IDПользователя = "123123123@c.us";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ОтозватьПраваАдминистратора(ПараметрыДоступа, IDГруппы, IDПользователя);

    // END

    Обработать(Результат, "GreenAPI", "ОтозватьПраваАдминистратора");

КонецПроцедуры

Процедура GreenAPI_УстановитьКартинкуГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    IDГруппы = ПараметрыФункции["GreenAPI_GroupID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.УстановитьКартинкуГруппы(ПараметрыДоступа, IDГруппы, Картинка);

    // END

    Обработать(Результат, "GreenAPI", "УстановитьКартинкуГруппы");

КонецПроцедуры

Процедура GreenAPI_ОтправитьТекстовоеСообщение(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];
    Текст  = "Новое сообщение";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ОтправитьТекстовоеСообщение(ПараметрыДоступа, IDЧата, Текст);

    // END

    Обработать(Результат, "GreenAPI", "ОтправитьТекстовоеСообщение", , ПараметрыФункции);

    IDСообщения = Результат["idMessage"];
    Результат   = OPI_GreenAPI.ОтправитьТекстовоеСообщение(ПараметрыДоступа, IDЧата, Текст, IDСообщения);

    Обработать(Результат, "GreenAPI", "ОтправитьТекстовоеСообщение", "Цитата");

КонецПроцедуры

Процедура GreenAPI_УдалитьСообщение(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_MessageID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.УдалитьСообщение(ПараметрыДоступа, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "GreenAPI", "УдалитьСообщение");

КонецПроцедуры

Процедура GreenAPI_ИзменитьТекстСообщения(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_MessageID"];
    Текст       = "Новый текст сообщения";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ИзменитьТекстСообщения(ПараметрыДоступа, IDЧата, IDСообщения, Текст);

    // END

    Обработать(Результат, "GreenAPI", "ИзменитьТекстСообщения");

КонецПроцедуры

Процедура GreenAPI_ОтправитьФайл(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Файл     = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    ИмяФайла = "photo.jpg";
    IDЧата   = ПараметрыФункции["GreenAPI_TestGroupID"];
    Описание = "Описание файла";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ОтправитьФайл(ПараметрыДоступа, IDЧата, Файл, ИмяФайла, Описание);

    // END

    Обработать(Результат, "GreenAPI", "ОтправитьФайл", , ПараметрыФункции);

    Файл     = ПараметрыФункции["Video"];
    ИмяФайла = "vid.mp4";

    IDСообщения = Результат["idMessage"];
    Результат   = OPI_GreenAPI.ОтправитьФайл(ПараметрыДоступа, IDЧата, Файл, ИмяФайла, Описание, IDСообщения);

    Обработать(Результат, "GreenAPI", "ОтправитьФайл", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ОтправитьФайлПоURL(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Файл     = ПараметрыФункции["Picture"];
    ИмяФайла = "photo.jpg";
    IDЧата   = ПараметрыФункции["GreenAPI_TestGroupID"];
    Описание = "Описание файла";

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ОтправитьФайлПоURL(ПараметрыДоступа, IDЧата, Файл, ИмяФайла, Описание);

    // END

    Обработать(Результат, "GreenAPI", "ОтправитьФайлПоURL", , ПараметрыФункции);

    Файл     = ПараметрыФункции["Video"];
    ИмяФайла = "vid.mp4";

    IDСообщения = Результат["idMessage"];
    Результат   = OPI_GreenAPI.ОтправитьФайлПоURL(ПараметрыДоступа, IDЧата, Файл, ИмяФайла, Описание, IDСообщения);

    Обработать(Результат, "GreenAPI", "ОтправитьФайлПоURL", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ОтправитьОпрос(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];
    Текст  = "Какой ваш любимый цвет?";

    Варианты = Новый Массив;
    Варианты.Добавить("Красный");
    Варианты.Добавить("Желтый");
    Варианты.Добавить("Зеленый");

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ОтправитьОпрос(ПараметрыДоступа, IDЧата, Текст, Варианты);

    // END

    Обработать(Результат, "GreenAPI", "ОтправитьОпрос", , ПараметрыФункции);

    IDСообщения = Результат["idMessage"];
    Результат   = OPI_GreenAPI.ОтправитьОпрос(ПараметрыДоступа, IDЧата, Текст, Варианты, Истина, IDСообщения);

    Обработать(Результат, "GreenAPI", "ОтправитьОпрос", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ПолучитьОписаниеЛокации(ПараметрыФункции)

    Широта   = 53.908522;
    Долгота  = 27.574821;
    Адрес    = "Площадь Победы, Минск";
    Название = "пл. Победы";

    Результат = OPI_GreenAPI.ПолучитьОписаниеЛокации(Широта, Долгота, Адрес, Название);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьОписаниеЛокации");

КонецПроцедуры

Процедура GreenAPI_ОтправитьЛокацию(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    Широта   = 53.908522;
    Долгота  = 27.574821;
    Адрес    = "Площадь Победы, Минск";
    Название = "пл. Победы";

    Локация = OPI_GreenAPI.ПолучитьОписаниеЛокации(Широта, Долгота, Адрес, Название);

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ОтправитьЛокацию(ПараметрыДоступа, IDЧата, Локация);

    // END

    Обработать(Результат, "GreenAPI", "ОтправитьЛокацию", , ПараметрыФункции);

    IDСообщения = Результат["idMessage"];
    Локация     = OPI_GreenAPI.ПолучитьОписаниеЛокации(Широта, Долгота);
    Результат   = OPI_GreenAPI.ОтправитьЛокацию(ПараметрыДоступа, IDЧата, Локация, IDСообщения);

    Обработать(Результат, "GreenAPI", "ОтправитьЛокацию", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ПолучитьОписаниеКонтакта(ПараметрыФункции)

    Телефон  = 79001234568;
    Имя      = "Артем";
    Фамилия  = "Евпаторийский";
    Отчество = "Петрович";
    Компания = "Велосипед";

    Результат = OPI_GreenAPI.ПолучитьОписаниеКонтакта(Телефон, Имя, Фамилия, Отчество, Компания);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьОписаниеКонтакта");

КонецПроцедуры

Процедура GreenAPI_ОтправитьКонтакт(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    Телефон  = 79001234568;
    Имя      = "Артем";
    Фамилия  = "Евпаторийский";
    Отчество = "Петрович";
    Компания = "Велосипед";

    Контакт = OPI_GreenAPI.ПолучитьОписаниеКонтакта(Телефон, Имя, Фамилия, Отчество, Компания);

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ОтправитьКонтакт(ПараметрыДоступа, IDЧата, Контакт);

    // END

    Обработать(Результат, "GreenAPI", "ОтправитьКонтакт", , ПараметрыФункции);

    IDСообщения = Результат["idMessage"];
    Контакт     = OPI_GreenAPI.ПолучитьОписаниеКонтакта(Телефон, , , , Компания);
    Результат   = OPI_GreenAPI.ОтправитьКонтакт(ПараметрыДоступа, IDЧата, Контакт, IDСообщения);

    Обработать(Результат, "GreenAPI", "ОтправитьКонтакт", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ПереслатьСообщения(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Откуда = "11001234567@c.us";
    Откуда = ПараметрыФункции["GreenAPI_TestGroupID"]; // SKIP
    Куда   = ПараметрыФункции["GreenAPI_TestGroupID"];

    Сообщение = ПараметрыФункции["GreenAPI_MessageID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПереслатьСообщения(ПараметрыДоступа, Откуда, Куда, Сообщение);

    // END

    Обработать(Результат, "GreenAPI", "ПереслатьСообщения");

КонецПроцедуры

Процедура GreenAPI_ПолучитьУведомление(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьУведомление(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьУведомление", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_УдалитьУведомлениеИзОчереди(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDДоставки = ПараметрыФункции["GreenAPI_ReceiptID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.УдалитьУведомлениеИзОчереди(ПараметрыДоступа, IDДоставки);

    // END

    Обработать(Результат, "GreenAPI", "УдалитьУведомлениеИзОчереди");

КонецПроцедуры

Процедура GreenAPI_СкачатьФайлСообщения(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_FileMessageID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.СкачатьФайлСообщения(ПараметрыДоступа, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "GreenAPI", "СкачатьФайлСообщения");

КонецПроцедуры

Процедура GreenAPI_УстановитьОтметкуПрочтения(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_FileMessageID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.УстановитьОтметкуПрочтения(ПараметрыДоступа, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "GreenAPI", "УстановитьОтметкуПрочтения");

КонецПроцедуры

Процедура GreenAPI_ПолучитьОчередьСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьОчередьСообщений(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьОчередьСообщений");

КонецПроцедуры

Процедура GreenAPI_ОчиститьОчередьСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ОчиститьОчередьСообщений(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ОчиститьОчередьСообщений");

КонецПроцедуры

Процедура GreenAPI_ПолучитьИсториюЧата(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьИсториюЧата(ПараметрыДоступа, IDЧата);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьИсториюЧата", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПолучитьСообщение(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_MessageID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьСообщение(ПараметрыДоступа, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьСообщение", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПолучитьЖурналВходящихСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьЖурналВходящихСообщений(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьЖурналВходящихСообщений", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПолучитьЖурналИсходящихСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.ПолучитьЖурналИсходящихСообщений(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenAPI", "ПолучитьЖурналИсходящихСообщений", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_АрхивироватьЧат(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);

    OPI_GreenAPI.РазархивироватьЧат(ПараметрыДоступа, IDЧата); // SKIP

    Результат = OPI_GreenAPI.АрхивироватьЧат(ПараметрыДоступа, IDЧата);

    // END

    Обработать(Результат, "GreenAPI", "АрхивироватьЧат");

КонецПроцедуры

Процедура GreenAPI_РазархивироватьЧат(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    ПараметрыДоступа = OPI_GreenAPI.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenAPI.РазархивироватьЧат(ПараметрыДоступа, IDЧата);

    // END

    Обработать(Результат, "GreenAPI", "РазархивироватьЧат");

КонецПроцедуры

#КонецОбласти

#Область RCON

Процедура RCON_СформироватьПараметрыСоединения(ПараметрыФункции)

    URL           = ПараметрыФункции["RCON_URL"];
    Пароль        = ПараметрыФункции["RCON_Password"];
    ТаймаутЗаписи = 20;
    ТаймаутЧтения = 20;

    Результат = OPI_RCON.СформироватьПараметрыСоединения(URL, Пароль, ТаймаутЧтения, ТаймаутЗаписи);

    // END

    Обработать(Результат, "RCON", "СформироватьПараметрыСоединения");

КонецПроцедуры

Процедура RCON_ОткрытьСоединение(ПараметрыФункции)

    URL           = ПараметрыФункции["RCON_URL"];
    Пароль        = ПараметрыФункции["RCON_Password"];
    ТаймаутЗаписи = 20;
    ТаймаутЧтения = 20;

    ПараметрыСоединения = OPI_RCON.СформироватьПараметрыСоединения(URL, Пароль, ТаймаутЧтения, ТаймаутЗаписи);
    Результат           = OPI_RCON.ОткрытьСоединение(ПараметрыСоединения);

    // END

    Обработать(Результат, "RCON", "ОткрытьСоединение");

КонецПроцедуры

Процедура RCON_ВыполнитьКоманду(ПараметрыФункции)

    URL           = ПараметрыФункции["RCON_URL"];
    Пароль        = ПараметрыФункции["RCON_Password"];
    ТаймаутЗаписи = 20;
    ТаймаутЧтения = 20;

    ПараметрыСоединения = OPI_RCON.СформироватьПараметрыСоединения(URL, Пароль, ТаймаутЧтения, ТаймаутЗаписи);
    Соединение          = OPI_RCON.ОткрытьСоединение(ПараметрыСоединения);

    Команда   = "list";
    Результат = OPI_RCON.ВыполнитьКоманду(Команда, Соединение);

    // END

    Обработать(Результат, "RCON", "ВыполнитьКоманду");

    Команда   = "list";
    Результат = OPI_RCON.ВыполнитьКоманду(Команда, ПараметрыСоединения);

    Обработать(Результат, "RCON", "ВыполнитьКоманду", "Без соединения");

КонецПроцедуры

Процедура RCON_ЭтоКоннектор(ПараметрыФункции)

    URL           = ПараметрыФункции["RCON_URL"];
    Пароль        = ПараметрыФункции["RCON_Password"];
    ТаймаутЗаписи = 20;
    ТаймаутЧтения = 20;

    ПараметрыСоединения = OPI_RCON.СформироватьПараметрыСоединения(URL, Пароль, ТаймаутЧтения, ТаймаутЗаписи);
    Соединение          = OPI_RCON.ОткрытьСоединение(ПараметрыСоединения);
    Результат           = OPI_RCON.ЭтоКоннектор(Соединение);

    // END

    Обработать(Результат, "RCON", "ЭтоКоннектор");

КонецПроцедуры

#КонецОбласти

#Область Ollama

Процедура Ollama_ПолучитьОтвет(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Промпт = "What is 1C:Enterprise?";
    Модель = "tinyllama";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ПолучитьОтвет(URL, Модель, Промпт, , ДопЗаголовки);

    Обработать(Результат, "Ollama", "ПолучитьОтвет"); // SKIP

    // С параметрами

    Промпт = "Ollama is 22 years old and is busy saving the world. Respond using JSON";

    Формат = OPI_Инструменты.JSONВСтруктуру("
    |{
    |""type"": ""object"",
    |""properties"": {
    |  ""age"": {
    |    ""type"": ""integer""
    |  },
    |  ""available"": {
    |    ""type"": ""boolean""
    |  }
    |},
    |""required"": [
    |  ""age"",
    |  ""available""
    |]
    |}");

    ДопПараметры = Новый Структура("format", Формат);

    Результат = OPI_Ollama.ПолучитьОтвет(URL, Модель, Промпт, ДопПараметры, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ПолучитьОтвет", "Параметры");

КонецПроцедуры

Процедура Ollama_ПолучитьОтветВКонтексте(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Модель = "tinyllama";

    МассивСообщений = Новый Массив;

    Вопрос1 = OPI_Ollama.ПолучитьСтруктуруСообщенияКонтекста("user", "What is 1C:Enterprise?");
    Вопрос2 = OPI_Ollama.ПолучитьСтруктуруСообщенияКонтекста("user", "When the first version was released?"); // Вопрос без конкретики

    // Добавляем первый вопрос в контекст
    МассивСообщений.Добавить(Вопрос1);

    Ответ1 = OPI_Ollama.ПолучитьОтветВКонтексте(URL, Модель, МассивСообщений, , ДопЗаголовки);

    Обработать(Ответ1, "Ollama", "ПолучитьОтветВКонтексте", "Предварительный"); // SKIP

    МассивСообщений.Добавить(Ответ1["message"]); // Добавляем ответ на первый вопрос в контекст
    МассивСообщений.Добавить(Вопрос2);           // Добавляем второй вопрос в контекст

    Ответ2 = OPI_Ollama.ПолучитьОтветВКонтексте(URL, Модель, МассивСообщений, , ДопЗаголовки);

    МассивСообщений.Добавить(Ответ2["message"]);

    // ...

    // END

    Обработать(Ответ2, "Ollama", "ПолучитьОтветВКонтексте");

    МассивСообщений = Новый Массив;

    Вопрос = Новый Структура("role,content", "user", "Hello!");
    МассивСообщений.Добавить(Вопрос);

    Опции        = Новый Структура("seed,temperature", 101, 0);
    ДопПараметры = Новый Структура("options", Опции);

    Результат = OPI_Ollama.ПолучитьОтветВКонтексте(URL, Модель, МассивСообщений, ДопПараметры, ДопЗаголовки);

    Обработать(Результат, "Ollama", "ПолучитьОтветВКонтексте", "Сид 1");

    Сообщение1 = Результат["message"]["content"];

    Результат = OPI_Ollama.ПолучитьОтветВКонтексте(URL, Модель, МассивСообщений, ДопПараметры, ДопЗаголовки);

    Обработать(Результат, "Ollama", "ПолучитьОтветВКонтексте", "Сид 2");

    Сообщение2 = Результат["message"]["content"];

    Опции        = Новый Структура("seed,temperature", 555, 10);
    ДопПараметры = Новый Структура("options", Опции);

    Результат = OPI_Ollama.ПолучитьОтветВКонтексте(URL, Модель, МассивСообщений, ДопПараметры, ДопЗаголовки);

    Обработать(Результат, "Ollama", "ПолучитьОтветВКонтексте", "Сид 3");

    Сообщение3 = Результат["message"]["content"];

    Обработать(Сообщение3, "Ollama", "ПолучитьОтветВКонтексте", "Сравнение", Сообщение1, Сообщение2, Сообщение3);

КонецПроцедуры

Процедура Ollama_ЗагрузитьМодельВПамять(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "tinyllama";
    Период = 500;

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ЗагрузитьМодельВПамять(URL, Модель, Период, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ЗагрузитьМодельВПамять");

КонецПроцедуры

Процедура Ollama_ВыгрузитьМодельИзПамяти(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "tinyllama";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ВыгрузитьМодельИзПамяти(URL, Модель, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ВыгрузитьМодельИзПамяти");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруПараметровЗапроса(ПараметрыФункции)

    Результат = OPI_Ollama.ПолучитьСтруктуруПараметровЗапроса();

    // END

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруПараметровЗапроса");

    Результат = OPI_Ollama.ПолучитьСтруктуруПараметровЗапроса(Истина);

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруПараметровЗапроса", "Пустая");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруПараметровВКонтексте(ПараметрыФункции)

    Результат = OPI_Ollama.ПолучитьСтруктуруПараметровВКонтексте();

    // END

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруПараметровВКонтексте");

    Результат = OPI_Ollama.ПолучитьСтруктуруПараметровВКонтексте(Истина);

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруПараметровВКонтексте", "Пустая");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруСообщенияКонтекста(ПараметрыФункции)

    Результат = OPI_Ollama.ПолучитьСтруктуруСообщенияКонтекста("user", "Hello!");

    // END

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруСообщенияКонтекста");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруНастроекМодели(ПараметрыФункции)

    Результат = OPI_Ollama.ПолучитьСтруктуруНастроекМодели();

    // END

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруНастроекМодели");

    Результат = OPI_Ollama.ПолучитьСтруктуруНастроекМодели(Истина);

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруНастроекМодели", "Пустая");

КонецПроцедуры

Процедура Ollama_СоздатьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "mario";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Настройки = Новый Структура("from,system", "tinyllama", "You are Mario from Super Mario Bros.");

    Результат = OPI_Ollama.СоздатьМодель(URL, Модель, Настройки, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "СоздатьМодель");

    Результат = OPI_Ollama.ПолучитьОтвет(URL, Модель, "How are you?", , ДопЗаголовки);

    Обработать(Результат, "Ollama", "СоздатьМодель", "Запрос");

КонецПроцедуры

Процедура Ollama_УдалитьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "mario";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.УдалитьМодель(URL, Модель, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "УдалитьМодель");

    Результат = OPI_Ollama.УдалитьМодель(URL, "library/tinyllama:latest", ДопЗаголовки);
    Обработать(Результат, "Ollama", "УдалитьМодель", "Tiny");

    Результат = OPI_Ollama.УдалитьМодель(URL, "bayselonarrend/tinyllama:latest", ДопЗаголовки);
    Обработать(Результат, "Ollama", "УдалитьМодель", "Tiny, аккаунт");

    Результат = OPI_Ollama.ПолучитьСписокМоделей(URL, ДопЗаголовки);

    Обработать(Результат, "Ollama", "УдалитьМодель", "Список");

КонецПроцедуры

Процедура Ollama_ПолучитьСписокМоделей(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ПолучитьСписокМоделей(URL, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ПолучитьСписокМоделей");

КонецПроцедуры

Процедура Ollama_ПолучитьСписокЗапущенныхМоделей(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ПолучитьСписокЗапущенныхМоделей(URL, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ПолучитьСписокЗапущенныхМоделей");

КонецПроцедуры

Процедура Ollama_ПолучитьИнформациюОМодели(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "mario";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ПолучитьИнформациюОМодели(URL, Модель, Ложь, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ПолучитьИнформациюОМодели");

КонецПроцедуры

Процедура Ollama_КопироватьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "mario";
    Имя    = "mario2";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.КопироватьМодель(URL, Модель, Имя, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "КопироватьМодель");

    OPI_Ollama.УдалитьМодель(URL, Имя, ДопЗаголовки);

КонецПроцедуры

Процедура Ollama_ПолучитьВерсию(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ПолучитьВерсию(URL, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ПолучитьВерсию");

КонецПроцедуры

Процедура Ollama_ПолучитьПредставления(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("Why is the sky blue?");
    МассивСтрок.Добавить("Why is the grass green?");

    Модель = "tinyllama";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ПолучитьПредставления(URL, Модель, МассивСтрок, , ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ПолучитьПредставления");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруПараметровПредставлений(ПараметрыФункции)

    Результат = OPI_Ollama.ПолучитьСтруктуруПараметровПредставлений();

    // END

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруПараметровПредставлений");

    Результат = OPI_Ollama.ПолучитьСтруктуруПараметровПредставлений(Истина);

    Обработать(Результат, "Ollama", "ПолучитьСтруктуруПараметровПредставлений", "Пустая");

КонецПроцедуры

Процедура Ollama_ОтправитьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "bayselonarrend/tinyllama:latest";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ОтправитьМодель(URL, Модель, , ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ОтправитьМодель");

КонецПроцедуры

Процедура Ollama_СкачатьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "tinyllama";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.СкачатьМодель(URL, Модель, , ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "СкачатьМодель");

    Результат = OPI_Ollama.СкачатьМодель(URL, "bayselonarrend/tinyllama:latest", , ДопЗаголовки);

    Обработать(Результат, "Ollama", "СкачатьМодель", "Аккаунт");

КонецПроцедуры

Процедура Ollama_ОтправитьBlob(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка, Истина);                   // SKIP
    Рандом   = ПолучитьДвоичныеДанныеИзСтроки(Строка(Новый УникальныйИдентификатор));   // SKIP
    Картинка = OPI_Инструменты.СклеитьДанные(Картинка, Рандом);                         // SKIP

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ОтправитьBlob(URL, Картинка, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ОтправитьBlob", , ПараметрыФункции);

КонецПроцедуры

Процедура Ollama_ПроверитьBlob(ПараметрыФункции)

    URL    = ПараметрыФункции["Ollama_URL"];
    Токен  = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama
    SHA256 = ПараметрыФункции["Ollama_Blob"];

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Результат = OPI_Ollama.ПроверитьBlob(URL, SHA256, ДопЗаголовки);

    // END

    Обработать(Результат, "Ollama", "ПроверитьBlob");

    Результат = OPI_Ollama.ПроверитьBlob(URL, "yoyoyo", ДопЗаголовки);

    Обработать(Результат, "Ollama", "ПроверитьBlob", "Ошибка");

КонецПроцедуры

#КонецОбласти

#Область HTTP

Процедура HTTPКлиент_Инициализировать(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP
        .НовыйЗапрос()
        .Инициализировать(URL) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "Инициализировать");

    HTTPКлиент = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .ОбработатьЗапрос("POST", Ложь);

    Обработать(HTTPКлиент, "HTTPКлиент", "Инициализировать", "Проверка 1", ПараметрыФункции);

    ДругойЗапрос = HTTPКлиент.УстановитьURL(ПараметрыФункции["HTTP_URL"] + "/post")
        .ОбработатьЗапрос("POST", Ложь)
        .ВернутьЗапрос();

    Обработать(ДругойЗапрос, "HTTPКлиент", "Инициализировать", "Проверка 2");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьURL(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьURL");

    HTTPКлиент = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ОбработатьЗапрос("POST", Ложь);

    Обработать(HTTPКлиент, "HTTPКлиент", "УстановитьURL", "Проверка", ПараметрыФункции);

КонецПроцедуры

Процедура HTTPКлиент_УстановитьПараметрыURL(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    СтруктураПараметров = Новый Структура("param1,param2", "text", 10);

    Результат = OPI_ЗапросыHTTP
        .НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьПараметрыURL(СтруктураПараметров) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьПараметрыURL", , ПараметрыФункции);

    HTTPКлиент = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьПараметрыURL(СтруктураПараметров)
        .ОбработатьЗапрос("POST", Ложь);

    HTTPЗапрос = HTTPКлиент.ВернутьЗапрос();

    Обработать(HTTPЗапрос, "HTTPКлиент", "УстановитьПараметрыURL", "Проверка");

    // Проверка кодировки

    // Комплексная

    СтруктураПараметров1 = Новый Структура;
    СтруктураПараметров1.Вставить("param1", "search?text");
    СтруктураПараметров1.Вставить("param2", "John Doe");
    СтруктураПараметров1.Вставить("param3", "value&another");
    СтруктураПараметров1.Вставить("param4", "кириллица");
    СтруктураПараметров1.Вставить("param5", "<script>alert('XSS')</script>");

    АдресРесурса1 = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page")
        .УстановитьПараметрыURL(СтруктураПараметров1)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    Обработать(АдресРесурса1, "HTTPКлиент", "УстановитьПараметрыURL", "Вариант 1");

    СтруктураПараметров2 = Новый Структура;
    СтруктураПараметров2.Вставить("param1", "search?text");
    СтруктураПараметров2.Вставить("param2", "John Doe");

    // Параметры в оригинальном URL

    АдресРесурса2 = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page?existing=value")
        .УстановитьПараметрыURL(СтруктураПараметров2)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    Обработать(АдресРесурса2, "HTTPКлиент", "УстановитьПараметрыURL", "Вариант 2");

    // Пустая строка параметров

    СтруктураПараметров3 = Новый Структура;
    СтруктураПараметров3.Вставить("param1", "search?text");
    СтруктураПараметров3.Вставить("param2", "John Doe");

    АдресРесурса3 = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page?")
        .УстановитьПараметрыURL(Структурапараметров3)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    Обработать(АдресРесурса3, "HTTPКлиент", "УстановитьПараметрыURL", "Вариант 3");

    // Спец. символы в пути

    СтруктураПараметров4 = Новый Структура;
    СтруктураПараметров4.Вставить("param1", "search?text");
    СтруктураПараметров4.Вставить("param2", "John Doe");

    АдресРесурса4 = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/path with spaces")
        .УстановитьПараметрыURL(СтруктураПараметров4)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    Обработать(АдресРесурса4, "HTTPКлиент", "УстановитьПараметрыURL", "Вариант 4");

    // URL с фрагментом

    СтруктураПараметров5 = Новый Структура;
    СтруктураПараметров5.Вставить("param1", "search?text");
    СтруктураПараметров5.Вставить("param2", "John Doe");

    АдресРесурса5 = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page#section")
        .УстановитьПараметрыURL(СтруктураПараметров5)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    Обработать(АдресРесурса5, "HTTPКлиент", "УстановитьПараметрыURL", "Вариант 5");

    // Кирилица в пути

    СтруктураПараметров6 = Новый Структура;
    СтруктураПараметров6.Вставить("param1", "search?text");
    СтруктураПараметров6.Вставить("param2", "John Doe");

    АдресРесурса6 = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/путь")
        .УстановитьПараметрыURL(СтруктураПараметров6)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    Обработать(АдресРесурса6, "HTTPКлиент", "УстановитьПараметрыURL", "Вариант 6");

    // Несколько параметров и кодировка

    СтруктураПараметров7 = Новый Структура;
    СтруктураПараметров7.Вставить("param1", "value1");
    СтруктураПараметров7.Вставить("param2", "value two");
    Структурапараметров7.Вставить("param3", "value<three>");

    АдресРесурса7 = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page")
        .УстановитьПараметрыURL(СтруктураПараметров7)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    Обработать(АдресРесурса7, "HTTPКлиент", "УстановитьПараметрыURL", "Вариант 7");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьФайлОтвета(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    ИВФ = ПолучитьИмяВременногоФайла();

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьФайлОтвета(ИВФ) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьИмяФайлаТелаОтвета();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьФайлОтвета", , ИВФ);

    РезультатПроверки = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .УстановитьФайлОтвета(ИВФ) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакДвоичныеДанные();

    Обработать(РезультатПроверки, "HTTPКлиент", "УстановитьФайлОтвета", "Тело", ИВФ);

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьТипДанных(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    ТипMIME = "text/markdown";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьСтроковоеТело("# Привет мир!")
        .УстановитьТипДанных(ТипMIME) // <---
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьТипДанных");

КонецПроцедуры

Процедура HTTPКлиент_ПолучитьЛог(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    СтруктураПараметров = Новый Структура("param1,param2", "text", 10);

    HTTPКлиент = OPI_ЗапросыHTTP
        .НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьПараметрыURL(СтруктураПараметров)
        .ОбработатьЗапрос("GET");

    Ответ = HTTPКлиент.ВернутьОтветКакJSONКоллекцию();
    Лог   = HTTPКлиент.ПолучитьЛог(Истина);

    // END

    Обработать(Лог, "HTTPКлиент", "ПолучитьЛог");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьДвоичноеТело(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Картинка) // <---
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьДвоичноеТело", , Картинка);

КонецПроцедуры

Процедура HTTPКлиент_УстановитьСтроковоеТело(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Текст     = "Привет мир!";
    Кодировка = "Windows-1251";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .ИспользоватьКодировку(Кодировка)
        .УстановитьСтроковоеТело(Текст) // <---
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьСтроковоеТело");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьJsonТело(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    СлучайныйМассив = Новый Массив;
    СлучайныйМассив.Добавить("A");
    СлучайныйМассив.Добавить("B");
    СлучайныйМассив.Добавить("C");

    Данные = Новый Структура("Поле1,Поле2,Поле3", 10, "Текст", СлучайныйМассив);

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьJsonТело(Данные) // <---
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьJsonТело", , Данные);

КонецПроцедуры

Процедура HTTPКлиент_УстановитьFormТело(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Данные = Новый Структура("Поле1,Поле2", "10", "Текст");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьFormТело(Данные) // <---
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьFormТело", , Данные);

КонецПроцедуры

Процедура HTTPКлиент_НачатьЗаписьТелаMultipart(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .НачатьЗаписьТелаMultipart() // <---
        .ДобавитьФайлMultipartFormData("file1", "pic.png", Картинка, "image/png")
        .ДобавитьПолеMultipartFormData("Поле1", "Текст")
        .ДобавитьПолеMultipartFormData("Поле2", "10")
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "НачатьЗаписьТелаMultipart", , Картинка);

КонецПроцедуры

Процедура HTTPКлиент_ДобавитьФайлMultipartFormData(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .НачатьЗаписьТелаMultipart()
        .ДобавитьФайлMultipartFormData("file1", "pic.png", Картинка, "image/png") // <---
        .ДобавитьПолеMultipartFormData("Поле1", "Текст")
        .ДобавитьПолеMultipartFormData("Поле2", "10")
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ДобавитьФайлMultipartFormData", , Картинка);

КонецПроцедуры

Процедура HTTPКлиент_ДобавитьПолеMultipartFormData(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .НачатьЗаписьТелаMultipart()
        .ДобавитьФайлMultipartFormData("file1", "pic.png", Картинка, "image/png")
        .ДобавитьПолеMultipartFormData("Поле1", "Текст") // <---
        .ДобавитьПолеMultipartFormData("Поле2", "10")    // <---
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ДобавитьПолеMultipartFormData", , Картинка);

КонецПроцедуры

Процедура HTTPКлиент_ДобавитьДанныеRelated(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    СлучайныйМассив = Новый Массив;
    СлучайныйМассив.Добавить("A");
    СлучайныйМассив.Добавить("B");
    СлучайныйМассив.Добавить("C");

    Данные = Новый Структура("Поле1,Поле2,Поле3", 10, "Текст", СлучайныйМассив);

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .НачатьЗаписьТелаMultipart(Истина, "related")
        .ДобавитьДанныеRelated(Данные, "application/json; charset=UTF-8") // <---
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ДобавитьДанныеRelated");

КонецПроцедуры

Процедура HTTPКлиент_ИспользоватьКодировку(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Текст     = "Привет мир!";
    Кодировка = "Windows-1251";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .ИспользоватьКодировку(Кодировка) // <---
        .УстановитьСтроковоеТело(Текст)
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ИспользоватьКодировку");

КонецПроцедуры

Процедура HTTPКлиент_ИспользоватьСжатиеGzip(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Картинка)
        .ИспользоватьСжатиеGzip(Ложь) // <---
        .ОбработатьЗапрос("POST", Ложь)
        .ВернутьЗапрос();

    // END

    Обработать(Результат, "HTTPКлиент", "ИспользоватьСжатиеGzip");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Картинка)
        .ИспользоватьСжатиеGzip(Истина) // <---
        .ОбработатьЗапрос("POST", Ложь)
        .ВернутьЗапрос();

    Обработать(Результат, "HTTPКлиент", "ИспользоватьСжатиеGzip", "Включено");

КонецПроцедуры

Процедура HTTPКлиент_ИспользоватьПоляТелаВOAuth(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Токен              = "***";
    Секрет             = "***";
    КлючПользователя   = "***";
    СекретПользователя = "***";
    Версия             = "1.0";

    НовыйЗапрос = OPI_ЗапросыHTTP.НовыйЗапрос().Инициализировать(URL);

    Результат = НовыйЗапрос
        .НачатьЗаписьТелаMultipart()
        .ДобавитьФайлMultipartFormData("file1", "pic.png", Картинка, "image/png")
        .ДобавитьПолеMultipartFormData("field1", "Текст")
        .ДобавитьПолеMultipartFormData("field2", "10")
        .ИспользоватьПоляТелаВOAuth(Ложь) // <---
        .ДобавитьOauthV1Авторизацию(Токен, Секрет, КлючПользователя, СекретПользователя, Версия)
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    ЛогСтрокой = НовыйЗапрос.ПолучитьЛог(Истина);
    Обработать(Результат, "HTTPКлиент", "ИспользоватьПоляТелаВOAuth", , ЛогСтрокой);

    Результат = OPI_ЗапросыHTTP
        .НовыйЗапрос()
        .Инициализировать(URL)
        .НачатьЗаписьТелаMultipart()
        .ДобавитьФайлMultipartFormData("file1", "pic.png", Картинка, "image/png")
        .ДобавитьПолеMultipartFormData("field1", "Текст")
        .ДобавитьПолеMultipartFormData("field2", "10")
        .ИспользоватьПоляТелаВOAuth(Истина) // <---
        .ДобавитьOauthV1Авторизацию(Токен, Секрет, КлючПользователя, СекретПользователя, Версия)
        .ОбработатьЗапрос("POST", Ложь)
        .ПолучитьЛог(Истина);

    Обработать(Результат, "HTTPКлиент", "ИспользоватьПоляТелаВOAuth", "Включено");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьЗаголовки(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Заголовки = Новый Соответствие;
    Заголовки.Вставить("X-Header1", "Value1");
    Заголовки.Вставить("X-Header2", "Value2");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .УстановитьЗаголовки(Заголовки) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьЗаголовки");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьBearerАвторизацию("1111")
        .УстановитьЗаголовки(Заголовки, Истина) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    Обработать(Результат, "HTTPКлиент", "УстановитьЗаголовки", "Перезапись");

КонецПроцедуры

Процедура HTTPКлиент_ДобавитьЗаголовок(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьЗаголовок("X-Header1", "Value1") // <---
        .ДобавитьЗаголовок("X-Header2", "Value2") // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ДобавитьЗаголовок");

    Заголовки = Новый Соответствие;
    Заголовки.Вставить("X-Header1", "Value1");
    Заголовки.Вставить("X-Header2", "Value2");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьBearerАвторизацию("1111")
        .ДобавитьЗаголовок("X-Header3", "BadValue") // <---
        .ДобавитьЗаголовок("X-Header4", "BadValue")
        .УстановитьЗаголовки(Заголовки, Истина) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    Обработать(Результат, "HTTPКлиент", "ДобавитьЗаголовок", "Замена");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьBearerАвторизацию("1111")
        .ДобавитьЗаголовок("X-Header3", "BadValue") // <---
        .ДобавитьЗаголовок("X-Header4", "BadValue")
        .УстановитьЗаголовки(Заголовки) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    Обработать(Результат, "HTTPКлиент", "ДобавитьЗаголовок", "Дополнение");

КонецПроцедуры

Процедура HTTPКлиент_ДобавитьBasicАвторизацию(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьBasicАвторизацию("user", "password") // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ДобавитьBasicАвторизацию");

КонецПроцедуры

Процедура HTTPКлиент_ДобавитьBearerАвторизацию(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьBearerАвторизацию("123123") // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ДобавитьBearerАвторизацию");

КонецПроцедуры

Процедура HTTPКлиент_ДобавитьAWS4Авторизацию(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    AccessKey = "AccessKey";
    SecretKey = "SecretKey";
    Region    = "Region";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьAWS4Авторизацию(AccessKey, SecretKey, Region) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ДобавитьAWS4Авторизацию");

КонецПроцедуры

Процедура HTTPКлиент_ДобавитьOAuthV1Авторизацию(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Токен              = "***";
    Секрет             = "***";
    КлючПользователя   = "***";
    СекретПользователя = "***";
    Версия             = "1.0";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .ДобавитьOAuthV1Авторизацию(Токен, Секрет, КлючПользователя, СекретПользователя, Версия) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ДобавитьOAuthV1Авторизацию");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьАлгоритмOAuthV1(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Токен              = "***";
    Секрет             = "***";
    КлючПользователя   = "***";
    СекретПользователя = "***";
    Версия             = "1.0";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .ДобавитьOAuthV1Авторизацию(Токен, Секрет, КлючПользователя, СекретПользователя, Версия)
        .УстановитьАлгоритмOAuthV1("HMAC", "SHA1") // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьАлгоритмOAuthV1");

КонецПроцедуры

Процедура HTTPКлиент_ОбработатьЗапрос(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ОбработатьЗапрос("GET") // <---
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ОбработатьЗапрос");

КонецПроцедуры

Процедура HTTPКлиент_ВыполнитьЗапрос(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ОбработатьЗапрос("GET", Ложь)
        .ВыполнитьЗапрос() // <---
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ВыполнитьЗапрос");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьОтвет(Истина);

    Обработать(Результат, "HTTPКлиент", "ВыполнитьЗапрос", "Без выполнения");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ОбработатьЗапрос("GET", Ложь)
        .ВыполнитьЗапрос()
        .ВернутьОтвет(Истина);

    Обработать(Результат, "HTTPКлиент", "ВыполнитьЗапрос", "Выполнение");

КонецПроцедуры

Процедура HTTPКлиент_ВернутьЗапрос(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос(); // <---

    // END

    Обработать(Результат, "HTTPКлиент", "ВернутьЗапрос");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ВернутьЗапрос(Истина);

    Обработать(Результат, "HTTPКлиент", "ВернутьЗапрос", "Принудительно");

КонецПроцедуры

Процедура HTTPКлиент_ВернутьСоединение(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьСоединение(); // <---

    // END

    Обработать(Результат, "HTTPКлиент", "ВернутьСоединение");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ВернутьСоединение(Истина);

    Обработать(Результат, "HTTPКлиент", "ВернутьСоединение", "Принудительно");

КонецПроцедуры

Процедура HTTPКлиент_ВернутьОтвет(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Картинка)
        .ОбработатьЗапрос("POST")
        .ВернутьОтвет(); // <---

    // END

    Обработать(Результат, "HTTPКлиент", "ВернутьОтвет");

КонецПроцедуры

Процедура HTTPКлиент_ВернутьОтветКакJSONКоллекцию(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Картинка)
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакJSONКоллекцию(); // <---

    // END

    Обработать(Результат, "HTTPКлиент", "ВернутьОтветКакJSONКоллекцию");

КонецПроцедуры

Процедура HTTPКлиент_ВернутьОтветКакДвоичныеДанные(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Картинка)
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакДвоичныеДанные(); // <---

    // END

    Обработать(Результат, "HTTPКлиент", "ВернутьОтветКакДвоичныеДанные");

КонецПроцедуры

Процедура HTTPКлиент_ВернутьОтветКакСтроку(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/post";

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Картинка)
        .ОбработатьЗапрос("POST")
        .ВернутьОтветКакСтроку(); // <---

    // END

    Обработать(Результат, "HTTPКлиент", "ВернутьОтветКакСтроку");

КонецПроцедуры

Процедура HTTPКлиент_ВернутьИмяФайлаТелаОтвета(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    ИВФ = ПолучитьИмяВременногоФайла();

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьФайлОтвета(ИВФ) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьИмяФайлаТелаОтвета();

    // END

    Обработать(Результат, "HTTPКлиент", "ВернутьИмяФайлаТелаОтвета", , ИВФ);

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьПрокси(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    НастройкиПрокси = Новый ИнтернетПрокси;
    НастройкиПрокси.Установить("https", "proxy.com", 443, "user", "password", Ложь);

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .УстановитьПрокси(НастройкиПрокси) // <---
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьСоединение();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьПрокси");

КонецПроцедуры

Процедура HTTPКлиент_УстановитьТаймаут(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .УстановитьТаймаут(60) // <---
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьСоединение();

    // END

    Обработать(Результат, "HTTPКлиент", "УстановитьТаймаут");

КонецПроцедуры

Процедура HTTPКлиент_ИспользоватьКодированиеURL(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    СтруктураПараметров = Новый Структура;
    СтруктураПараметров.Вставить("param1", "search?text");
    СтруктураПараметров.Вставить("param2", "John Doe");
    СтруктураПараметров.Вставить("param3", "value&another");
    СтруктураПараметров.Вставить("param4", "кириллица");
    СтруктураПараметров.Вставить("param5", "<script>alert('XSS')</script>");

    БезКодирования = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page")
        .УстановитьПараметрыURL(СтруктураПараметров)
        .ИспользоватьКодированиеURL(Ложь) // <---
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    СКодированием = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page")
        .УстановитьПараметрыURL(СтруктураПараметров)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    // END

    Результат = Новый Соответствие;
    Результат.Вставить("Без кодирования", БезКодирования);
    Результат.Вставить("С кодированием" , СКодированием);

    Обработать(Результат, "HTTPКлиент", "ИспользоватьКодированиеURL");

КонецПроцедуры

Процедура HTTPКлиент_РазделятьМассивыВURL(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/get";

    ПараметрМассив = Новый Массив;
    ПараметрМассив.Добавить("val1");
    ПараметрМассив.Добавить("val2");
    ПараметрМассив.Добавить("val3");

    СтруктураПараметров = Новый Структура("arrayfield", ПараметрМассив);

    Разделение = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page")
        .УстановитьПараметрыURL(СтруктураПараметров)
        .РазделятьМассивыВURL(Истина) // <---
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    РазделениеPhp = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page")
        .УстановитьПараметрыURL(СтруктураПараметров)
        .РазделятьМассивыВURL(Истина, Истина) // <---
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    БезРазделения = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать("https://example.com/page")
        .УстановитьПараметрыURL(СтруктураПараметров)
        .ОбработатьЗапрос("GET", Ложь)
        .ВернутьЗапрос()
        .АдресРесурса;

    // END

    Результат = Новый Соответствие;
    Результат.Вставить("Без разделения", БезРазделения);
    Результат.Вставить("Разделение"    , Разделение);
    Результат.Вставить("PHP"           , РазделениеPhp);

    Обработать(Результат, "HTTPКлиент", "РазделятьМассивыВURL");

КонецПроцедуры

Процедура HTTPКлиент_ОтправитьДанныеЧастями(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/put";

    РазмерЧасти = 524288;
    Картинка    = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Картинка)
        .ОтправитьДанныеЧастями(РазмерЧасти) // <---
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ОтправитьДанныеЧастями");

КонецПроцедуры

Процедура HTTPКлиент_ОтправитьЧасть(ПараметрыФункции)

    URL = ПараметрыФункции["HTTP_URL"];
    URL = URL + "/put";

    РазмерЧасти = 524288;
    Данные      = ПолучитьДвоичныеДанныеИзСтроки("Some data for sending");

    // Отправляем только "data for"
    НачальнаяПозиция = 5;
    ЧислоБайт        = 8;

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(URL)
        .УстановитьДвоичноеТело(Данные)
        .ОтправитьЧасть(НачальнаяПозиция, ЧислоБайт) // <---
        .ВернутьОтветКакJSONКоллекцию();

    // END

    Обработать(Результат, "HTTPКлиент", "ОтправитьЧасть");

КонецПроцедуры

Процедура HTTPКлиент_МаксимумПопыток(ПараметрыФункции)

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .МаксимумПопыток(10)
        .ВернутьНастройки();

    // END

    Обработать(Результат, "HTTPКлиент", "МаксимумПопыток");

КонецПроцедуры

Процедура HTTPКлиент_МаксимумПереадресаций(ПараметрыФункции)

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .МаксимумПереадресаций(15)
        .ВернутьНастройки();

    // END

    Обработать(Результат, "HTTPКлиент", "МаксимумПереадресаций");

КонецПроцедуры

Процедура HTTPКлиент_ВернутьНастройки(ПараметрыФункции)

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .ВернутьНастройки();

    // END

    Обработать(Результат, "HTTPКлиент", "ВернутьНастройки");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .ВернутьНастройки("КодировкаТелаЗапроса");

    Обработать(Результат, "HTTPКлиент", "ВернутьНастройки", "Одиночный");

    МассивНастроек = Новый Массив;
    МассивНастроек.Добавить("МаксимумПопыток");
    МассивНастроек.Добавить("МаксимумПереадресаций");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .МаксимумПопыток(5)
        .ВернутьНастройки(МассивНастроек);

    Обработать(Результат, "HTTPКлиент", "ВернутьНастройки", "Массив");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .ВернутьНастройки("ААА");

    Обработать(Результат, "HTTPКлиент", "ВернутьНастройки", "Несуществующий");

КонецПроцедуры

#КонецОбласти

#Область OpenAI

Процедура OpenAI_ПолучитьОтвет(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    // Текстовые сообщения

    Сообщения = Новый Массив;
    Сообщения.Добавить(OPI_OpenAI.ПолучитьСтруктуруСообщения("user"     , "What is 1C:Enterprise?"));
    Сообщения.Добавить(OPI_OpenAI.ПолучитьСтруктуруСообщения("assistant", "1C:Enterprise is a full-stack, low-code platform"));
    Сообщения.Добавить(OPI_OpenAI.ПолучитьСтруктуруСообщения("user"     , "When the first version was released?"));

    Модель = "smolvlm-256m-instruct";

    Результат = OPI_OpenAI.ПолучитьОтвет(URL, Токен, Модель, Сообщения);

    Обработать(Результат, "OpenAI", "ПолучитьОтвет"); // SKIP

    // Картинки

    Модель     = "moondream2-20250414";
    Файл       = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    ИмяФайла   = СтрШаблон("%1.png", Строка(Новый УникальныйИдентификатор()));
    Назначение = "user_data";

    Сообщения = Новый Массив;

    ЗагрузкаКартинки = OPI_OpenAI.ЗагрузитьФайл(URL, Токен, ИмяФайла, Файл, Назначение);

    Обработать(ЗагрузкаКартинки, "OpenAI", "ПолучитьОтвет", "Загрузка картинки"); // SKIP

    IDКартинки = ЗагрузкаКартинки["id"];

    Описание = OPI_OpenAI.ПолучитьСтруктуруСообщенияКартинки("user", IDКартинки, "What is in this image?");

    Сообщения.Добавить(Описание);

    Результат = OPI_OpenAI.ПолучитьОтвет(URL, Токен, Модель, Сообщения);

    OPI_OpenAI.УдалитьФайл(URL, Токен, IDКартинки);

    // END

    Обработать(Результат, "OpenAI", "ПолучитьОтвет", "Картинка");

КонецПроцедуры

Процедура OpenAI_ПолучитьПредставления(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Текст  = "What is 1C:Enterprise?";
    Модель = "arcee-ai_afm-4.5b";

    Результат = OPI_OpenAI.ПолучитьПредставления(URL, Токен, Модель, Текст);

    // END

    Обработать(Результат, "OpenAI", "ПолучитьПредставления");

КонецПроцедуры

Процедура OpenAI_СоздатьАссистента(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Инструкция = "You are a personal math tutor. When asked a question, write and run Python code to answer the question.";
    Модель     = "smolvlm-256m-instruct";
    Имя        = "Math tutor";

    Результат = OPI_OpenAI.СоздатьАссистента(URL, Токен, Модель, Имя, Инструкция);

    // END

    Обработать(Результат, "OpenAI", "СоздатьАссистента", , ПараметрыФункции);

КонецПроцедуры

Процедура OpenAI_УдалитьАссистента(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    IDАссистента = ПараметрыФункции["OpenAI_Assistant"];

    Результат = OPI_OpenAI.УдалитьАссистента(URL, Токен, IDАссистента);

    // END

    Обработать(Результат, "OpenAI", "УдалитьАссистента", , IDАссистента);

КонецПроцедуры

Процедура OpenAI_ПолучитьАссистента(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    IDАссистента = ПараметрыФункции["OpenAI_Assistant"];

    Результат = OPI_OpenAI.ПолучитьАссистента(URL, Токен, IDАссистента);

    // END

    Обработать(Результат, "OpenAI", "ПолучитьАссистента");

КонецПроцедуры

Процедура OpenAI_ПолучитьСписокАссистентов(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Количество   = 2;
    ДопПараметры = Новый Структура("after,order", "asst_2", "desc");

    Результат = OPI_OpenAI.ПолучитьСписокАссистентов(URL, Токен, Количество, ДопПараметры);

    // END

    Обработать(Результат, "OpenAI", "ПолучитьСписокАссистентов");

КонецПроцедуры

Процедура OpenAI_ЗагрузитьФайл(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Файл = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    ИмяФайла   = СтрШаблон("%1.png", Строка(Новый УникальныйИдентификатор()));
    Назначение = "assistants";

    Результат = OPI_OpenAI.ЗагрузитьФайл(URL, Токен, ИмяФайла, Файл, Назначение);

    // END

    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Файл);
    Обработать(Результат, "OpenAI", "ЗагрузитьФайл", , ПараметрыФункции, ИмяФайла, Файл.Размер() + 2);

КонецПроцедуры

Процедура OpenAI_УдалитьФайл(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    IDФайла = ПараметрыФункции["OpenAI_File"];

    Результат = OPI_OpenAI.УдалитьФайл(URL, Токен, IDФайла);

    // END

    Обработать(Результат, "OpenAI", "УдалитьФайл", , IDФайла);

КонецПроцедуры

Процедура OpenAI_ПолучитьИнформациюОФайле(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    IDФайла = ПараметрыФункции["OpenAI_File"];

    Результат = OPI_OpenAI.ПолучитьИнформациюОФайле(URL, Токен, IDФайла);

    // END

    Обработать(Результат, "OpenAI", "ПолучитьИнформациюОФайле");

КонецПроцедуры

Процедура OpenAI_ПолучитьСписокФайлов(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Результат = OPI_OpenAI.ПолучитьСписокФайлов(URL, Токен);

    // END

    Обработать(Результат, "OpenAI", "ПолучитьСписокФайлов");

КонецПроцедуры

Процедура OpenAI_СкачатьФайл(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    IDФайла = ПараметрыФункции["OpenAI_File"];

    Результат = OPI_OpenAI.СкачатьФайл(URL, Токен, IDФайла);

    // END

    Обработать(Результат, "OpenAI", "СкачатьФайл", , ПараметрыФункции);

КонецПроцедуры

Процедура OpenAI_ПолучитьСтруктуруСообщения(ПараметрыФункции)

    Результат = OPI_OpenAI.ПолучитьСтруктуруСообщения("user", "What is 1C:Enterprise?");

    // END

    Обработать(Результат, "OpenAI", "ПолучитьСтруктуруСообщения");

КонецПроцедуры

Процедура OpenAI_ПолучитьСтруктуруСообщенияКартинки(ПараметрыФункции)

    URL      = ПараметрыФункции["OpenAI_URL"];
    Токен    = ПараметрыФункции["OpenAI_Token"];
    Картинка = ПараметрыФункции["OpenAI_File"];

    Результат = OPI_OpenAI.ПолучитьСтруктуруСообщенияКартинки("user", Картинка, "What is in this image?");

    // END

    Обработать(Результат, "OpenAI", "ПолучитьСтруктуруСообщенияКартинки");

КонецПроцедуры

Процедура OpenAI_СгенерироватьРечь(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Текст  = "Attack ships on fire off the shoulder of Orion bright as magnesium";
    Модель = "bark-cpp-small";

    ДопПараметры = Новый Структура("response_format", "wav");

    Результат = OPI_OpenAI.СгенерироватьРечь(URL, Токен, Модель, Текст, , ДопПараметры);

    // END

    Обработать(Результат, "OpenAI", "СгенерироватьРечь", , ПараметрыФункции);

КонецПроцедуры

Процедура OpenAI_СоздатьТранскрипцию(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Аудио  = ПараметрыФункции["OpenAI_Speech"];
    Модель = "whisper-1";

    Результат = OPI_OpenAI.СоздатьТранскрипцию(URL, Токен, Модель, Аудио, "audio/wav");

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(Аудио, "Не удалось удалить временный файл после теста!");

    Обработать(Результат, "OpenAI", "СоздатьТранскрипцию");

КонецПроцедуры

Процедура OpenAI_ПолучитьКартинки(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Модель    = "sd-1.5-ggml";
    Описание  = OPI_OpenAI.ПолучитьСтруктуруОписанияКартинок("Yellow alpaca", 1, , "64x64");
    Результат = OPI_OpenAI.ПолучитьКартинки(URL, Токен, Модель, Описание);

    // END

    Обработать(Результат, "OpenAI", "ПолучитьКартинки");

КонецПроцедуры

Процедура OpenAI_ПолучитьСписокМоделей(ПараметрыФункции)

    URL   = ПараметрыФункции["OpenAI_URL"];
    Токен = ПараметрыФункции["OpenAI_Token"];

    Результат = OPI_OpenAI.ПолучитьСписокМоделей(URL, Токен);

    // END

    Обработать(Результат, "OpenAI", "ПолучитьСписокМоделей");

КонецПроцедуры

Процедура OpenAI_ПолучитьСообщениеАссистента(ПараметрыФункции)

    Результат = OPI_OpenAI.ПолучитьСообщениеАссистента("What is 1C:Enterprise?");

    // END

    Проверка  = OPI_OpenAI.ПолучитьСтруктуруСообщения("assistant", "What is 1C:Enterprise?");
    Проверка  = OPI_Инструменты.JSONСтрокой(Проверка);
    Результат = OPI_Инструменты.JSONСтрокой(Результат);

    Обработать(Результат, "OpenAI", "ПолучитьСообщениеАссистента", , Проверка);

КонецПроцедуры

Процедура OpenAI_ПолучитьСообщениеПользователя(ПараметрыФункции)

    Результат = OPI_OpenAI.ПолучитьСообщениеПользователя("What is 1C:Enterprise?", "Vitaly");

    // END

    Проверка  = OPI_OpenAI.ПолучитьСтруктуруСообщения("user", "What is 1C:Enterprise?", "Vitaly");
    Проверка  = OPI_Инструменты.JSONСтрокой(Проверка);
    Результат = OPI_Инструменты.JSONСтрокой(Результат);

    Обработать(Результат, "OpenAI", "ПолучитьСообщениеПользователя", , Проверка);

КонецПроцедуры

Процедура OpenAI_ПолучитьСообщениеСистемы(ПараметрыФункции)

    Результат = OPI_OpenAI.ПолучитьСообщениеСистемы("What is 1C:Enterprise?");

    // END

    Проверка  = OPI_OpenAI.ПолучитьСтруктуруСообщения("system", "What is 1C:Enterprise?");
    Проверка  = OPI_Инструменты.JSONСтрокой(Проверка);
    Результат = OPI_Инструменты.JSONСтрокой(Результат);

    Обработать(Результат, "OpenAI", "ПолучитьСообщениеСистемы", , Проверка);

КонецПроцедуры

#КонецОбласти

#Область MSSQL

Процедура MSSQL_СформироватьСтрокуПодключения(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];

    Результат = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль);

    // END

    Результат = СтрЗаменить(Результат, Пароль, "***");
    Результат = СтрЗаменить(Результат, Адрес , "127.0.0.1");

    Обработать(Результат, "MSSQL", "СформироватьСтрокуПодключения");

КонецПроцедуры

Процедура MSSQL_ОткрытьСоединение(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];

    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль);
    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);

    Результат = OPI_MSSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "ОткрытьСоединение");

КонецПроцедуры

Процедура MSSQL_ЗакрытьСоединение(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];

    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль);
    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);

    Соединение = OPI_MSSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);
    Результат  = OPI_MSSQL.ЗакрытьСоединение(Соединение);

    // END

    OPI_MSSQL.ЗакрытьСоединение(Результат);

    Обработать(Результат, "MSSQL", "ЗакрытьСоединение");

КонецПроцедуры

Процедура MSSQL_ЭтоКоннектор(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];

    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль);
    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);

    Соединение = OPI_MSSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);
    Результат  = OPI_MSSQL.ЭтоКоннектор(Соединение);

    // END

    OPI_MSSQL.ЗакрытьСоединение(Результат);

    Обработать(Результат, "MSSQL", "ЭтоКоннектор");

КонецПроцедуры

Процедура MSSQL_ВыполнитьЗапросSQL(ПараметрыФункции)

    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();
    Картинка    = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);
    Соединение        = OPI_MSSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    OPI_MSSQL.УдалитьТаблицу("users"     , Соединение);                   // SKIP
    OPI_MSSQL.УдалитьТаблицу("test_data" , Соединение);                   // SKIP
    OPI_MSSQL.УдалитьТаблицу("test_table", Соединение);                  // SKIP
    Обработать(Соединение, "MSSQL", "ВыполнитьЗапросSQL", "Соединение"); // SKIP

    // CREATE

    ТекстЗапроса = "
        |CREATE TABLE test_table (
        |    ID INT PRIMARY KEY,
        |    FirstName NVARCHAR(50),
        |    LastName NVARCHAR(50),
        |    BirthDate DATE,
        |    IsEmployed BIT,
        |    Salary DECIMAL(10, 2),
        |    CreatedAt DATETIME,
        |    Age SMALLINT,
        |    RowGuid UNIQUEIDENTIFIER,
        |    Data VARBINARY(MAX)
        |);";

    Результат = OPI_MSSQL.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "MSSQL", "ВыполнитьЗапросSQL", "Create"); // SKIP

    // INSERT с параметрами

    ТекстЗапроса = "
        |INSERT INTO test_table (ID, FirstName, LastName, BirthDate, IsEmployed, Salary, CreatedAt, Age, RowGuid, Data)
        |VALUES (@P1, @P2, @P3, @P4, @P5, @P6, @P7, @P8, @P9, @P10);";

    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(Новый Структура("INT"     , 1));
    МассивПараметров.Добавить(Новый Структура("NVARCHAR", "Vitaly"));
    МассивПараметров.Добавить(Новый Структура("NVARCHAR", "Alpaca"));
    МассивПараметров.Добавить(Новый Структура("DATE"    , ТекущаяДата));
    МассивПараметров.Добавить(Новый Структура("BIT"     , Истина));
    МассивПараметров.Добавить(Новый Структура("DECIMAL" , 10.30));
    МассивПараметров.Добавить(Новый Структура("DATETIME", ТекущаяДата));
    МассивПараметров.Добавить(Новый Структура("SMALLINT", 20));
    МассивПараметров.Добавить(Новый Структура("UUID"    , Новый УникальныйИдентификатор));
    МассивПараметров.Добавить(Новый Структура("BYTES"   , Картинка));

    Результат = OPI_MSSQL.ВыполнитьЗапросSQL(ТекстЗапроса, МассивПараметров, , Соединение);

    Обработать(Результат, "MSSQL", "ВыполнитьЗапросSQL", "Insert"); // SKIP

    // SELECT (Результат этого запроса приведен в следующем блоке)

    ТекстЗапроса = "SELECT FirstName, LastName, BirthDate, IsEmployed, Salary, CreatedAt, Age, RowGuid, Data FROM test_table;";

    Результат = OPI_MSSQL.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    Обработать(Результат, "MSSQL", "ВыполнитьЗапросSQL", , Картинка); // SKIP

    ТекстЗапроса = "create table test_data (id INT,first_name NVARCHAR(50),last_name NVARCHAR(50),email NVARCHAR(50),gender NVARCHAR(50),ip_address NVARCHAR(20));"; // SKIP
    Результат    = OPI_MSSQL.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);                                                                                       // SKIP
    Обработать(Результат, "MSSQL", "ВыполнитьЗапросSQL", "Test data");                                                                                               // SKIP

    // SQL запрос из файла

    ФайлSQL = ПараметрыФункции["SQL2"]; // Двоичные данные, URL или путь к файлу

    Результат = OPI_MSSQL.ВыполнитьЗапросSQL(ФайлSQL, , , Соединение);

    Обработать(Результат, "MSSQL", "ВыполнитьЗапросSQL", "Файл"); // SKIP

    Закрытие = OPI_MSSQL.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Закрытие, "MSSQL", "ВыполнитьЗапросSQL", "Запрос"); // SKIP

КонецПроцедуры

Процедура MSSQL_ПолучитьНастройкиTLS(ПараметрыФункции)

    Результат = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);

    // END

    Обработать(Результат, "MSSQL", "ПолучитьНастройкиTLS");

КонецПроцедуры

Процедура MSSQL_СоздатьБазуДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль);

    База = "testbase1";

    OPI_MSSQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.СоздатьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "СоздатьБазуДанных");

    База = "testbase2";
    OPI_MSSQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    Подключение = OPI_MSSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    Обработать(Подключение, "MSSQL", "СоздатьБазуДанных", "Открытие");

    Результат = OPI_MSSQL.СоздатьБазуДанных(База, Подключение);

    Обработать(Результат, "MSSQL", "СоздатьБазуДанных", "Создание");

    Результат = OPI_MSSQL.СоздатьБазуДанных(База, Подключение);

    Обработать(Результат, "MSSQL", "СоздатьБазуДанных", "Существующая");

    OPI_MSSQL.ЗакрытьСоединение(Подключение);

КонецПроцедуры

Процедура MSSQL_СоздатьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    Таблица = "testtable";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("tinyint_field"  , "tinyint");
    СтруктураКолонок.Вставить("smallint_field" , "smallint");
    СтруктураКолонок.Вставить("int_field"      , "int");
    СтруктураКолонок.Вставить("bigint_field"   , "bigint");
    СтруктураКолонок.Вставить("float24_field"  , "float(24)");
    СтруктураКолонок.Вставить("float53_field"  , "float(53)");
    СтруктураКолонок.Вставить("bit_field"      , "bit");
    СтруктураКолонок.Вставить("nvarchar_field" , "nvarchar(4000)");
    СтруктураКолонок.Вставить("varbinary_field", "varbinary(max)");
    СтруктураКолонок.Вставить("uid_field"      , "uniqueidentifier");
    СтруктураКолонок.Вставить("numeric_field"  , "numeric(5,3)"); // Или decimal
    СтруктураКолонок.Вставить("xml_field"      , "xml");
    СтруктураКолонок.Вставить("date_field"     , "date");
    СтруктураКолонок.Вставить("time_field"     , "time");
    СтруктураКолонок.Вставить("dto_field"      , "datetimeoffset");
    СтруктураКолонок.Вставить("datetime_field" , "datetime");

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "СоздатьТаблицу");

    Таблица = "АБВ ГДЕ";

    Результат = OPI_MSSQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "СоздатьТаблицу", "Ошибка имени");

    Таблица = "somename";
    СтруктураКолонок.Вставить("wtf_field", "WTF");

    Результат = OPI_MSSQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "СоздатьТаблицу", "Ошибка типа");

КонецПроцедуры

Процедура MSSQL_ДобавитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    Таблица       = "testtable";
    МассивЗаписей = Новый Массив;

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    XML = "<?xml version=""1.0""?><root>
        |    <element>
        |        <name>Пример</name>
        |        <value>123</value>
        |    </element>
        |    <element>
        |        <name>Тест</name>
        |        <value>456</value>
        |    </element>
        |</root>";

    ТекущаяДата   = OPI_Инструменты.ПолучитьТекущуюДату();
    ТекущаяДатаЧП = OPI_Инструменты.ДатаRFC3339(ТекущаяДата, "+05:00");

    СтруктураЗаписи = Новый Структура;
    СтруктураЗаписи.Вставить("tinyint_field"  , Новый Структура("TINYINT"       , 5));
    СтруктураЗаписи.Вставить("smallint_field" , Новый Структура("SMALLINT"      , 2000));
    СтруктураЗаписи.Вставить("int_field"      , Новый Структура("INT"           , 200000));
    СтруктураЗаписи.Вставить("bigint_field"   , Новый Структура("BIGINT"        , 20000000000));
    СтруктураЗаписи.Вставить("float24_field"  , Новый Структура("FLOAT24"       , 10.1234567));
    СтруктураЗаписи.Вставить("float53_field"  , Новый Структура("FLOAT53"       , 10.123456789123456));
    СтруктураЗаписи.Вставить("bit_field"      , Новый Структура("BIT"           , Истина));
    СтруктураЗаписи.Вставить("nvarchar_field" , Новый Структура("NVARCHAR"      , "Some text"));
    СтруктураЗаписи.Вставить("varbinary_field", Новый Структура("BYTES"         , Картинка));
    СтруктураЗаписи.Вставить("uid_field"      , Новый Структура("UUID"          , Новый УникальныйИдентификатор));
    СтруктураЗаписи.Вставить("numeric_field"  , Новый Структура("NUMERIC"       , 5.333));
    СтруктураЗаписи.Вставить("xml_field"      , Новый Структура("XML"           , XML));
    СтруктураЗаписи.Вставить("date_field"     , Новый Структура("DATE"          , ТекущаяДата));
    СтруктураЗаписи.Вставить("time_field"     , Новый Структура("TIME"          , ТекущаяДата));
    СтруктураЗаписи.Вставить("dto_field"      , Новый Структура("DATETIMEOFFSET", ТекущаяДатаЧП));
    СтруктураЗаписи.Вставить("datetime_field" , Новый Структура("DATETIME"      , ТекущаяДата));

    МассивЗаписей.Добавить(СтруктураЗаписи);

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.ДобавитьЗаписи(Таблица, МассивЗаписей, Истина, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "ДобавитьЗаписи");

КонецПроцедуры

Процедура MSSQL_ПолучитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    // Все записи без отборов

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "ПолучитьЗаписи"); // SKIP

    // Отборы, выбранные поля, количество и сортировка

    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, "test_data", Логин, Пароль);

    Таблица = "test_data";

    Поля = Новый Массив;
    Поля.Добавить("first_name");
    Поля.Добавить("last_name");
    Поля.Добавить("email");

    Фильтры = Новый Массив;

    СтруктураФильтра1 = Новый Структура;

    СтруктураФильтра1.Вставить("field", "gender");
    СтруктураФильтра1.Вставить("type" , "=");
    СтруктураФильтра1.Вставить("value", "Male");
    СтруктураФильтра1.Вставить("union", "AND");
    СтруктураФильтра1.Вставить("raw"  , Ложь);

    СтруктураФильтра2 = Новый Структура;

    СтруктураФильтра2.Вставить("field", "id");
    СтруктураФильтра2.Вставить("type" , "BETWEEN");
    СтруктураФильтра2.Вставить("value", "20 AND 50");
    СтруктураФильтра2.Вставить("raw"  , Истина);

    Фильтры.Добавить(СтруктураФильтра1);
    Фильтры.Добавить(СтруктураФильтра2);

    Сортировка = Новый Структура("ip_address", "DESC");
    Количество = 5;

    Результат = OPI_MSSQL.ПолучитьЗаписи(Таблица, Поля, Фильтры, Сортировка, Количество, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "ПолучитьЗаписи", "Отборы");

КонецПроцедуры

Процедура MSSQL_ОбновитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    Таблица = "test_data";

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("ip_address", Новый Структура("VARCHAR", "127.0.0.1"));

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "gender");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("NVARCHAR", "Male"));
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Количество = OPI_MSSQL.ПолучитьЗаписи(Таблица, , Фильтры, , , СтрокаПодключения, НастройкиTLS); // SKIP
    Обработать(Количество, "MSSQL", "ОбновитьЗаписи", "Количество");                                // SKIP
    Количество = Количество["data"].Количество();                                                   // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.ОбновитьЗаписи(Таблица, СтруктураПолей, СтруктураФильтра, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "ОбновитьЗаписи");

    Проверка = OPI_MSSQL.ПолучитьЗаписи(Таблица, "['ip_address']", Фильтры, , , СтрокаПодключения, НастройкиTLS);

    Обработать(Проверка, "MSSQL", "ОбновитьЗаписи", "Проверка", Количество, СтруктураПолей);

КонецПроцедуры

Процедура MSSQL_УдалитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    Таблица = "test_data";

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "gender");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("NVARCHAR", "Male"));
    СтруктураФильтра.Вставить("raw"  , Ложь);
    СтруктураФильтра.Вставить("union", "AND");

    Фильтры.Добавить(СтруктураФильтра);

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "ip_address");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("NVARCHAR", "127.0.0.1"));
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Получение = OPI_MSSQL.ПолучитьЗаписи(Таблица, , Фильтры, , , СтрокаПодключения, НастройкиTLS); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.УдалитьЗаписи(Таблица, Фильтры, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Получение, "MSSQL", "УдалитьЗаписи", "Получение");

    Количество = Получение["data"].Количество();
    Остаток    = 100 - Количество;

    Обработать(Результат, "MSSQL", "УдалитьЗаписи");

    Результат = OPI_MSSQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "УдалитьЗаписи", "Проверка", Остаток);

КонецПроцедуры

Процедура MSSQL_УдалитьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.УдалитьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "УдалитьТаблицу");

    База    = "test_data";
    Таблица = "test_data";

    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);
    Результат         = OPI_MSSQL.УдалитьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "УдалитьТаблицу", "Тест");

КонецПроцедуры

Процедура MSSQL_УдалитьБазуДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль);

    База = "testbase1";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "УдалитьБазуДанных");

    База = "testbase2";

    Подключение = OPI_MSSQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    Обработать(Подключение, "MSSQL", "УдалитьБазуДанных", "Открытие");

    Результат = OPI_MSSQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "MSSQL", "УдалитьБазуДанных", "Удаление");

    Результат = OPI_MSSQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "MSSQL", "УдалитьБазуДанных", "Ошибка");

    Закрытие = OPI_MSSQL.ЗакрытьСоединение(Подключение);

    Обработать(Закрытие, "MSSQL", "УдалитьБазуДанных", "Закрытие");

    Результат = OPI_MSSQL.УдалитьБазуДанных(База, Подключение);

    Обработать(Результат, "MSSQL", "УдалитьБазуДанных", "Ошибка подключения");

КонецПроцедуры

Процедура MSSQL_ОчиститьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.ОчиститьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "ОчиститьТаблицу");

    Результат = OPI_MSSQL.ПолучитьЗаписи(Таблица, , , , , СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "ОчиститьТаблицу", "Проверка");

КонецПроцедуры

Процедура MSSQL_ПолучитьИнформациюОТаблице(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "ПолучитьИнформациюОТаблице");

    Таблица = "heyho";

    Результат = OPI_MSSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "ПолучитьИнформациюОТаблице", "Ошибка");

КонецПроцедуры

Процедура MSSQL_ДобавитьКолонкуТаблицы(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];

    База      = "testbase1";
    Таблица   = "testtable";
    Имя       = "new_field";
    ТипДанных = "bigint";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.ДобавитьКолонкуТаблицы(Таблица, Имя, ТипДанных, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "ДобавитьКолонкуТаблицы");

    Результат = OPI_MSSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "ДобавитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура MSSQL_УдалитьКолонкуТаблицы(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];

    База    = "testbase1";
    Таблица = "testtable";
    Имя     = "new_field";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.УдалитьКолонкуТаблицы(Таблица, Имя, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "УдалитьКолонкуТаблицы");

    Результат = OPI_MSSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "УдалитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура MSSQL_ГарантироватьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "SA";
    Пароль = ПараметрыФункции["PG_Password"];

    База    = "testbase1";
    Таблица = "testtable";

    НастройкиTLS      = OPI_MSSQL.ПолучитьНастройкиTLS(Истина);
    СтрокаПодключения = OPI_MSSQL.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль);

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("smallint_field" , "smallint");
    СтруктураКолонок.Вставить("double_field"   , "real");
    СтруктураКолонок.Вставить("bigint_field"   , "bigint");
    СтруктураКолонок.Вставить("custom_field"   , "nvarchar");

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Результат = OPI_MSSQL.ГарантироватьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    // END

    Обработать(Результат, "MSSQL", "ГарантироватьТаблицу");

    Проверка = OPI_MSSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Проверка, "MSSQL", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

    Таблица = "test_new";

    Результат = OPI_MSSQL.ГарантироватьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS);

    Обработать(Результат, "MSSQL", "ГарантироватьТаблицу", "Новая");

    Проверка = OPI_MSSQL.ПолучитьИнформациюОТаблице(Таблица, СтрокаПодключения, НастройкиTLS);

    Обработать(Проверка, "MSSQL", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

КонецПроцедуры

Процедура MSSQL_ПолучитьСтруктуруФильтраЗаписей(ПараметрыФункции)

    Результат = OPI_MSSQL.ПолучитьСтруктуруФильтраЗаписей();

    // END

    Обработать(Результат, "MSSQL", "ПолучитьСтруктуруФильтраЗаписей");

    Результат = OPI_MSSQL.ПолучитьСтруктуруФильтраЗаписей(Истина);

    Обработать(Результат, "MSSQL", "ПолучитьСтруктуруФильтраЗаписей", "Пустая");

КонецПроцедуры

#КонецОбласти

#Область FTP

Процедура FTP_ОткрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Результат = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    // END

    Обработать(Результат, "FTP", "ОткрытьСоединение", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьПриветственноеСообщение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.ПолучитьПриветственноеСообщение(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "ПолучитьПриветственноеСообщение", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьКонфигурациюСоединения(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Результат = OPI_FTP.ПолучитьКонфигурациюСоединения(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    // END

    Обработать(Результат, "FTP", "ПолучитьКонфигурациюСоединения", Постфикс, ПараметрыФункции);

    Проверка = OPI_FTP.ПолучитьПриветственноеСообщение(Результат);

    Обработать(Проверка, "FTP", "ПолучитьКонфигурациюСоединения", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура FTP_ЗакрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Обработать(Соединение, "FTP", "ЗакрытьСоединение", "Открытие, " + Постфикс);  // SKIP

    Результат = OPI_FTP.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "FTP", "ЗакрытьСоединение", Постфикс);

КонецПроцедуры

Процедура FTP_ЭтоКоннектор(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Обработать(Соединение, "FTP", "ЭтоКоннектор", "Открытие, " + Постфикс);  // SKIP

    Результат = OPI_FTP.ЭтоКоннектор(Соединение);

    // END

    Обработать(Результат, "FTP", "ЭтоКоннектор", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьНастройкиСоединения(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    Результат = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    // END

    Обработать(Результат, "FTP", "ПолучитьНастройкиСоединения", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьНастройкиПрокси(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

    АдресПрокси  = ПараметрыФункции["Proxy_IP"];
    ПортПрокси   = ПараметрыФункции["Proxy_Port"];
    ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
    ПарольПрокси = ПараметрыФункции["Proxy_Password"];

    Результат = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    // END

    Обработать(Результат, "FTP", "ПолучитьНастройкиПрокси", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьНастройкиTLS(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Результат = OPI_FTP.ПолучитьНастройкиTLS(Истина);

    // END

    Обработать(Результат, "FTP", "ПолучитьНастройкиTLS", Постфикс);

КонецПроцедуры

Процедура FTP_СоздатьНовуюДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        Удаление = OPI_FTP.УдалитьДиректорию(Соединение, "new_dir");                // SKIP
        Обработать(Удаление, "FTP", "СоздатьНовуюДиректорию", "Удаление, " + Постфикс);  // SKIP

        Результат = OPI_FTP.СоздатьНовуюДиректорию(Соединение, "new_dir");

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "СоздатьНовуюДиректорию", Постфикс, Истина);

    Результат = OPI_FTP.СоздатьНовуюДиректорию(Соединение, "new_dir/another_one");

    Обработать(Результат, "FTP", "СоздатьНовуюДиректорию", "Вложенная, " + Постфикс);

    Результат = OPI_FTP.СоздатьНовуюДиректорию(Соединение, "second_dir/another_one");

    Обработать(Результат, "FTP", "СоздатьНовуюДиректорию", "Двойная, " + Постфикс);

    OPI_Инструменты.Пауза(5);

    Проверка = OPI_FTP.ПолучитьСписокОбъектов(Соединение, "new_dir", Истина);

    Обработать(Проверка, "FTP", "СоздатьНовуюДиректорию", "Проверка 1, " + Постфикс);

    Проверка = OPI_FTP.ПолучитьСписокОбъектов(Соединение, "", Истина);

    Обработать(Проверка, "FTP", "СоздатьНовуюДиректорию", "Проверка 2, " + Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьСписокОбъектов(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.ПолучитьСписокОбъектов(Соединение, "", Истина);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "ПолучитьСписокОбъектов", Постфикс);

    Результат = OPI_FTP.ПолучитьСписокОбъектов(Соединение, "Dir1/Dir3/Git-2.50.0-64-bit.exe", Истина);

    Обработать(Результат, "FTP", "ПолучитьСписокОбъектов", "Файл, " + Постфикс);

КонецПроцедуры

Процедура FTP_ЗагрузитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    КартинкаПуть = "C:\pic.png";

    Картинка = ПараметрыФункции["Picture"];       // SKIP
    ИВФ      = ПолучитьИмяВременногоФайла("png"); // SKIP
    КопироватьФайл(Картинка, ИВФ);                // SKIP
    Картинка = ИВФ;                               // SKIP

    КартинкаДД = Новый ДвоичныеДанные(Картинка);

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль, , 1000, 1000);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        Результат  = OPI_FTP.ЗагрузитьФайл(Соединение, Картинка, "new_dir/pic_from_disk.png");
        Результат2 = OPI_FTP.ЗагрузитьФайл(Соединение, КартинкаДД, "pic_from_binary.png");

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "FTP", "ЗагрузитьФайл", Постфикс               , КартинкаДД.Размер());
    Обработать(Результат2, "FTP", "ЗагрузитьФайл", "Двоичные, " + Постфикс, КартинкаДД.Размер());

    Результат  = OPI_FTP.ПолучитьРазмерОбъекта(Соединение, "new_dir/pic_from_disk.png");
    Результат2 = OPI_FTP.ПолучитьРазмерОбъекта(Соединение, "pic_from_binary.png");

    Обработать(Результат , "FTP", "ЗагрузитьФайл", "Размер 1, " + Постфикс, КартинкаДД.Размер());
    Обработать(Результат2, "FTP", "ЗагрузитьФайл", "Размер 2, " + Постфикс, КартинкаДД.Размер());

    Для Н = 1 По 5 Цикл

        Результат  = OPI_FTP.ЗагрузитьФайл(Соединение, Картинка, "new_dir/pic_from_disk.png");
        Результат2 = OPI_FTP.ЗагрузитьФайл(Соединение, КартинкаДД, "pic_from_binary.png");

        Если Не Результат["result"] Тогда
            Обработать(Результат, "FTP", "ЗагрузитьФайл", "Множественный, " + Постфикс, КартинкаДД.Размер());
        КонецЕсли;

        Если Не Результат2["result"] Тогда
            Обработать(Результат2, "FTP", "ЗагрузитьФайл", "Множественный, двоичные, " + Постфикс, КартинкаДД.Размер());
        КонецЕсли;

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура FTP_УдалитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.УдалитьФайл(Соединение, "pic_from_binary.png");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "FTP", "УдалитьФайл", Постфикс);

    Результат = OPI_FTP.УдалитьФайл(Соединение, "pic_from_binary.png");

    Обработать(Результат , "FTP", "УдалитьФайл", "Несуществующий, " + Постфикс);

    Результат = OPI_FTP.ПолучитьСписокОбъектов(Соединение, "", Истина);

    Обработать(Результат , "FTP", "УдалитьФайл", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура FTP_УдалитьДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.УдалитьДиректорию(Соединение, "new_dir/another_one");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "FTP", "УдалитьДиректорию", Постфикс);

КонецПроцедуры

Процедура FTP_ОчиститьДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.ОчиститьДиректорию(Соединение, ".");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "FTP", "ОчиститьДиректорию", Постфикс);

    Результат = OPI_FTP.ПолучитьСписокОбъектов(Соединение, ".", Истина);

    Обработать(Результат , "FTP", "ОчиститьДиректорию", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьРазмерОбъекта(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.ПолучитьРазмерОбъекта(Соединение, "new_dir/pic_from_disk.png");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "FTP", "ПолучитьРазмерОбъекта", Постфикс);

    Результат = OPI_FTP.ПолучитьРазмерОбъекта(Соединение, "new_dir/another.bin");

    Обработать(Результат , "FTP", "ПолучитьРазмерОбъекта", "Несуществующий, " + Постфикс);

КонецПроцедуры

Процедура FTP_ИзменитьПуть(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.ИзменитьПуть(Соединение, "new_dir/pic_from_disk.png", "new_dir/pic_copy.png");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "FTP", "ИзменитьПуть", Постфикс);

    Результат = OPI_FTP.ПолучитьРазмерОбъекта(Соединение, "new_dir/pic_copy.png");

    Обработать(Результат , "FTP", "ИзменитьПуть", "Проверка, новый, " + Постфикс);

    Результат = OPI_FTP.ПолучитьРазмерОбъекта(Соединение, "new_dir/pic_from_binary.png");

    Обработать(Результат , "FTP", "ИзменитьПуть", "Проверка, старый, " + Постфикс);

    Результат = OPI_FTP.ИзменитьПуть(Соединение, "new_dir", "brand_new_dir");

    Обработать(Результат , "FTP", "ИзменитьПуть", "Каталог, " + Постфикс);

    Результат = OPI_FTP.ПолучитьСписокОбъектов(Соединение, ".", Истина);

    Обработать(Результат , "FTP", "ИзменитьПуть", "Список, " + Постфикс);

    Результат = OPI_FTP.ИзменитьПуть(Соединение, "brand_new_dir", "new_dir");

    Обработать(Результат , "FTP", "ИзменитьПуть", "Каталог, обратно, " + Постфикс);

    Результат = OPI_FTP.ИзменитьПуть(Соединение, "new_dir/pic_copy.png", "new_dir/pic_from_disk.png");

    Обработать(Результат , "FTP", "ИзменитьПуть", "Обратно, " + Постфикс);

    Результат = OPI_FTP.ПолучитьСписокОбъектов(Соединение, ".", Истина);

    Обработать(Результат , "FTP", "ИзменитьПуть", "Список, обратно, " + Постфикс);

КонецПроцедуры

Процедура FTP_СохранитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        Путь     = "new_dir/pic_from_disk.png";
        ИмяФайла = ПолучитьИмяВременногоФайла("bin");

        Результат = OPI_FTP.СохранитьФайл(Соединение, Путь, ИмяФайла);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "СохранитьФайл", Постфикс);

    Размер = OPI_FTP.ПолучитьРазмерОбъекта(Соединение, Путь);

    Обработать(Размер, "FTP", "СохранитьФайл", "Размер, " + Постфикс);

    ФайлОбъект = Новый Файл(ИмяФайла);

    РазмерФайла      = ФайлОбъект.Размер();
    РазмерРезультата = Результат["bytes"];
    РазмерПроверки   = Размер["bytes"];

    Обработать(РазмерФайла, "FTP", "СохранитьФайл", "Размер файла, " + Постфикс, РазмерРезультата, РазмерПроверки);

    Путь = "new_dir/pic_from_disk.png";

    Для Н = 1 По 5 Цикл

        Результат = OPI_FTP.СохранитьФайл(Соединение, Путь, ИмяФайла);

        Если Не Результат["result"] Тогда
            Обработать(Результат, "FTP", "СохранитьФайл", "Множественный, " + Постфикс);
        КонецЕсли;

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(ИмяФайла, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура FTP_ПолучитьДанныеФайла(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        Путь      = "new_dir/pic_from_disk.png";
        Результат = OPI_FTP.ПолучитьДанныеФайла(Соединение, Путь);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "ПолучитьДанныеФайла", Постфикс);

    Размер = OPI_FTP.ПолучитьРазмерОбъекта(Соединение, Путь);

    Обработать(Размер, "FTP", "ПолучитьДанныеФайла", "Размер, " + Постфикс);

    РазмерФайла    = Результат.Размер();
    РазмерПроверки = Размер["bytes"];

    Обработать(РазмерФайла, "FTP", "ПолучитьДанныеФайла", "Размер файла, " + Постфикс, РазмерПроверки);

    Путь = "new_dir/pic_from_disk.png";

    Для Н = 1 По 5 Цикл

        Результат = OPI_FTP.ПолучитьДанныеФайла(Соединение, Путь);

        Если Не ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
            Обработать(Результат, "FTP", "ПолучитьДанныеФайла", "Множественный, " + Постфикс);
        КонецЕсли;

    КонецЦикла;

КонецПроцедуры

Процедура FTP_Пинг(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.Пинг(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "Пинг", Постфикс);

КонецПроцедуры

Процедура FTP_ВыполнитьНестандартнуюКоманду(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        ТекстКоманды = "UMASK";
        Результат    = OPI_FTP.ВыполнитьНестандартнуюКоманду(Соединение, ТекстКоманды);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "ВыполнитьНестандартнуюКоманду", Постфикс);

КонецПроцедуры

Процедура FTP_ВыполнитьПроизвольнуюКоманду(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        ТекстКоманды = "PWD";
        Результат    = OPI_FTP.ВыполнитьПроизвольнуюКоманду(Соединение, ТекстКоманды);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "ВыполнитьПроизвольнуюКоманду", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьТекущийКаталог(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.ПолучитьТекущийКаталог(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "ПолучитьТекущийКаталог", Постфикс, ПараметрыФункции);

КонецПроцедуры

Процедура FTP_ИзменитьТекущийКаталог(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Путь      = "new_dir";
        Результат = OPI_FTP.ИзменитьТекущийКаталог(Соединение, Путь);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "ИзменитьТекущийКаталог", Постфикс);

    Результат = OPI_FTP.ПолучитьТекущийКаталог(Соединение);

    Обработать(Результат, "FTP", "ИзменитьТекущийКаталог", "Проверка, " + Постфикс, Путь);

    Путь      = ПараметрыФункции["FTP_RootPath"];
    Результат = OPI_FTP.ИзменитьТекущийКаталог(Соединение, Путь);

    Обработать(Результат, "FTP", "ИзменитьТекущийКаталог", "Обратно, " + Постфикс);

    Результат = OPI_FTP.ПолучитьТекущийКаталог(Соединение);

    Обработать(Результат, "FTP", "ИзменитьТекущийКаталог", "Проверка, обратно, " + Постфикс, Путь);

КонецПроцедуры

Процедура FTP_ПолучитьСписокРасширенийПротокола(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    НастройкиFTP = OPI_FTP.ПолучитьНастройкиСоединения(Хост, Порт, Логин, Пароль);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_FTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Если FTPS Тогда
        НастройкиTLS = OPI_FTP.ПолучитьНастройкиTLS(Истина);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_FTP.ПолучитьСписокРасширенийПротокола(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "FTP", "ПолучитьСписокРасширенийПротокола", Постфикс);

КонецПроцедуры

#КонецОбласти

#Область ReportPortal

Процедура ReportPortal_ПолучитьВременныйТокен(ПараметрыФункции)

    URL    = ПараметрыФункции["RPortal_URL"];
    Логин  = ПараметрыФункции["RPortal_Login"];
    Пароль = ПараметрыФункции["RPortal_Password"];

    Результат = OPI_ReportPortal.ПолучитьВременныйТокен(URL, Логин, Пароль);

    // END

    Обработать(Результат, "ReportPortal", "ПолучитьВременныйТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_ПолучитьПостоянныйТокен(ПараметрыФункции)

    URL            = ПараметрыФункции["RPortal_URL"];
    Токен          = ПараметрыФункции["RPortal_TempToken"];
    IDПользователя = ПараметрыФункции["RPortal_UserID"];
    ИмяКлюча       = "test_key";

    Результат = OPI_ReportPortal.ПолучитьПостоянныйТокен(URL, Токен, IDПользователя, ИмяКлюча);

    // END

    Обработать(Результат, "ReportPortal", "ПолучитьПостоянныйТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_УдалитьПостоянныйТокен(ПараметрыФункции)

    URL            = ПараметрыФункции["RPortal_URL"];
    Токен          = ПараметрыФункции["RPortal_TestApiKey"];
    IDПользователя = ПараметрыФункции["RPortal_UserID"];
    IDКлюча        = ПараметрыФункции["RPortal_TestKeyID"];

    Результат = OPI_ReportPortal.УдалитьПостоянныйТокен(URL, Токен, IDПользователя, IDКлюча);

    // END

    Обработать(Результат, "ReportPortal", "УдалитьПостоянныйТокен");

КонецПроцедуры

#КонецОбласти

#Область SSH

Процедура SSH_ОткрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Результат = OPI_SSH.ОткрытьСоединение(НастройкиSSH, НастройкиПрокси);

    // END

    Обработать(Результат, "SSH", "ОткрытьСоединение", Постфикс);

КонецПроцедуры

Процедура SSH_ВыполнитьКоманду(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SSH.ОткрытьСоединение(НастройкиSSH, НастройкиПрокси);

    Если OPI_SSH.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SSH.ВыполнитьКоманду(Соединение, "whoami");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SSH", "ВыполнитьКоманду", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьКонфигурациюСоединения(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Результат = OPI_SSH.ПолучитьКонфигурациюСоединения(НастройкиSSH, НастройкиПрокси);

    // END

    Обработать(Результат, "SSH", "ПолучитьКонфигурациюСоединения", Постфикс);

    Результат = OPI_SSH.ВыполнитьКоманду(Результат, "whoami");

    Обработать(Результат, "SSH", "ПолучитьКонфигурациюСоединения", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура SSH_ЗакрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SSH.ОткрытьСоединение(НастройкиSSH, НастройкиПрокси);

    Если OPI_SSH.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SSH.ЗакрытьСоединение(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SSH", "ЗакрытьСоединение", Постфикс);

КонецПроцедуры

Процедура SSH_ЭтоКоннектор(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSSH = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин        = ПараметрыФункции["SSH_User"];
        НастройкиSSH = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SSH.ОткрытьСоединение(НастройкиSSH, НастройкиПрокси);
    Результат  = OPI_SSH.ЭтоКоннектор(Соединение);

    // END

    Обработать(Результат, "SSH", "ЭтоКоннектор", Постфикс);

    Результат = OPI_SSH.ЭтоКоннектор("a");

    Обработать(Результат, "SSH", "ЭтоКоннектор", "Ошибка, " + Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиЛогинПароль(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["SSH_Host"];
    Порт   = ПараметрыФункции["SSH_Port"];
    Логин  = ПараметрыФункции["SSH_User"];
    Пароль = ПараметрыФункции["SSH_Password"];

    Результат = OPI_SSH.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    // END

    Обработать(Результат, "SSH", "ПолучитьНастройкиЛогинПароль", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиПриватныйКлюч(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост          = ПараметрыФункции["SSH_Host"];
    Порт          = ПараметрыФункции["SSH_Port"];
    Логин         = ПараметрыФункции["SSH_User"];
    ПриватныйКлюч = "./ssh_key";
    ПубличныйКлюч = "./ssh_key.pub";

    ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
    ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

    Результат = OPI_SSH.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    // END

    Обработать(Результат, "SSH", "ПолучитьНастройкиПриватныйКлюч", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиЧерезАгента(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост      = ПараметрыФункции["SSH_Host"];
    Порт      = ПараметрыФункции["SSH_Port"];
    Логин     = ПараметрыФункции["SSH_User"];
    Результат = OPI_SSH.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    // END

    Обработать(Результат, "SSH", "ПолучитьНастройкиЧерезАгента", Постфикс);

КонецПроцедуры

Процедура SSH_ПолучитьНастройкиПрокси(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

    АдресПрокси  = ПараметрыФункции["Proxy_IP"];
    ПортПрокси   = ПараметрыФункции["Proxy_Port"];
    ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
    ПарольПрокси = ПараметрыФункции["Proxy_Password"];

    Результат = OPI_SSH.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    // END

    Обработать(Результат, "SSH", "ПолучитьНастройкиПрокси", Постфикс);

КонецПроцедуры

#КонецОбласти

#Область SFTP

Процедура SFTP_ОткрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Результат = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    // END

    Обработать(Результат, "SFTP", "ОткрытьСоединение", Постфикс);

КонецПроцедуры

Процедура SFTP_СоздатьНовуюДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.СоздатьНовуюДиректорию(Соединение, "new_dir");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SFTP", "СоздатьНовуюДиректорию", Постфикс);

КонецПроцедуры

Процедура SFTP_УдалитьДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.УдалитьДиректорию(Соединение, "new_dir");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SFTP", "УдалитьДиректорию", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьТекущийКаталог(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.ПолучитьТекущийКаталог(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SFTP", "ПолучитьТекущийКаталог", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьСписокОбъектов(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.ПолучитьСписокОбъектов(Соединение, "test_folder", Истина);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SFTP", "ПолучитьСписокОбъектов", Постфикс);

    Результат = OPI_SFTP.ПолучитьСписокОбъектов(Соединение, "test_folder");

    Обработать(Результат, "SFTP", "ПолучитьСписокОбъектов", Постфикс + ", Без рекурсии");

КонецПроцедуры

Процедура SFTP_ЗагрузитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    КартинкаПуть = "C:\pic.png";

    Картинка = ПараметрыФункции["Picture"];       // SKIP
    ИВФ      = ПолучитьИмяВременногоФайла("png"); // SKIP
    КопироватьФайл(Картинка, ИВФ);                // SKIP
    Картинка = ИВФ;                               // SKIP

    КартинкаДД = Новый ДвоичныеДанные(Картинка);

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда

        Результат  = OPI_SFTP.ЗагрузитьФайл(Соединение, Картинка, "pic_from_disk.png");
        Результат2 = OPI_SFTP.ЗагрузитьФайл(Соединение, КартинкаДД, "files_folder/pic_from_binary.png");

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    ЗагруженныйФайл = Новый Файл(Картинка);

    Обработать(Результат , "SFTP", "ЗагрузитьФайл", Постфикс               , ЗагруженныйФайл.Размер());
    Обработать(Результат2, "SFTP", "ЗагрузитьФайл", "Двоичные, " + Постфикс, КартинкаДД.Размер());

    РазмерФайлаЛокальный   = ЗагруженныйФайл.Размер();
    РазмерФайлаЛокальныйДД = КартинкаДД.Размер();

    РазмерФайлаУдаленный   = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "pic_from_disk.png")["data"]["size"];
    РазмерФайлаУдаленныйДД = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "files_folder/pic_from_binary.png")["data"]["size"];

    Обработать(РазмерФайлаЛокальный  , "SFTP", "СохранитьФайл", "Размер файла, " + Постфикс    , РазмерФайлаУдаленный);
    Обработать(РазмерФайлаЛокальныйДД, "SFTP", "СохранитьФайл", "Размер файла, ДД, " + Постфикс, РазмерФайлаУдаленныйДД);

    Для Н = 1 По 7 Цикл

        Результат  = OPI_SFTP.ЗагрузитьФайл(Соединение, Картинка, "pic_from_disk.png");
        Результат2 = OPI_SFTP.ЗагрузитьФайл(Соединение, КартинкаДД, "files_folder/pic_from_binary.png");

        Если Не Результат["result"] Тогда
            Обработать(Результат, "SFTP", "ЗагрузитьФайл", "Множественный, " + Постфикс, КартинкаДД.Размер());
        КонецЕсли;

        Если Не Результат2["result"] Тогда
            Обработать(Результат2, "SFTP", "ЗагрузитьФайл", "Множественный, двоичные, " + Постфикс, КартинкаДД.Размер());
        КонецЕсли;

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура SFTP_УдалитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.УдалитьФайл(Соединение, "files_folder/pic_from_binary.png");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "SFTP", "УдалитьФайл", Постфикс);

    Результат = OPI_SFTP.УдалитьФайл(Соединение, "files_folder/pic_from_binary.png");

    Обработать(Результат , "SFTP", "УдалитьФайл", "Несуществующий, " + Постфикс);

    Результат = OPI_SFTP.ПолучитьСписокОбъектов(Соединение, "files_folder", Истина);

    Обработать(Результат , "SFTP", "УдалитьФайл", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура SFTP_ЭтоКоннектор(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);
    Результат  = OPI_SFTP.ЭтоКоннектор(Соединение);

    // END

    Обработать(Результат, "SFTP", "ЭтоКоннектор", Постфикс);

    Результат = OPI_SFTP.ЭтоКоннектор("a");

    Обработать(Результат, "SFTP", "ЭтоКоннектор", "Ошибка, " + Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиЛогинПароль(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["SSH_Host"];
    Порт   = ПараметрыФункции["SSH_Port"];
    Логин  = ПараметрыФункции["SSH_User"];
    Пароль = ПараметрыФункции["SSH_Password"];

    Результат = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    // END

    Обработать(Результат, "SFTP", "ПолучитьНастройкиЛогинПароль", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиПриватныйКлюч(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост          = ПараметрыФункции["SSH_Host"];
    Порт          = ПараметрыФункции["SSH_Port"];
    Логин         = ПараметрыФункции["SSH_User"];
    ПриватныйКлюч = "./ssh_key";
    ПубличныйКлюч = "./ssh_key.pub";

    ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
    ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

    Результат = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    // END

    Обработать(Результат, "SFTP", "ПолучитьНастройкиПриватныйКлюч", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиЧерезАгента(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост      = ПараметрыФункции["SSH_Host"];
    Порт      = ПараметрыФункции["SSH_Port"];
    Логин     = ПараметрыФункции["SSH_User"];
    Результат = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    // END

    Обработать(Результат, "SFTP", "ПолучитьНастройкиЧерезАгента", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиПрокси(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

    АдресПрокси  = ПараметрыФункции["Proxy_IP"];
    ПортПрокси   = ПараметрыФункции["Proxy_Port"];
    ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
    ПарольПрокси = ПараметрыФункции["Proxy_Password"];

    Результат = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    // END

    Обработать(Результат, "SFTP", "ПолучитьНастройкиПрокси", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьКонфигурациюСоединения(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Результат = OPI_SFTP.ПолучитьКонфигурациюСоединения(НастройкиSFTP, НастройкиПрокси);

    // END

    Обработать(Результат, "SFTP", "ПолучитьКонфигурациюСоединения", Постфикс);

    Результат = OPI_SSH.ВыполнитьКоманду(Результат, "whoami");

    Обработать(Результат, "SFTP", "ПолучитьКонфигурациюСоединения", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура SFTP_ЗакрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.ЗакрытьСоединение(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SFTP", "ЗакрытьСоединение", Постфикс);

КонецПроцедуры

Процедура SFTP_СохранитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда

        Путь     = "pic_from_disk.png";
        ИмяФайла = ПолучитьИмяВременногоФайла("bin");

        Результат = OPI_SFTP.СохранитьФайл(Соединение, Путь, ИмяФайла);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SFTP", "СохранитьФайл", Постфикс);

    ЗагруженныйФайл      = Новый Файл(ИмяФайла);
    РазмерФайлаЛокальный = ЗагруженныйФайл.Размер();
    РазмерФайлаУдаленный = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, Путь)["data"]["size"];

    Обработать(РазмерФайлаЛокальный, "SFTP", "СохранитьФайл", "Размер файла, " + Постфикс, РазмерФайлаУдаленный);

    Путь = "files_folder/pic_from_binary.png";

    Для Н = 1 По 20 Цикл

        Результат = OPI_SFTP.СохранитьФайл(Соединение, Путь, ИмяФайла);

        Если Не Результат["result"] Тогда
            Обработать(Результат, "SFTP", "СохранитьФайл", "Множественный, " + Постфикс);
        КонецЕсли;

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(ИмяФайла, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура SFTP_ПолучитьДанныеФайла(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда

        Путь      = "pic_from_disk.png";
        Результат = OPI_SFTP.ПолучитьДанныеФайла(Соединение, Путь);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат, "SFTP", "ПолучитьДанныеФайла", Постфикс);

    РазмерФайлаЛокальный = Результат.Размер();
    РазмерФайлаУдаленный = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, Путь)["data"]["size"];

    Обработать(РазмерФайлаЛокальный, "SFTP", "ПолучитьДанныеФайла", "Размер файла, " + Постфикс, РазмерФайлаУдаленный);

    Путь = "files_folder/pic_from_binary.png";

    Для Н = 1 По 20 Цикл

        Результат = OPI_SFTP.ПолучитьДанныеФайла(Соединение, Путь);

        Если Не ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
            Обработать(Результат, "SFTP", "ПолучитьДанныеФайла", "Множественный, " + Постфикс);
        КонецЕсли;

    КонецЦикла;

КонецПроцедуры

Процедура SFTP_ИзменитьПуть(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.ИзменитьПуть(Соединение, "pic_from_disk.png", "files_folder/pic_from_disk.png");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "SFTP", "ИзменитьПуть", Постфикс);

    Результат = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "pic_from_disk.png");

    Обработать(Результат , "SFTP", "ИзменитьПуть", "Проверка, Старый, " + Постфикс);

    Результат = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "files_folder/pic_from_disk.png");

    Обработать(Результат , "SFTP", "ИзменитьПуть", "Проверка, Новый, " + Постфикс);

    Результат = OPI_SFTP.ИзменитьПуть(Соединение, "files_folder/pic_from_disk.png", "pic_from_disk.png");

    Обработать(Результат , "SFTP", "ИзменитьПуть", "Обратно, " + Постфикс);

    Результат = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "files_folder/pic_from_disk.png");

    Обработать(Результат , "SFTP", "ИзменитьПуть", "Проверка, Старый, Обратно, " + Постфикс);

    Результат = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "pic_from_disk.png");

    Обработать(Результат , "SFTP", "ИзменитьПуть", "Проверка, Новый, Обратно, " + Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьИнформациюОФайле(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЛогинПароль(Хост, Порт, Логин, Пароль);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        НастройкиПрокси = OPI_SFTP.ПолучитьНастройкиПрокси(АдресПрокси, ПортПрокси, ТипПрокси, ЛогинПрокси, ПарольПрокси);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "files_folder/pic_from_binary.png");
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    Обработать(Результат , "SFTP", "ПолучитьИнформациюОФайле", Постфикс);

КонецПроцедуры

#КонецОбласти

#Область GreenMax

Процедура GreenMax_СформироватьПараметрыДоступа(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Результат = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);

    // END

    Обработать(Результат, "GreenMax", "СформироватьПараметрыДоступа");

КонецПроцедуры

Процедура GreenMax_ПолучитьКодАвторизации(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    НомерТелефона = 441234567890;

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьКодАвторизации(ПараметрыДоступа, НомерТелефона);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьКодАвторизации");

КонецПроцедуры

Процедура GreenMax_РазлогинитьИнстанс(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.РазлогинитьИнстанс(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "РазлогинитьИнстанс");

КонецПроцедуры

Процедура GreenMax_ОтправитьКодАвторизации(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    КодАвторизации = 123456;

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ОтправитьКодАвторизации(ПараметрыДоступа, КодАвторизации);

    // END

    Обработать(Результат, "GreenMax", "ОтправитьКодАвторизации");

КонецПроцедуры

Процедура GreenMax_ПолучитьСостояниеИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьСостояниеИнстанса(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьСостояниеИнстанса");

КонецПроцедуры

Процедура GreenMax_ПерезапуститьИнстанс(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПерезапуститьИнстанс(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПерезапуститьИнстанс");

КонецПроцедуры

Процедура GreenMax_ПолучитьСтруктуруНастроекИнстанса(ПараметрыФункции)

    Результат = OPI_GreenMax.ПолучитьСтруктуруНастроекИнстанса();

    // END

    Обработать(Результат, "GreenMax", "ПолучитьСтруктуруНастроекИнстанса");

    Результат = OPI_GreenMax.ПолучитьСтруктуруНастроекИнстанса(Истина);

    Обработать(Результат, "GreenMAx", "ПолучитьСтруктуруНастроекИнстанса", "Пустая");

КонецПроцедуры

Процедура GreenMax_ПолучитьНастройкиИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьНастройкиИнстанса(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьНастройкиИнстанса", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_УстановитьНастройкиИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);

    СтруктураНастроек = Новый Структура;
    СтруктураНастроек.Вставить("markIncomingMessagesReaded" , "no");
    СтруктураНастроек.Вставить("outgoingWebhook"            , "no");
    СтруктураНастроек.Вставить("outgoingAPIMessageWebhook"  , "yes");

    Результат = OPI_GreenMax.УстановитьНастройкиИнстанса(СтруктураНастроек, ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "УстановитьНастройкиИнстанса");

КонецПроцедуры

Процедура GreenMax_УстановитьКартинкуПрофиля(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.УстановитьКартинкуПрофиля(ПараметрыДоступа, Картинка);

    // END

    Обработать(Результат, "GreenMax", "УстановитьКартинкуПрофиля");

КонецПроцедуры

Процедура GreenMax_ПолучитьИнформациюОбАккаунте(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьИнформациюОбАккаунте(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьИнформациюОбАккаунте");

КонецПроцедуры

Процедура GreenMax_ПроверитьАккаунт(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    НомерТелефона = 441234567890;
    НомерТелефона = ПараметрыФункции["GreenMax_Phone"]; // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПроверитьАккаунт(ПараметрыДоступа, НомерТелефона);

    // END

    Обработать(Результат, "GreenMax", "ПроверитьАккаунт", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_ПолучитьСписокКонтактов(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Количество = 1;

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьСписокКонтактов(ПараметрыДоступа, Количество);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьСписокКонтактов", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_ПолучитьИнформациюОКонтакте(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDКонтакта = 87654321;
    IDКонтакта = ПараметрыФункции["GreenMax_ContactID"]; // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьИнформациюОКонтакте(ПараметрыДоступа, IDКонтакта);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьИнформациюОКонтакте");

КонецПроцедуры

Процедура GreenMax_ПолучитьСписокЧатов(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьСписокЧатов(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьСписокЧатов");

КонецПроцедуры

Процедура GreenMax_ПолучитьАватарЧата(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата = 87654321;
    IDЧата = ПараметрыФункции["GreenMax_ContactID"]; // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьАватарЧата(ПараметрыДоступа, IDЧата);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьАватарЧата");

КонецПроцедуры

Процедура GreenMax_СоздатьГруппу(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDПользователя = 87654321;
    Наименование   = "Новая группа";

    IDПользователя = ПараметрыФункции["GreenMax_ContactID"]; // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.СоздатьГруппу(ПараметрыДоступа, Наименование, IDПользователя);

    // END

    Обработать(Результат, "GreenMax", "СоздатьГруппу", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_ДобавитьУчастникаГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата      = 12345678;
    IDУчастника = 87654321;

    IDЧата      = ПараметрыФункции["GreenMax_GroupID"];   // SKIP
    IDУчастника = ПараметрыФункции["GreenMax_ContactID"]; // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ДобавитьУчастникаГруппы(ПараметрыДоступа, IDЧата, IDУчастника);

    // END

    Обработать(Результат, "GreenMax", "ДобавитьУчастникаГруппы");

    GreenMax_УдалитьУчастникаГруппы(ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_УдалитьУчастникаГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата      = 12345678;
    IDУчастника = 87654321;

    IDЧата      = ПараметрыФункции["GreenMax_GroupID"];   // SKIP
    IDУчастника = ПараметрыФункции["GreenMax_ContactID"]; // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.УдалитьУчастникаГруппы(ПараметрыДоступа, IDЧата, IDУчастника);

    // END

    Обработать(Результат, "GreenMax", "УдалитьУчастникаГруппы");

КонецПроцедуры

Процедура GreenMax_ВыйтиИзГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата = 12345678;
    IDЧата = ПараметрыФункции["GreenMax_GroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ВыйтиИзГруппы(ПараметрыДоступа, IDЧата);

    // END

    Обработать(Результат, "GreenMax", "ВыйтиИзГруппы");

КонецПроцедуры

Процедура GreenMax_ИзменитьИмяГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Наименование = "Новое имя группы";
    IDЧата       = 12345678;
    IDЧата       = ПараметрыФункции["GreenMax_GroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ИзменитьИмяГруппы(ПараметрыДоступа, IDЧата, Наименование);

    // END

    Обработать(Результат, "GreenMax", "ИзменитьИмяГруппы");

КонецПроцедуры

Процедура GreenMax_ПолучитьИнформациюОГруппе(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата = 12345678;
    IDЧата = ПараметрыФункции["GreenMax_GroupID"]; // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьИнформациюОГруппе(ПараметрыДоступа, IDЧата);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьИнформациюОГруппе");

КонецПроцедуры

Процедура GreenMax_ИзменитьНастройкиГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата = 12345678;
    IDЧата = ПараметрыФункции["GreenMax_GroupID"]; // SKIP

    Настройки = Новый Структура;
    Настройки.Вставить("allowParticipantsEditGroupSettings"  , Истина);
    Настройки.Вставить("allowParticipantsPinMessages"        , Ложь);
    Настройки.Вставить("allowParticipantsAddMembers"         , Ложь);

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ИзменитьНастройкиГруппы(ПараметрыДоступа, IDЧата, Настройки);

    // END

    Обработать(Результат, "GreenMax", "ИзменитьНастройкиГруппы");

КонецПроцедуры

Процедура GreenMax_ПолучитьСтруктуруНастроекГруппы(ПараметрыФункции)

    Результат = OPI_GreenMax.ПолучитьСтруктуруНастроекГруппы();

    // END

    Обработать(Результат, "GreenMax", "ПолучитьСтруктуруНастроекГруппы");

    Результат = OPI_GreenMax.ПолучитьСтруктуруНастроекГруппы(Истина);

    Обработать(Результат, "GreenMax", "ПолучитьСтруктуруНастроекГруппы", "Пустая");

КонецПроцедуры

Процедура GreenMax_НазначитьПраваАдминистратора(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата      = 12345678;
    IDУчастника = 87654321;

    IDЧата      = ПараметрыФункции["GreenMax_MainGroupID"]; // SKIP
    IDУчастника = ПараметрыФункции["GreenMax_ContactID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.НазначитьПраваАдминистратора(ПараметрыДоступа, IDЧата, IDУчастника);

    // END

    Обработать(Результат, "GreenMax", "НазначитьПраваАдминистратора");

КонецПроцедуры

Процедура GreenMax_ОтозватьПраваАдминистратора(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата      = 12345678;
    IDУчастника = 87654321;

    IDЧата      = ПараметрыФункции["GreenMax_MainGroupID"]; // SKIP
    IDУчастника = ПараметрыФункции["GreenMax_ContactID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ОтозватьПраваАдминистратора(ПараметрыДоступа, IDЧата, IDУчастника);

    // END

    Обработать(Результат, "GreenMax", "ОтозватьПраваАдминистратора");

КонецПроцедуры

Процедура GreenMax_УстановитьКартинкуГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Картинка = ПараметрыФункции["Picture3"]; // URL, Путь или Двоичные данные
    IDЧата   = 12345678;

    IDЧата = ПараметрыФункции["GreenMax_GroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.УстановитьКартинкуГруппы(ПараметрыДоступа, IDЧата, Картинка);

    // END

    Обработать(Результат, "GreenMax", "УстановитьКартинкуГруппы");

КонецПроцедуры

Процедура GreenMax_ОтправитьТекстовоеСообщение(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Текст  = "Текст сообщения";
    IDЧата = 12345678;
    Набор  = 2000;

    IDЧата = ПараметрыФункции["GreenMax_GroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ОтправитьТекстовоеСообщение(ПараметрыДоступа, IDЧата, Текст, Набор);

    // END

    Обработать(Результат, "GreenMax", "ОтправитьТекстовоеСообщение", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_ОтправитьФайл(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Файл     = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    ИмяФайла = "photo.jpg";
    IDЧата   = 12345678;
    Описание = "Описание файла";

    IDЧата = ПараметрыФункции["GreenMax_GroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ОтправитьФайл(ПараметрыДоступа, IDЧата, Файл, ИмяФайла, Описание);

    // END

    Обработать(Результат, "GreenMax", "ОтправитьФайл", , ПараметрыФункции);

    Файл     = ПараметрыФункции["Video"];
    ИмяФайла = "vid.mp4";

    IDСообщения = Результат["idMessage"];
    Результат   = OPI_GreenMax.ОтправитьФайл(ПараметрыДоступа, IDЧата, Файл, ИмяФайла, Описание, 1000, "video");

    Обработать(Результат, "GreenMax", "ОтправитьФайл", "Видео");

КонецПроцедуры

Процедура GreenMax_ОтправитьФайлПоURL(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Файл     = ПараметрыФункции["Picture"];
    ИмяФайла = "photo.jpg";
    IDЧата   = 12345678;
    Описание = "Описание файла";

    IDЧата = ПараметрыФункции["GreenMax_GroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ОтправитьФайлПоURL(ПараметрыДоступа, IDЧата, Файл, ИмяФайла);

    // END

    Обработать(Результат, "GreenMax", "ОтправитьФайлПоURL");

    Файл     = ПараметрыФункции["Video"];
    ИмяФайла = "vid.mp4";

    IDСообщения = Результат["idMessage"];
    Результат   = OPI_GreenMax.ОтправитьФайлПоURL(ПараметрыДоступа, IDЧата, Файл, ИмяФайла, Описание, 1000);

    Обработать(Результат, "GreenMax", "ОтправитьФайлПоURL", "Ввод");

КонецПроцедуры

Процедура GreenMax_ПолучитьУведомление(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьУведомление(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьУведомление", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_УдалитьУведомление(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDУведомления = ПараметрыФункции["GreenMax_ReceiptID"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.УдалитьУведомление(ПараметрыДоступа, IDУведомления);

    // END

    Обработать(Результат, "GreenMax", "УдалитьУведомление", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_ОтметитьСообщенияКакПрочитанные(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата = 12345678;

    IDЧата = ПараметрыФункции["GreenMax_MainGroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ОтметитьСообщенияКакПрочитанные(ПараметрыДоступа, IDЧата);

    // END

    Обработать(Результат, "GreenMax", "ОтметитьСообщенияКакПрочитанные");

КонецПроцедуры

Процедура GreenMax_ПолучитьИсториюСообщенийЧата(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата     = 12345678;
    Количество = 3;

    IDЧата = ПараметрыФункции["GreenMax_MainGroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьИсториюСообщенийЧата(ПараметрыДоступа, IDЧата, Количество);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьИсториюСообщенийЧата", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenMax_ПолучитьСообщениеЧата(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    IDЧата      = 12345678;
    IDСообщения = ПараметрыФункции["GreenMax_MainMessageID"];

    IDЧата = ПараметрыФункции["GreenMax_MainGroupID"];   // SKIP

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьСообщениеЧата(ПараметрыДоступа, IDЧата, IDСообщения);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьСообщениеЧата", , IDСообщения);

КонецПроцедуры

Процедура GreenMax_ПолучитьЖурналВходящихСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Период = 30;

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьЖурналВходящихСообщений(ПараметрыДоступа, Период);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьЖурналВходящихСообщений");

КонецПроцедуры

Процедура GreenMax_ПолучитьЖурналИсходящихСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    Период = 30;

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьЖурналИсходящихСообщений(ПараметрыДоступа, Период);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьЖурналИсходящихСообщений");

КонецПроцедуры

Процедура GreenMax_ПолучитьКоличествоСообщенийКОтправке(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьКоличествоСообщенийКОтправке(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьКоличествоСообщенийКОтправке");

КонецПроцедуры

Процедура GreenMax_ПолучитьОчередьСообщенийКОтправке(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьОчередьСообщенийКОтправке(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьОчередьСообщенийКОтправке");

КонецПроцедуры

Процедура GreenMax_ОчиститьОчередьСообщенийКОтправке(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ОчиститьОчередьСообщенийКОтправке(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ОчиститьОчередьСообщенийКОтправке");

КонецПроцедуры

Процедура GreenMax_ПолучитьКоличествоВходящихУведомлений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ПолучитьКоличествоВходящихУведомлений(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ПолучитьКоличествоВходящихУведомлений");

КонецПроцедуры

Процедура GreenMax_ОчиститьОчередьВходящихУведомлений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenMax_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenMax_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenMax_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenMax_Token"];

    ПараметрыДоступа = OPI_GreenMax.СформироватьПараметрыДоступа(ApiUrl, MediaUrl, IdInstance, ApiTokenInstance);
    Результат        = OPI_GreenMax.ОчиститьОчередьВходящихУведомлений(ПараметрыДоступа);

    // END

    Обработать(Результат, "GreenMax", "ОчиститьОчередьВходящихУведомлений");

КонецПроцедуры

#КонецОбласти

#Область MongoDB

Процедура MongoDB_СформироватьСтрокуПодключения(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    Результат            = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, ПараметрыПодключения);

    // END

    Обработать(Результат, "MongoDB", "СформироватьСтрокуПодключения", , ПараметрыФункции);

КонецПроцедуры

Процедура MongoDB_ОткрытьСоединение(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, ПараметрыПодключения);

    Результат = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    // END

    Обработать(Результат, "MongoDB", "ОткрытьСоединение");

    Результат = OPI_MongoDB.ЗакрытьСоединение(Результат);

    Обработать(Результат, "MongoDB", "ОткрытьСоединение", "Закрытие");

КонецПроцедуры

Процедура MongoDB_ЗакрытьСоединение(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, ПараметрыПодключения);

    Соединение = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);
    Результат  = OPI_MongoDB.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "MongoDB", "ЗакрытьСоединение");

КонецПроцедуры

Процедура MongoDB_ЭтоКоннектор(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, ПараметрыПодключения);

    Соединение = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);
    Результат  = OPI_MongoDB.ЭтоКоннектор(Соединение);

    // END

    Обработать(Результат, "MongoDB", "ЭтоКоннектор");

КонецПроцедуры

Процедура MongoDB_ВыполнитьКоманду(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);

    Комманда = "listDatabases";
    Данные   = Новый Структура("nameOnly", Истина);

    Соединение = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Обработать(Соединение, "MongoDB", "ВыполнитьКоманду", "Подключение"); // SKIP

    Результат = OPI_MongoDB.ВыполнитьКоманду(Соединение, Комманда, , , Данные);

    // END

    Обработать(Результат, "MongoDB", "ВыполнитьКоманду");

КонецПроцедуры

Процедура MongoDB_ПолучитьБазуДанных(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, База, Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    База = "test_db";

    Результат = OPI_MongoDB.ПолучитьБазуДанных(Соединение, База);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьБазуДанных");

КонецПроцедуры

Процедура MongoDB_ПолучитьСписокБаз(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Результат = OPI_MongoDB.ПолучитьСписокБаз(Соединение);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьСписокБаз");

КонецПроцедуры

Процедура MongoDB_УдалитьБазуДанных(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Результат = OPI_MongoDB.УдалитьБазуДанных(Соединение, База);

    // END

    Обработать(Результат, "MongoDB", "УдалитьБазуДанных");

КонецПроцедуры

Процедура MongoDB_СоздатьКоллекцию(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Наименование = "test_collection";
    База         = "test_database";

    Параметры = Новый Соответствие;
    Выражение = Новый Соответствие;
    ГруппаИ   = Новый Массив;

    Условие1  = Новый Соответствие; // Итог >= 0
    Элементы1 = Новый Массив;
    Элементы1.Добавить("$total");
    Элементы1.Добавить(0);
    Условие1.Вставить("$gte", Элементы1);

    Условие2  = Новый Соответствие; // Статус <= 3
    Элементы2 = Новый Массив;
    Элементы2.Добавить("$status");
    Элементы2.Добавить(3);
    Условие2.Вставить("$lte", Элементы2);

    ГруппаИ.Добавить(Условие1);
    ГруппаИ.Добавить(Условие2);

    Выражение.Вставить("$expr", ГруппаИ);
    Параметры.Вставить("validator", Выражение);

    Результат = OPI_MongoDB.СоздатьКоллекцию(Соединение, Наименование, База, Параметры);

    // END

    Обработать(Результат, "MongoDB", "СоздатьКоллекцию");

    Результат = OPI_MongoDB.СоздатьКоллекцию(Соединение, Наименование, База, Параметры);

    Обработать(Результат, "MongoDB", "СоздатьКоллекцию", "Существующая");

КонецПроцедуры

Процедура MongoDB_УдалитьКоллекцию(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Коллекция = "test_collection";
    База      = "test_database";

    Результат = OPI_MongoDB.УдалитьКоллекцию(Соединение, Коллекция, База);

    // END

    Обработать(Результат, "MongoDB", "УдалитьКоллекцию");

КонецПроцедуры

Процедура MongoDB_ПолучитьСписокКоллекций(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    База = "test_database";

    Результат = OPI_MongoDB.ПолучитьСписокКоллекций(Соединение, База);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьСписокКоллекций");

КонецПроцедуры

Процедура MongoDB_ВставитьДокументы(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Коллекция        = "new_collection";
    МассивДокументов = Новый Массив;

    // С неявным приведением типов
    СтруктураДокумента = Новый Структура;

    ТестовыйМассив = Новый Массив;
    ТестовыйМассив.Добавить("Значение1");
    ТестовыйМассив.Добавить("Значение2");

    ТестоваяСтруктура = Новый Структура("text,number", "Текст", 10);
    ТестовыеДвоичные  = ПолучитьДвоичныеДанныеИзСтроки("Текст");
    ТекущаяДата       = OPI_Инструменты.ПолучитьТекущуюДату();

    СтруктураДокумента.Вставить("stringField", "Текст");
    СтруктураДокумента.Вставить("intField"   , 200);
    СтруктураДокумента.Вставить("doubleField", 123.456);
    СтруктураДокумента.Вставить("boolField"  , Истина);
    СтруктураДокумента.Вставить("arrayField" , ТестовыйМассив);
    СтруктураДокумента.Вставить("docField"   , ТестоваяСтруктура);
    СтруктураДокумента.Вставить("dateField"  , ТекущаяДата);
    СтруктураДокумента.Вставить("nullField");

    МассивДокументов.Добавить(СтруктураДокумента);

    // С явным приведением типов
    СтруктураДокумента = Новый Структура;

    RegExp = Новый Структура("pattern,options", "[a-z]+@[a-z]+\.[a-z]+", "i");
    КодJS  = "const result = [1, 2, 3].map(x => x * 2).filter(x => x > 3);";

    СтруктураДокумента.Вставить("stringField", Новый Структура("__OPI_STRING__"   , "Текст"));
    СтруктураДокумента.Вставить("oidField"   , Новый Структура("__OPI_OBJECTID__" , "63ceed18f71dda7d8cf21e8e"));
    СтруктураДокумента.Вставить("jsField"    , Новый Структура("__OPI_JS__"       , КодJS));
    СтруктураДокумента.Вставить("symbolField", Новый Структура("__OPI_SYMBOL__"   , "Y"));
    СтруктураДокумента.Вставить("int32Field" , Новый Структура("__OPI_INT32__"    , 10));
    СтруктураДокумента.Вставить("int64Field" , Новый Структура("__OPI_INT64__"    , 1000));
    СтруктураДокумента.Вставить("doubleField", Новый Структура("__OPI_DOUBLE__"   , 124.456));
    СтруктураДокумента.Вставить("boolField"  , Новый Структура("__OPI_BOOLEAN__"  , Истина));
    СтруктураДокумента.Вставить("dateField"  , Новый Структура("__OPI_DATETIME__" , "1763204141"));
    СтруктураДокумента.Вставить("tsField"    , Новый Структура("__OPI_TIMESTAMP__", ТекущаяДата));
    СтруктураДокумента.Вставить("regexpField", Новый Структура("__OPI_REGEXP__"   , RegExp));
    СтруктураДокумента.Вставить("binaryField", Новый Структура("__OPI_BINARY__"   , ТестовыеДвоичные));
    СтруктураДокумента.Вставить("nullField"  , Новый Структура("__OPI_NULL__"));
    СтруктураДокумента.Вставить("minkeyField", Новый Структура("__OPI_MINKEY__"));
    СтруктураДокумента.Вставить("maxkeyField", Новый Структура("__OPI_MAXKEY__"));

    ТестовыйМассив = Новый Массив;
    ТестовыйМассив.Добавить(Новый Структура("__OPI_SYMBOL__", "A"));
    ТестовыйМассив.Добавить(Новый Структура("__OPI_MINKEY__"));

    ТестоваяСтруктура = Новый Структура("code,number"
        , Новый Структура("__OPI_JS__", "const result = 1")
        , Новый Структура("__OPI_DOUBLE__", 10));

    // Документы и массивы в структуру не оборачиваются
    СтруктураДокумента.Вставить("docField"   , ТестоваяСтруктура);
    СтруктураДокумента.Вставить("arrayField" , ТестовыйМассив);

    МассивДокументов.Добавить(СтруктураДокумента);

    OPI_MongoDB.УдалитьКоллекцию(Соединение, Коллекция, База); // SKIP

    Результат = OPI_MongoDB.ВставитьДокументы(Соединение, Коллекция, МассивДокументов, База);

    // END

    Обработать(Результат, "MongoDB", "ВставитьДокументы");

    МассивДокументов = Новый Массив;

    СоответствиеКатегорий = Новый Соответствие;
    СоответствиеКатегорий.Вставить(1, "электроника");
    СоответствиеКатегорий.Вставить(2, "одежда");
    СоответствиеКатегорий.Вставить(3, "книги");
    СоответствиеКатегорий.Вставить(4, "продукты");

    СоответствиеПоставщиков = Новый Соответствие;
    СоответствиеПоставщиков.Вставить(1, "Поставщик А");
    СоответствиеПоставщиков.Вставить(2, "Поставщик Б");
    СоответствиеПоставщиков.Вставить(3, "Поставщик В");

    Для Н = 1 По 15 Цикл

        СтруктураДокумента = Новый Структура;

        СтруктураДокумента.Вставить("productName", "Товар " + Н);
        СтруктураДокумента.Вставить("category"   , СоответствиеКатегорий.Получить(Н % 4));
        СтруктураДокумента.Вставить("price"      , 50 + (Н * 30));
        СтруктураДокумента.Вставить("quantity"   , 5 + (Н % 10));
        СтруктураДокумента.Вставить("rating"     , Макс(1, Н % 6));
        СтруктураДокумента.Вставить("inStock"    , Н % 3 > 0);
        СтруктураДокумента.Вставить("tags"       , OPI_ПолучениеДанныхТестов.ПолучитьМассивТегов(Н));
        СтруктураДокумента.Вставить("createdDate", OPI_Инструменты.ПолучитьТекущуюДату() - (Н * 86400));

        Детали = Новый Структура;
        Детали.Вставить("supplier"  , СоответствиеПоставщиков.Получить(Н % 3));
        Детали.Вставить("weightKg"  , Н * 0.3);
        Детали.Вставить("dimensions", Новый Структура("length,width,height", Н * 8, Н * 4, Н * 2));
        СтруктураДокумента.Вставить("details", Детали);

        МассивДокументов.Добавить(СтруктураДокумента);

    КонецЦикла;

    ДокументСНулем = Новый Структура;
    ДокументСНулем.Вставить("productName", "Товар с нулевой ценой");
    ДокументСНулем.Вставить("category"   , "книги");
    ДокументСНулем.Вставить("price"      , 0);
    ДокументСНулем.Вставить("quantity"   , 1);
    ДокументСНулем.Вставить("rating"     , 4);
    ДокументСНулем.Вставить("inStock"    , Истина);
    ДокументСНулем.Вставить("tags"       , Новый Массив);
    МассивДокументов.Добавить(ДокументСНулем);

    ДокументБезКатегории = Новый Структура;
    ДокументБезКатегории.Вставить("productName", "Товар без категории");
    ДокументБезКатегории.Вставить("price"      , 250);
    ДокументБезКатегории.Вставить("quantity"   , 3);
    ДокументБезКатегории.Вставить("rating"     , 3);
    ДокументБезКатегории.Вставить("inStock"    , Ложь);
    МассивДокументов.Добавить(ДокументБезКатегории);

    Результат = OPI_MongoDB.ВставитьДокументы(Соединение, Коллекция, МассивДокументов, База);

    Обработать(Результат, "MongoDB", "ВставитьДокументы");

КонецПроцедуры

Процедура MongoDB_ПолучитьДокументы(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Коллекция = "new_collection";

    // __4 = $
    Фильтр     = Новый Структура("stringField,doubleField", "Текст", Новый Структура("__4gte, __4lte", 100, 150));
    Сортировка = Новый Структура("doubleField", -1);
    Параметры  = Новый Структура("limit", 2);

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьДокументы");

    // 1: Category and price range
    Фильтр     = Новый Структура("category,price", "электроника", Новый Структура("__4gte,__4lte", 100, 400));
    Сортировка = Новый Структура("price", 1);
    Параметры  = Новый Структура("limit", 5);

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    Обработать(Результат, "MongoDB", "ПолучитьДокументы", 1);

    // 2: Stock and rating
    Фильтр     = Новый Структура("inStock,rating", Истина, Новый Структура("__4gte", 4));
    Сортировка = Новый Структура("rating,price", -1, 1);

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр, Сортировка);

    Обработать(Результат, "MongoDB", "ПолучитьДокументы", 2);

    // 3: By tags array
    Фильтр     = Новый Структура("tags", "распродажа");
    Сортировка = Новый Структура("createdDate", -1);

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр, Сортировка);

    Обработать(Результат, "MongoDB", "ПолучитьДокументы", 3);

    // 4: By nested fields
    Фильтр     = Новый Соответствие;
    Фильтр.Вставить("details.supplier", "Поставщик А");
    Фильтр.Вставить("details.weightKg", Новый Структура("__4lt", 3));

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);

    Обработать(Результат, "MongoDB", "ПолучитьДокументы", 4);

    // 5: Projection
    Фильтр     = Новый Структура("category", "книги");
    Сортировка = Новый Структура("price", -1);
    Параметры  = Новый Структура("projection", Новый Структура("productName,price,rating", 1, 1, 1));

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    Обработать(Результат, "MongoDB", "ПолучитьДокументы", 5);

КонецПроцедуры

Процедура MongoDB_ПолучитьКурсор(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Коллекция = "new_collection";

    Фильтр     = Новый Структура("stringField", "Текст");
    Сортировка = Новый Структура("doubleField", -1);
    Параметры  = Новый Структура("limit,batchSize", 2, 1);

    Результат = OPI_MongoDB.ПолучитьКурсор(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьКурсор");

    // Big batchSize with limit
    Фильтр     = Новый Структура("inStock", Истина);
    Сортировка = Новый Структура("price", 1);
    Параметры  = Новый Структура("limit,batchSize", 8, 3);

    Результат = OPI_MongoDB.ПолучитьКурсор(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    Обработать(Результат, "MongoDB", "ПолучитьКурсор", 1);

    // Small batchSize without limit
    Фильтр     = Новый Структура("category", "одежда");
    Сортировка = Новый Структура("rating", -1);
    Параметры  = Новый Структура("batchSize", 2);

    Результат = OPI_MongoDB.ПолучитьКурсор(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    Обработать(Результат, "MongoDB", "ПолучитьКурсор", 2);

КонецПроцедуры

Процедура MongoDB_ПолучитьПакетДокументов(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Коллекция = "new_collection";

    Фильтр     = Новый Структура("stringField", "Текст");
    Сортировка = Новый Структура("doubleField", -1);
    Параметры  = Новый Структура("limit,batchSize", 2, 1);

    Курсор = OPI_MongoDB.ПолучитьКурсор(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    Если Не Курсор["result"] Тогда
        ВызватьИсключение Курсор["error"];
    КонецЕсли;

    Курсор            = Курсор["data"]["cursor"];
    МассивДокументов  = Курсор["firstBatch"];
    IDКурсора         = Курсор["id"];
    ПродолжатьВыборку = IDКурсора > 0;

    Пока ПродолжатьВыборку Цикл

        Результат = OPI_MongoDB.ПолучитьПакетДокументов(Соединение, Коллекция, IDКурсора, База); // <---

        Если Не Результат["result"] Тогда
            ВызватьИсключение Результат["error"];
        КонецЕсли;

        ПродолжатьВыборку = Результат["data"]["cursor"]["id"] > 0;

        Для Каждого Запись Из Результат["data"]["cursor"]["nextBatch"] Цикл
            МассивДокументов.Добавить(Запись);
        КонецЦикла;

    КонецЦикла;

    // END

    Обработать(Результат, "MongoDB", "ПолучитьПакетДокументов");

КонецПроцедуры

Процедура MongoDB_ОбновитьДокументы(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Коллекция = "new_collection";

    // __4 = $
    Фильтр = Новый Структура("stringField,doubleField", "Текст", Новый Структура("__4gte, __4lte", 100, 150));
    Данные = Новый Структура( "__4set", Новый Структура("doubleField", 999));

    Обновление = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные); // Массив или одиночное
    Результат  = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, Обновление, База);

    // END

    Обработать(Результат, "MongoDB", "ОбновитьДокументы");

    Параметры  = Новый Структура("limit,batchSize", 2, 1);
    Сортировка = Новый Структура("doubleField", -1);

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    Обработать(Результат, "MongoDB", "ОбновитьДокументы", "Получение");

    Фильтр = Новый Структура("stringField,doubleField", "Текст", 999);

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр, Сортировка, Параметры);

    Обработать(Результат, "MongoDB", "ОбновитьДокументы", "Получение новых");

    // Multiply fields
    Фильтр = Новый Структура("category", "электроника");
    Данные = Новый Структура("__4set", Новый Структура("price,inStock,rating", 777, Ложь, 5));

    Обновление = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные, Истина);
    Результат  = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, Обновление, База);
    Обработать(Результат, "MongoDB", "ОбновитьДокументы", 1);

    Фильтр            = Новый Структура("category", "электроника", "price", 777);
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 1");

    // Number inc
    Фильтр = Новый Структура("productName", "Товар 1");
    Данные = Новый Структура("__4inc", Новый Структура("quantity", 10));

    Обновление = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные);
    Результат  = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, Обновление, База);
    Обработать(Результат, "MongoDB", "ОбновитьДокументы", 2);

    Фильтр            = Новый Структура("productName", "Товар 1");
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 2");

    // Array insertion
    Фильтр = Новый Структура("productName", "Товар 2");
    Данные = Новый Структура("__4push", Новый Структура("tags", "обновленный"));

    Обновление = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные);
    Результат  = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, Обновление, База);
    Обработать(Результат, "MongoDB", "ОбновитьДокументы", 3);

    Фильтр            = Новый Структура("productName", "Товар 2", "tags", "обновленный");
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 3");

    // Nested field update
    СоответствиеУстановки = Новый Соответствие;
    СоответствиеУстановки.Вставить("details.weightKg", 2.5);
    СоответствиеУстановки.Вставить("details.supplier", "Поставщик А+");

    Фильтр = Новый Соответствие;
    Фильтр.Вставить("details.supplier", "Поставщик А");

    Данные = Новый Структура("__4set", СоответствиеУстановки);

    Обновление = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные, Истина);
    Результат  = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, Обновление, База);
    Обработать(Результат, "MongoDB", "ОбновитьДокументы", 4);

    Фильтр            = Новый Соответствие;
    Фильтр.Вставить("details.supplier", "Поставщик А+");
    Фильтр.Вставить("details.weightKg", 2.5);
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 4");

    // Upsert
    Фильтр = Новый Структура("productName", "Новый товар");

    //@skip-check structure-consructor-too-many-keys
    Данные = Новый Структура("__4set", Новый Структура("productName,category,price,quantity,inStock,createdDate"
        , "Новый товар"
        , "электроника"
        , 1999
        , 1
        , Истина
        , OPI_Инструменты.ПолучитьТекущуюДату()
    ));

    Обновление = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные, Ложь, Истина);
    Результат  = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, Обновление, База);
    Обработать(Результат, "MongoDB", "ОбновитьДокументы", 5);

    Фильтр            = Новый Структура("productName", "Новый товар");
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 5");

    // Field removing
    Фильтр = Новый Структура("productName", "Товар 3");
    Данные = Новый Структура("__4unset", Новый Структура("rating", ""));

    Обновление = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные);
    Результат  = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, Обновление, База);
    Обработать(Результат, "MongoDB", "ОбновитьДокументы", 6);

    Фильтр            = Новый Структура("productName", "Товар 3");
    Параметры         = Новый Структура("projection", Новый Структура("productName,rating", 1, 1));
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр, Неопределено, Параметры);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 6");

    // Multiply operators
    Фильтр = Новый Структура("price", Новый Структура("__4lt", 200));
    Данные = Новый Структура;
    Данные.Вставить("__4set", Новый Структура("inStock", Ложь));
    Данные.Вставить("__4inc", Новый Структура("quantity", -5));
    Данные.Вставить("__4push", Новый Структура("tags", "уценка"));

    Обновление = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные, Истина);
    Результат  = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, Обновление, База);
    Обработать(Результат, "MongoDB", "ОбновитьДокументы", 7);

    Фильтр            = Новый Структура("price,tags", Новый Структура("__4lt", 200), "уценка");
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 7");

    // Updates array
    МассивОбновлений = Новый Массив;

    Фильтр1     = Новый Структура("category", "электроника");
    Данные1     = Новый Структура("__4set", Новый Структура("price,discounted", 888, Истина));
    Обновление1 = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр1, Данные1, Истина);
    МассивОбновлений.Добавить(Обновление1);

    Фильтр2     = Новый Структура("category", "одежда");
    Данные2     = Новый Структура("__4inc", Новый Структура("quantity", 5));
    Обновление2 = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр2, Данные2, Истина);
    МассивОбновлений.Добавить(Обновление2);

    Фильтр3     = Новый Структура("category", "книги");
    Данные3     = Новый Структура("__4push", Новый Структура("tags", "массовое_обновление"));
    Обновление3 = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр3, Данные3, Истина);
    МассивОбновлений.Добавить(Обновление3);

    Фильтр4 = Новый Структура("productName", "Специальный товар из массива");

    //@skip-check structure-consructor-too-many-keys
    Данные4 = Новый Структура("__4set", Новый Структура("productName,category,price,quantity,inStock,createdDate"
        , "Специальный товар из массива"
        , "специальная"
        , 1111
        , 7
        , Истина
        , OPI_Инструменты.ПолучитьТекущуюДату()
    ));

    Обновление4 = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр4, Данные4, Ложь, Истина);
    МассивОбновлений.Добавить(Обновление4);

    Фильтр5     = Новый Структура("rating", Новый Структура("__4lte", 2));
    Данные5     = Новый Структура;
    Данные5.Вставить("__4set", Новый Структура("needsImprovement", Истина));
    Данные5.Вставить("__4inc", Новый Структура("quantity"        , -2));
    Обновление5 = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр5, Данные5, Истина);
    МассивОбновлений.Добавить(Обновление5);

    Результат = OPI_MongoDB.ОбновитьДокументы(Соединение, Коллекция, МассивОбновлений, База);

    Обработать(Результат, "MongoDB", "ОбновитьДокументы", 9);

    Фильтр            = Новый Структура("category,price", "электроника", 888);
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 8_1");

    Фильтр            = Новый Структура("category,tags", "книги", "массовое_обновление");
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 8_2");

    Фильтр            = Новый Структура("productName", "Специальный товар из массива");
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 8_3");

    Фильтр            = Новый Структура("needsImprovement", Истина);
    РезультатПроверки = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);
    Обработать(РезультатПроверки, "MongoDB", "ОбновитьДокументы", "Проверка 8_4");

КонецПроцедуры

Процедура MongoDB_ПолучитьСтруктуруОбновленияДокументов(ПараметрыФункции)

    // __4 = $
    Фильтр = Новый Структура("stringField,doubleField", "Текст", Новый Структура("__4gte, __4lte", 100, 150));
    Данные = Новый Структура( "__4set", Новый Структура("doubleField", 999));

    Результат = OPI_MongoDB.ПолучитьСтруктуруОбновленияДокументов(Фильтр, Данные, Истина, Истина);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьСтруктуруОбновленияДокументов");

КонецПроцедуры

Процедура MongoDB_ПолучитьСтруктуруУдаленияДокументов(ПараметрыФункции)

    Фильтр    = Новый Структура("stringField,doubleField", "Текст", 999);
    Результат = OPI_MongoDB.ПолучитьСтруктуруУдаленияДокументов(Фильтр, 1); // Массив или одиночное

    // END

    Обработать(Результат, "MongoDB", "ПолучитьСтруктуруУдаленияДокументов");

КонецПроцедуры

Процедура MongoDB_УдалитьДокументы(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Коллекция = "new_collection";

    Фильтр   = Новый Структура("stringField,doubleField", "Текст", 999);
    Удаление = OPI_MongoDB.ПолучитьСтруктуруУдаленияДокументов(Фильтр, 1); // Массив или одиночное

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр); // SKIP
    Обработать(Результат, "MongoDB", "УдалитьДокументы", "Предпроверка");           // SKIP

    Результат = OPI_MongoDB.УдалитьДокументы(Соединение, Коллекция, Удаление, База);

    // END

    Обработать(Результат, "MongoDB", "УдалитьДокументы");

    Результат = OPI_MongoDB.ПолучитьДокументы(Соединение, Коллекция, База, Фильтр);

    Обработать(Результат, "MongoDB", "УдалитьДокументы", "Проверка");

КонецПроцедуры

Процедура MongoDB_СоздатьПользователя(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    МассивРолей = Новый Массив;
    МассивРолей.Добавить("read");
    МассивРолей.Добавить("userAdmin");

    ИмяПользователя    = "newuser";
    ПарольПользователя = "1234";

    Результат = OPI_MongoDB.СоздатьПользователя(Соединение, ИмяПользователя, МассивРолей, База, ПарольПользователя);

    // END

    Обработать(Результат, "MongoDB", "СоздатьПользователя");

    Результат = OPI_MongoDB.СоздатьПользователя(Соединение, ИмяПользователя, МассивРолей, База, ПарольПользователя);

    Обработать(Результат, "MongoDB", "СоздатьПользователя", "Существующий");

КонецПроцедуры

Процедура MongoDB_ИзменитьПользователя(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    МассивРолей = Новый Массив;
    МассивРолей.Добавить("readWrite");

    ИмяПользователя    = "newuser";
    ПарольПользователя = "4321";

    Результат = OPI_MongoDB.ИзменитьПользователя(Соединение, ИмяПользователя, МассивРолей, База, ПарольПользователя);

    // END

    Обработать(Результат, "MongoDB", "ИзменитьПользователя");

    ИмяПользователя = "anotheruser";

    Результат = OPI_MongoDB.ИзменитьПользователя(Соединение, ИмяПользователя, МассивРолей, База, ПарольПользователя);

    Обработать(Результат, "MongoDB", "ИзменитьПользователя", "Несуществующий");

КонецПроцедуры

Процедура MongoDB_УдалитьПользователя(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    ИмяПользователя = "newuser";

    Результат = OPI_MongoDB.УдалитьПользователя(Соединение, ИмяПользователя, База);

    // END

    Обработать(Результат, "MongoDB", "УдалитьПользователя");

    Результат = OPI_MongoDB.УдалитьПользователя(Соединение, ИмяПользователя, База);

    Обработать(Результат, "MongoDB", "УдалитьПользователя", "Повторно");

КонецПроцедуры

Процедура MongoDB_ПолучитьПользователей(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    ИмяПользователя = "newuser";

    Результат = OPI_MongoDB.ПолучитьПользователей(Соединение, ИмяПользователя, База);

    Обработать(Результат, "MongoDB", "ПолучитьПользователей", "Простой"); // SKIP

    МассивПользователей = Новый Массив;
    МассивПользователей.Добавить(Новый Структура("user,db", "bayselonarrend", "admin"));
    МассивПользователей.Добавить(Новый Структура("user,db", "newuser"       , "main"));

    Результат = OPI_MongoDB.ПолучитьПользователей(Соединение, МассивПользователей, База, Истина, Истина);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьПользователей");

КонецПроцедуры

Процедура MongoDB_ПолучитьПользователейБазы(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = ПараметрыФункции["MongoDB_DB"];

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Результат = OPI_MongoDB.ПолучитьПользователейБазы(Соединение, База);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьПользователейБазы");

КонецПроцедуры

Процедура MongoDB_СоздатьРоль(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = "admin";

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    МассивРолей = Новый Массив;
    МассивРолей.Добавить("read");
    МассивРолей.Добавить("userAdmin");

    Ресурс   = Новый Структура("db,collection", База, "new_collection");
    Действия = Новый Массив;

    Действия.Добавить("find");
    Действия.Добавить("insert");
    Действия.Добавить("update");

    Привелегия = OPI_MongoDB.ПолучитьСтруктуруПривелегииРоли(Ресурс, Действия);

    МассивПривелегий = Новый Массив;
    МассивПривелегий.Добавить(Привелегия);

    ИмяРоли = "newrole";

    OPI_MongoDB.УдалитьРоль(Соединение, ИмяРоли, База); // SKIP
    Результат = OPI_MongoDB.СоздатьРоль(Соединение, ИмяРоли, База, МассивПривелегий, МассивРолей);

    // END

    Обработать(Результат, "MongoDB", "СоздатьРоль");

    Результат = OPI_MongoDB.СоздатьРоль(Соединение, ИмяРоли, База, МассивПривелегий, МассивРолей);

    Обработать(Результат, "MongoDB", "СоздатьРоль", "Существующий");

КонецПроцедуры

Процедура MongoDB_ИзменитьРоль(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = "admin";

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    МассивРолей = Новый Массив;
    МассивРолей.Добавить("read");
    МассивРолей.Добавить("userAdmin");

    Ресурс   = Новый Структура("db,collection", База, "new_collection2");
    Действия = Новый Массив;

    Действия.Добавить("find");
    Действия.Добавить("insert");

    Привелегия = OPI_MongoDB.ПолучитьСтруктуруПривелегииРоли(Ресурс, Действия);

    МассивПривелегий = Новый Массив;
    МассивПривелегий.Добавить(Привелегия);

    ИмяРоли = "newrole";

    Результат = OPI_MongoDB.ИзменитьРоль(Соединение, ИмяРоли, База, МассивПривелегий, МассивРолей);

    // END

    Обработать(Результат, "MongoDB", "ИзменитьРоль");

КонецПроцедуры

Процедура MongoDB_УдалитьРоль(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = "admin";

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    ИмяРоли = "newrole";

    Результат = OPI_MongoDB.УдалитьРоль(Соединение, ИмяРоли, База);

    // END

    Обработать(Результат, "MongoDB", "УдалитьРоль");

    Результат = OPI_MongoDB.УдалитьРоль(Соединение, ИмяРоли, База);

    Обработать(Результат, "MongoDB", "УдалитьРоль", "Повторно");

КонецПроцедуры

Процедура MongoDB_ПолучитьСтруктуруПривелегииРоли(ПараметрыФункции)

    База     = ПараметрыФункции["MongoDB_DB"];
    Ресурс   = Новый Структура("db,collection", База, "new_collection");
    Действия = Новый Массив;

    Действия.Добавить("find");
    Действия.Добавить("insert");
    Действия.Добавить("update");

    Результат = OPI_MongoDB.ПолучитьСтруктуруПривелегииРоли(Ресурс, Действия);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьСтруктуруПривелегииРоли");

КонецПроцедуры

Процедура MongoDB_ПолучитьРоли(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = "admin";

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Роль = Новый Структура("role,db", "newrole", База);

    Результат = OPI_MongoDB.ПолучитьРоли(Соединение, Роль, База, Истина);

    // END

    Обработать(Результат, "MongoDB", "ПолучитьРоли");

КонецПроцедуры

Процедура MongoDB_НазначитьРоли(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = "admin";

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Пользователь = "bayselonarrend";
    Роль         = Новый Структура("role,db", "newrole", База);

    Результат = OPI_MongoDB.НазначитьРоли(Соединение, Пользователь, Роль, База);

    // END

    Обработать(Результат, "MongoDB", "НазначитьРоли");

КонецПроцедуры

Процедура MongoDB_СнятьРоли(ПараметрыФункции)

    Адрес  = "127.0.0.1:1234";
    Логин  = ПараметрыФункции["MongoDB_User"];
    Пароль = ПараметрыФункции["MongoDB_Password"];
    База   = "admin";

    Адрес = OPI_ПолучениеДанныхТестов.ПолучитьLocalhost() + ":" + ПараметрыФункции["MongoDB_Port"]; // SKIP

    ПараметрыПодключения = Новый Структура("authSource", "admin");
    СтрокаПодключения    = OPI_MongoDB.СформироватьСтрокуПодключения(Адрес, , Логин, Пароль, ПараметрыПодключения);
    Соединение           = OPI_MongoDB.ОткрытьСоединение(СтрокаПодключения);

    Пользователь = "bayselonarrend";
    Роль         = Новый Структура("role,db", "newrole", База);

    Результат = OPI_MongoDB.СнятьРоли(Соединение, Пользователь, Роль, База);

    // END

    Обработать(Результат, "MongoDB", "СнятьРоли");

КонецПроцедуры

#КонецОбласти

#Область GRPC

Процедура GRPC_ОткрытьСоединение(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы, Мета);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Результат = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    // END

    Обработать(Результат, "GRPC", "ОткрытьСоединение");

    Результат = OPI_GRPC.ЗакрытьСоединение(Результат);

    Обработать(Результат, "GRPC", "ОткрытьСоединение", "Закрытие");

    Адрес     = ПараметрыФункции["GRPC_AddressNoTls"];
    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Результат = OPI_GRPC.ОткрытьСоединение(Параметры);

    Обработать(Результат, "GRPC", "ОткрытьСоединение", "Без TLS");

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto", Proto1);

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Результат = OPI_GRPC.ОткрытьСоединение(Параметры);

    Обработать(Результат, "GRPC", "ОткрытьСоединение", "Ошибка");

КонецПроцедуры

Процедура GRPC_ЗакрытьСоединение(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы, Мета);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Результат  = OPI_GRPC.ЗакрытьСоединение(Соединение);

    // END

    Обработать(Результат, "GRPC", "ЗакрытьСоединение");

КонецПроцедуры

Процедура GRPC_ЭтоКоннектор(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы, Мета);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Результат  = OPI_GRPC.ЭтоКоннектор(Соединение);

    // END

    Обработать(Результат, "GRPC", "ЭтоКоннектор");

КонецПроцедуры

Процедура GRPC_ПолучитьПараметрыСоединения(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Результат = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы, Мета);

    // END

    Обработать(Результат, "GRPC", "ПолучитьПараметрыСоединения");

КонецПроцедуры

Процедура GRPC_ПолучитьНастройкиTls(ПараметрыФункции)

    Результат = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    // END

    Обработать(Результат, "GRPC", "ПолучитьНастройкиTls");

КонецПроцедуры

Процедура GRPC_УстановитьМетаданные(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Мета      = Новый Структура("somekey", "somevalue");
    Результат = OPI_GRPC.УстановитьМетаданные(Соединение, Мета);

    // END

    Обработать(Результат, "GRPC", "УстановитьМетаданные");

    Если Не OPI_ПолучениеДанныхТестов.ЭтоТестCLI() Тогда

        Сервис = "grpcbin.GRPCBin";
        Метод  = "HeadersUnary";

        Результат = OPI_GRPC.ВызватьМетод(Соединение, Сервис, Метод, Неопределено, , Tls);

        Обработать(Результат, "GRPC", "УстановитьМетаданные", "Проверка");

     КонецЕсли;

КонецПроцедуры

Процедура GRPC_ВызватьМетод(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Мета      = Новый Структура("somekey", "somevalue");
    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы, Мета);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyUnary";

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    МассивЧисел = Новый Массив;
    МассивЧисел.Добавить(1);
    МассивЧисел.Добавить(10);
    МассивЧисел.Добавить(100);

    МассивСтруктур = Новый Массив;
    МассивСтруктур.Добавить(Новый Структура("f_string", "Nested value 1"));
    МассивСтруктур.Добавить(Новый Структура("f_string", "Nested value 2"));

    МассивБулево = Новый Массив;
    МассивБулево.Добавить(Истина);
    МассивБулево.Добавить(Ложь);

    Файл = ПараметрыФункции["Document"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Файл);

    ИВФ = ПолучитьИмяВременногоФайла();
    Файл.Записать(ИВФ);

    МассивДвоичныхДанных = Новый Массив;
    МассивДвоичныхДанных.Добавить(Файл); // Как данные
    МассивДвоичныхДанных.Добавить(ИВФ);  // Как путь к файлу

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_int64"  , 123);
    Данные.Вставить("f_float"  , 123.22000122070312);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_enum"   , "ENUM_1");
    Данные.Вставить("f_bytes"  , Файл);
    Данные.Вставить("f_sub"    , Новый Структура("f_string"  , "Nested value"));
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_int32s" , МассивЧисел);
    Данные.Вставить("f_int64s" , МассивЧисел);
    Данные.Вставить("f_floats" , МассивЧисел);
    Данные.Вставить("f_bytess" , МассивДвоичныхДанных);
    Данные.Вставить("f_subs"   , МассивСтруктур);
    Данные.Вставить("f_bools"  , МассивБулево);
    Данные.Вставить("f_enums"  , СтрРазделить("ENUM_1,ENUM_2", ","));

    Результат = OPI_GRPC.ВызватьМетод(Параметры, Сервис, Метод, Данные, , Tls);

    // END

    Обработать(Результат, "GRPC", "ВызватьМетод");

    Результат = OPI_GRPC.ВызватьМетод(Параметры, Сервис, Метод, Неопределено, , Tls);

    Обработать(Результат, "GRPC", "ВызватьМетод", "Пустой");

    Метод     = "HeadersUnary";
    Результат = OPI_GRPC.ВызватьМетод(Параметры, Сервис, Метод, Неопределено, , Tls);

    Обработать(Результат, "GRPC", "ВызватьМетод", "Мета");

КонецПроцедуры

Процедура GRPC_ПолучитьСписокСервисов(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];
    Схема = ПараметрыФункции["GRPC_Proto"]; // Строка, путь к файлу или URL

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схема);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Результат  = OPI_GRPC.ПолучитьСписокСервисов(Соединение);

    // END

    Обработать(Результат, "GRPC", "ПолучитьСписокСервисов");

КонецПроцедуры

Процедура GRPC_ПолучитьСписокМетодов(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];
    Схема = ПараметрыФункции["GRPC_Proto"]; // Строка, путь к файлу или URL

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схема);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Сервис     = "grpcbin.GRPCBin";

    Результат = OPI_GRPC.ПолучитьСписокМетодов(Соединение, Сервис);

    // END

    Обработать(Результат, "GRPC", "ПолучитьСписокМетодов");

КонецПроцедуры

Процедура GRPC_ПолучитьМетод(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];
    Схема = ПараметрыФункции["GRPC_Proto"]; // Строка, путь к файлу или URL

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схема);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);
    Сервис     = "grpcbin.GRPCBin";
    Метод      = "Index";

    Результат = OPI_GRPC.ПолучитьМетод(Соединение, Сервис, Метод);

    // END

    Обработать(Результат, "GRPC", "ПолучитьМетод");

КонецПроцедуры

Процедура GRPC_ИнициализироватьСерверныйПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyServerStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьСерверныйПоток(Соединение, Сервис, Метод, Данные); // <---

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    МассивСообщений = Новый Массив;

    Пока Истина Цикл

        ТекущееСообщение = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);

        Если Не ТекущееСообщение["result"] Тогда

            Ошибка = ТекущееСообщение["error"];

            Если Ошибка = "Timeout" Тогда
                Продолжить;
            ИначеЕсли Ошибка = "Closed" Тогда
                Прервать;
            Иначе
                ВызватьИсключение Ошибка;
            КонецЕсли;

        Иначе

            ДанныеСообщения = ТекущееСообщение["message"];

            Если ЗначениеЗаполнено(ДанныеСообщения) Тогда
                МассивСообщений.Добавить(ДанныеСообщения);
            КонецЕсли;

        КонецЕсли;

    КонецЦикла;

    // END

    Обработать(Результат      , "GRPC", "ИнициализироватьСерверныйПоток");
    Обработать(МассивСообщений, "GRPC", "ИнициализироватьСерверныйПоток", "Массив");

КонецПроцедуры

Процедура GRPC_ИнициализироватьКлиентскийПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyClientStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьКлиентскийПоток(Соединение, Сервис, Метод); // <---

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    ФинальноеСообщение = Неопределено;

    Счетчик = 0;
    Пока Истина Цикл

        ТекущаяОтправка = OPI_GRPC.ОтправитьСообщение(Соединение, IDПотока, Данные);
        Счетчик         = Счетчик + 1;

        Если Не ТекущаяОтправка["result"] Тогда

            Ошибка = ТекущаяОтправка["error"];

            Если Ошибка = "Timeout" Тогда
                Продолжить;
            ИначеЕсли Ошибка = "Closed" Тогда
                ФинальноеСообщение = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);
                Прервать;
            Иначе
                ВызватьИсключение СтрШаблон("%1 (отправлено сообщений %2)", Ошибка, Счетчик);
            КонецЕсли;

        Иначе

            Если Счетчик = 10 Тогда
                Завершение         = OPI_GRPC.ЗавершитьОтправку(Соединение, IDПотока);
                ФинальноеСообщение = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);
                Прервать;
            КонецЕсли;

        КонецЕсли;

    КонецЦикла;

    // END

    Обработать(ФинальноеСообщение, "GRPC", "ИнициализироватьКлиентскийПоток", , Счетчик);

КонецПроцедуры

Процедура GRPC_ИнициализироватьДвунаправленныйПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyBidirectionalStreamStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьДвунаправленныйПоток(Соединение, Сервис, Метод); // <---

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    МассивРезультата = Новый Массив;
    Счетчик          = 0;

    Пока Счетчик < 10 Цикл

        Данные.Вставить("f_int32", Счетчик + 1);

        ТекущаяОтправка = OPI_GRPC.ОтправитьСообщение(Соединение, IDПотока, Данные);

        Если Не ТекущаяОтправка["result"] Тогда

            Ошибка = ТекущаяОтправка["error"];

            Если Ошибка = "Timeout" Тогда
                Продолжить;
            Иначе
                 ВызватьИсключение СтрШаблон("Ошибка отправки: %1 (обработано сообщений %2)", Ошибка, Счетчик);
            КонецЕсли;

        КонецЕсли;

        ТекущееПолучение = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);

        Если Не ТекущееПолучение["result"] Тогда
            ВызватьИсключение СтрШаблон("Ошибка получения: %1 (обработано сообщений %2)", Ошибка, Счетчик);
        КонецЕсли;

        МассивРезультата.Добавить(ТекущееПолучение["message"]);
        Счетчик = Счетчик + 1;

    КонецЦикла;

    OPI_GRPC.ЗакрытьПоток(Соединение, IDПотока);

    // END

    Обработать(Результат, "GRPC", "ИнициализироватьДвунаправленныйПоток", , МассивРезультата);

КонецПроцедуры

Процедура GRPC_ОтправитьСообщение(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyClientStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьКлиентскийПоток(Соединение, Сервис, Метод);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    Результат = OPI_GRPC.ОтправитьСообщение(Соединение, IDПотока, Данные); // <---
    Закрытие  = OPI_GRPC.ЗакрытьПоток(Соединение, IDПотока);

    // END

    Обработать(Результат, "GRPC", "ОтправитьСообщение", , Закрытие);

КонецПроцедуры

Процедура GRPC_ПолучитьСообщение(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyServerStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    МассивЧисел = Новый Массив;
    МассивЧисел.Добавить(1);
    МассивЧисел.Добавить(10);
    МассивЧисел.Добавить(100);

    Файл = ПараметрыФункции["Document"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Файл);

    ИВФ = ПолучитьИмяВременногоФайла();
    Файл.Записать(ИВФ);

    МассивДвоичныхДанных = Новый Массив;
    МассивДвоичныхДанных.Добавить(Файл); // Как данные
    МассивДвоичныхДанных.Добавить(ИВФ);  // Как путь к файлу

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_int64"  , 123);
    Данные.Вставить("f_float"  , 123.22000122070312);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_enum"   , "ENUM_1");
    Данные.Вставить("f_bytes"  , Файл);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_int32s" , МассивЧисел);
    Данные.Вставить("f_bytess" , МассивДвоичныхДанных);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьСерверныйПоток(Соединение, Сервис, Метод, Данные);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    Результат = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока); // <---
    Закрытие  = OPI_GRPC.ЗакрытьПоток(Соединение, IDПотока);

    // END

    Данные.Вставить("f_int64s", Новый Массив);
    Данные.Вставить("f_enums" , Новый Массив);
    Данные.Вставить("f_floats", Новый Массив);
    Данные.Вставить("f_bools" , Новый Массив);
    Данные.Вставить("f_subs"  , Новый Массив);

    Обработать(Результат, "GRPC", "ПолучитьСообщение", , Закрытие, Данные);

КонецПроцедуры

Процедура GRPC_ЗакрытьПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyServerStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ИнициализироватьСерверныйПоток(Соединение, Сервис, Метод, Данные);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    Результат = OPI_GRPC.ЗакрытьПоток(Соединение, IDПотока); // <---

    // END

    Обработать(Результат, "GRPC", "ЗакрытьПоток");

    Результат = OPI_GRPC.ПолучитьСообщение(Соединение, IDПотока);

    Обработать(Результат, "GRPC", "ЗакрытьПоток", "Отправка");

КонецПроцедуры

Процедура GRPC_ОбработатьСерверныйПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyServerStream";

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Результат = OPI_GRPC.ОбработатьСерверныйПоток(Параметры, Сервис, Метод, Данные, , Tls, 3);

    // END

    Обработать(Результат, "GRPC", "ОбработатьСерверныйПоток");

КонецПроцедуры

Процедура GRPC_ОбработатьКлиентскийПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyClientStream";

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_int32"  , 123);
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    МассивЗапросов = Новый Массив;

    Для Н = 1 По 10 Цикл
        МассивЗапросов.Добавить(Данные);
    КонецЦикла;

    Результат = OPI_GRPC.ОбработатьКлиентскийПоток(Параметры, Сервис, Метод, МассивЗапросов, , Tls);

    // END

    Обработать(Результат, "GRPC", "ОбработатьКлиентскийПоток");

    МассивЗапросов.Удалить(МассивЗапросов.ВГраница());

    Результат = OPI_GRPC.ОбработатьКлиентскийПоток(Параметры, Сервис, Метод, МассивЗапросов, , Tls);

    Обработать(Результат, "GRPC", "ОбработатьКлиентскийПоток", "Ошибка");

КонецПроцедуры

Процедура GRPC_ОбработатьДвунаправленныйПоток(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("one");
    МассивСтрок.Добавить("two");
    МассивСтрок.Добавить("three");

    Данные = Новый Соответствие;
    Данные.Вставить("f_string" , "Test message");
    Данные.Вставить("f_bool"   , Истина);
    Данные.Вставить("f_strings", МассивСтрок);
    Данные.Вставить("f_sub"    , Новый Структура("f_string", "Nested value"));

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyBidirectionalStreamStream";

    ПорядокОбмена = Новый Массив;

    Для Н = 1 По 10 Цикл

        ПорядокОбмена.Добавить(Данные);       // Одно отправляем
        ПорядокОбмена.Добавить(Неопределено); // Одно получаем

    КонецЦикла;

    Результат = OPI_GRPC.ОбработатьДвунаправленныйПоток(Параметры, Сервис, Метод, ПорядокОбмена, , Tls);

    // END

    Обработать(Результат, "GRPC", "ОбработатьДвунаправленныйПоток");

КонецПроцедуры

Процедура GRPC_ЗавершитьОтправку(ПараметрыФункции)

    Адрес = ПараметрыФункции["GRPC_Address"];

    Proto1 = ПараметрыФункции["GRPC_ProtoImport"]; // Строка, путь к файлу или URL
    Proto2 = ПараметрыФункции["GRPC_ProtoTS"];     // Строка, путь к файлу или URL

    Схемы = Новый Соответствие;
    Схемы.Вставить("main.proto"    , Proto1); // Основной
    Схемы.Вставить("my_types.proto", Proto2); // Для импорта в основной

    Параметры = OPI_GRPC.ПолучитьПараметрыСоединения(Адрес, Схемы);
    Tls       = OPI_GRPC.ПолучитьНастройкиTls(Истина);

    Сервис = "grpcbin.GRPCBin";
    Метод  = "DummyClientStream";

    Соединение = OPI_GRPC.ОткрытьСоединение(Параметры, Tls);

    Если Не OPI_GRPC.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение Соединение["error"];
    КонецЕсли;

    Результат = OPI_GRPC.ИнициализироватьКлиентскийПоток(Соединение, Сервис, Метод);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    Иначе
        IDПотока = Результат["streamId"];
    КонецЕсли;

    Результат = OPI_GRPC.ЗавершитьОтправку(Соединение, IDПотока);

    // END

    Обработать(Результат, "GRPC", "ЗавершитьОтправку");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
