// OneScript: ./OInt/tests/Modules/OPIt_SQLite.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

// #Использовать oint
// #Использовать asserts
// #Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯкс("SQLite");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертс("SQLite");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область SQLite

Процедура SQLL_ОсновныеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;

    База = ПолучитьИмяВременногоФайла("sqlite");
    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("SQLite_DB", База);
    OPI_Инструменты.ДобавитьПоле("SQLite_DB", База, "Строка", ПараметрыТеста);

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("SQLite_Ext"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("SQLite_ExtLinux", ПараметрыТеста);

    SQLite_ОткрытьСоединение(ПараметрыТеста);
    SQLite_ЗакрытьСоединение(ПараметрыТеста);
    SQLite_ВыполнитьЗапросSQL(ПараметрыТеста);
    SQLite_ЭтоКоннектор(ПараметрыТеста);
    SQLite_ПодключитьРасширение(ПараметрыТеста);

    OPI_Инструменты.УдалитьФайлВПопытке(База, "Ошибка удаления файла базы");

КонецПроцедуры

Процедура SQLL_ORM() Экспорт

    ПараметрыТеста = Новый Структура;

    База = ПолучитьИмяВременногоФайла("sqlite");

    Соединение = OPI_SQLite.ОткрытьСоединение(База);
    ПараметрыТеста.Вставить("SQLite_DB", Соединение);

    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture", ПараметрыТеста);

    SQLite_СоздатьТаблицу(ПараметрыТеста);
    SQLite_ДобавитьЗаписи(ПараметрыТеста);
    SQLite_ГарантироватьЗаписи(ПараметрыТеста);
    SQLite_ПолучитьЗаписи(ПараметрыТеста);
    SQLite_ОбновитьЗаписи(ПараметрыТеста);
    SQLite_УдалитьЗаписи(ПараметрыТеста);
    SQLite_ПолучитьИнформациюОТаблице(ПараметрыТеста);
    SQLite_ДобавитьКолонкуТаблицы(ПараметрыТеста);
    SQLite_УдалитьКолонкуТаблицы(ПараметрыТеста);
    SQLite_ГарантироватьТаблицу(ПараметрыТеста);
    SQLite_ОчиститьТаблицу(ПараметрыТеста);
    SQLite_УдалитьТаблицу(ПараметрыТеста);
    SQLite_ПолучитьСтруктуруФильтраЗаписей(ПараметрыТеста);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("SQLite_DB", База);
    OPI_Инструменты.ДобавитьПоле("SQLite_DB", База, "Строка", ПараметрыТеста);

    SQLite_СоздатьТаблицу(ПараметрыТеста);
    SQLite_ДобавитьЗаписи(ПараметрыТеста);
    SQLite_ГарантироватьЗаписи(ПараметрыТеста);
    SQLite_ПолучитьЗаписи(ПараметрыТеста);
    SQLite_ОбновитьЗаписи(ПараметрыТеста);
    SQLite_УдалитьЗаписи(ПараметрыТеста);
    SQLite_ПолучитьИнформациюОТаблице(ПараметрыТеста);
    SQLite_ДобавитьКолонкуТаблицы(ПараметрыТеста);
    SQLite_УдалитьКолонкуТаблицы(ПараметрыТеста);
    SQLite_ГарантироватьТаблицу(ПараметрыТеста);
    SQLite_ОчиститьТаблицу(ПараметрыТеста);
    SQLite_УдалитьТаблицу(ПараметрыТеста);
    SQLite_ПолучитьСтруктуруФильтраЗаписей(ПараметрыТеста);

    OPI_Инструменты.УдалитьФайлВПопытке(База, "Ошибка удаления файла базы");

КонецПроцедуры

#КонецОбласти // SQLite

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область SQLite

Процедура SQLite_ОткрытьСоединение(ПараметрыФункции)

    ИВФ = ПолучитьИмяВременногоФайла("sqlite");

    БазаНаДиске = OPI_SQLite.ОткрытьСоединение(ИВФ);
    БазаВПамяти = OPI_SQLite.ОткрытьСоединение();

    // END

    OPI_ПолучениеДанныхТестов.Обработать(БазаНаДиске, "SQLite", "ОткрытьСоединение");
    OPI_ПолучениеДанныхТестов.Обработать(БазаВПамяти, "SQLite", "ОткрытьСоединение", "IM");

    Закрытие = OPI_SQLite.ЗакрытьСоединение(БазаНаДиске);

    OPI_ПолучениеДанныхТестов.Обработать(Закрытие, "SQLite", "ОткрытьСоединение", "Закрытие");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла базы");

КонецПроцедуры

Процедура SQLite_ЗакрытьСоединение(ПараметрыФункции)

    ИВФ = ПолучитьИмяВременногоФайла("sqlite");

    Соединение = OPI_SQLite.ОткрытьСоединение(ИВФ);

    OPI_ПолучениеДанныхТестов.Обработать(Соединение, "SQLite", "ЗакрытьСоединение", "Открытие"); // SKIP

    Закрытие = OPI_SQLite.ЗакрытьСоединение(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Закрытие, "SQLite", "ЗакрытьСоединение");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла базы");

КонецПроцедуры

Процедура SQLite_ВыполнитьЗапросSQL(ПараметрыФункции)

    ИВФ = ПолучитьИмяВременногоФайла("sqlite");

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    Соединение = OPI_SQLite.ОткрытьСоединение(ИВФ);

    OPI_ПолучениеДанныхТестов.Обработать(Соединение, "SQLite", "ВыполнитьЗапросSQL", "Открытие");  // SKIP

    // CREATE

    ТекстЗапроса = "
                   |CREATE TABLE test_table (
                   |id INTEGER PRIMARY KEY,
                   |name TEXT,
                   |age INTEGER,
                   |salary REAL,
                   |is_active BOOLEAN,
                   |created_at DATETIME,
                   |data BLOB
                   |);";

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Create"); // SKIP

    // INSERT с параметрами

    ТекстЗапроса = "
                   |INSERT INTO test_table (name, age, salary, is_active, created_at, data)
                   |VALUES (?1, ?2, ?3, ?4, ?5, ?6);";

    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить("Vitaly");                              // TEXT
    МассивПараметров.Добавить(25);                                    // INTEGER
    МассивПараметров.Добавить(1000.12);                               // REAL
    МассивПараметров.Добавить(Истина);                                // BOOL
    МассивПараметров.Добавить(OPI_Инструменты.ПолучитьТекущуюДату()); // DATETIME
    МассивПараметров.Добавить(Новый Структура("blob", Картинка));     // BLOB

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, МассивПараметров, , Соединение);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Insert"); // SKIP

    // SELECT (Результат этого запроса приведен в следующем блоке)

    ТекстЗапроса = "SELECT id, name, age, salary, is_active, created_at, data FROM test_table;";

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", , Картинка); // SKIP

    // Транзакция

    ТекстЗапроса = "BEGIN TRANSACTION;
                   |    CREATE TABLE IF NOT EXISTS users (
                   |        id INTEGER PRIMARY KEY AUTOINCREMENT,
                   |        name TEXT NOT NULL,
                   |        age INTEGER NOT NULL
                   |    );
                   |    INSERT INTO users (name, age) VALUES ('Alice', 30);
                   |    INSERT INTO users (name, age) VALUES ('Bob', 25);
                   |    INSERT INTO users (name, age) VALUES ('Charlie', 35);
                   |    COMMIT;";

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Transaction");  // SKIP

    // С расширением

    Если OPI_Инструменты.ЭтоWindows() Тогда
        Расширение = ПараметрыФункции["SQLite_Ext"];      // URL, Путь или Двоичные данные
    Иначе
        Расширение = ПараметрыФункции["SQLite_ExtLinux"]; // URL, Путь или Двоичные данные
    КонецЕсли;

    ТочкаВхода = "sqlite3_uuid_init";

    СоответствиеРасширений = Новый Соответствие;
    СоответствиеРасширений.Вставить(Расширение, ТочкаВхода);

    ТекстЗапроса = "SELECT uuid4();";

    Результат = OPI_SQLite.ВыполнитьЗапросSQL(ТекстЗапроса, , , Соединение, СоответствиеРасширений);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ВыполнитьЗапросSQL", "Расширение"); // SKIP

    Закрытие = OPI_SQLite.ЗакрытьСоединение(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Закрытие, "SQLite", "ВыполнитьЗапросSQL", "Закрытие");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла базы");

КонецПроцедуры

Процедура SQLite_ЭтоКоннектор(ПараметрыФункции)

    Соединение = OPI_SQLite.ОткрытьСоединение();
    Результат  = OPI_SQLite.ЭтоКоннектор(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ЭтоКоннектор");

КонецПроцедуры

Процедура SQLite_СоздатьТаблицу(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("id"        , "INTEGER PRIMARY KEY");
    СтруктураКолонок.Вставить("name"      , "TEXT");
    СтруктураКолонок.Вставить("age"       , "INTEGER");
    СтруктураКолонок.Вставить("salary"    , "REAL");
    СтруктураКолонок.Вставить("is_active" , "BOOLEAN");
    СтруктураКолонок.Вставить("created_at", "DATETIME");
    СтруктураКолонок.Вставить("data"      , "BLOB");

    Результат = OPI_SQLite.СоздатьТаблицу(Таблица, СтруктураКолонок, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "СоздатьТаблицу");

    СоответствиеКолонок = Новый Соответствие;
    СоответствиеКолонок.Вставить("id"                  , "INTEGER PRIMARY KEY");
    СоответствиеКолонок.Вставить("[Непонятная колонка]", "TEXT");

    Результат = OPI_SQLite.СоздатьТаблицу("test1", СоответствиеКолонок, База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "СоздатьТаблицу", "Непонятная колонка");

КонецПроцедуры

Процедура SQLite_ДобавитьЗаписи(ПараметрыФункции)

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    ФайлКартинки = ПолучитьИмяВременногоФайла("png");
    Картинка.Записать(ФайлКартинки);                          // ФайлКартинки - Файл на диске

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    МассивДанных = Новый Массив;

    СтруктураСтроки1 = Новый Структура;
    СтруктураСтроки1.Вставить("name"      , "Vitaly");                              // TEXT
    СтруктураСтроки1.Вставить("age"       , 25);                                    // INTEGER
    СтруктураСтроки1.Вставить("salary"    , 1000.12);                               // REAL
    СтруктураСтроки1.Вставить("is_active" , Истина);                                // BOOL
    СтруктураСтроки1.Вставить("created_at", OPI_Инструменты.ПолучитьТекущуюДату()); // DATETIME
    СтруктураСтроки1.Вставить("data"      , Новый Структура("blob", Картинка));     // BLOB

    СтруктураСтроки2 = Новый Структура;
    СтруктураСтроки2.Вставить("name"      , "Lesha");                               // TEXT
    СтруктураСтроки2.Вставить("age"       , 20);                                    // INTEGER
    СтруктураСтроки2.Вставить("salary"    , 200.20);                                // REAL
    СтруктураСтроки2.Вставить("is_active" , Ложь);                                  // BOOL
    СтруктураСтроки2.Вставить("created_at", OPI_Инструменты.ПолучитьТекущуюДату()); // DATETIME
    СтруктураСтроки2.Вставить("data"      , Новый Структура("blob", ФайлКартинки)); // BLOB

    МассивДанных.Добавить(СтруктураСтроки1);
    МассивДанных.Добавить(СтруктураСтроки2);

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, МассивДанных, , База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ДобавитьЗаписи");

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, МассивДанных, Ложь, База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Без транзакции");

    СтруктураСтроки2.Вставить("error", "Lesha");
    МассивДанных.Добавить(СтруктураСтроки2);

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, МассивДанных, , База);
    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Ошибка поля");

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, МассивДанных, Ложь, База);
    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Ошибка без транзакции");

    Результат = OPI_SQLite.ДобавитьЗаписи(Таблица, "not valid json", , База);
    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Ошибка JSON");

    СоответствиеСтроки = Новый Соответствие;
    СоответствиеСтроки.Вставить("[Непонятная колонка]", "yo");

    Результат = OPI_SQLite.ДобавитьЗаписи("test1", СоответствиеСтроки, , База);
    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ДобавитьЗаписи", "Непонятная колонка");

    OPI_Инструменты.УдалитьФайлВПопытке(ФайлКартинки, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура SQLite_ПолучитьЗаписи(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Поля = Новый Массив;
    Поля.Добавить("name");
    Поля.Добавить("salary");

    Фильтры = Новый Массив;

    СтруктураФильтра1 = Новый Структура;

    СтруктураФильтра1.Вставить("field", "name");
    СтруктураФильтра1.Вставить("type" , "=");
    СтруктураФильтра1.Вставить("value", "Vitaly");
    СтруктураФильтра1.Вставить("union", "AND");
    СтруктураФильтра1.Вставить("raw"  , Ложь);

    СтруктураФильтра2 = Новый Структура;

    СтруктураФильтра2.Вставить("field", "age");
    СтруктураФильтра2.Вставить("type" , "BETWEEN");
    СтруктураФильтра2.Вставить("value", "20 AND 30");
    СтруктураФильтра2.Вставить("raw"  , Истина);

    Фильтры.Добавить(СтруктураФильтра1);
    Фильтры.Добавить(СтруктураФильтра2);

    Сортировка = Новый Структура("created_at", "DESC");
    Количество = 1;

    Результат = OPI_SQLite.ПолучитьЗаписи(Таблица, Поля, Фильтры, Сортировка, Количество, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПолучитьЗаписи");

    Результат = OPI_SQLite.ПолучитьЗаписи(Таблица, "['name','age','salary','is_active','created_at']", , , , База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПолучитьЗаписи", "Без параметров");

    СтруктураФильтра2.Вставить("type", "SOMETHING");
    Фильтры.Добавить(СтруктураФильтра2);

    Результат = OPI_SQLite.ПолучитьЗаписи(Таблица
        , "['name','age','salary','is_active','created_at']"
        , Фильтры
        ,
        ,
        , База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПолучитьЗаписи", "Ошибка");

    Результат = OPI_SQLite.ПолучитьЗаписи("test1", , , , , База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПолучитьЗаписи", "Непонятная колонка");

КонецПроцедуры

Процедура SQLite_ОбновитьЗаписи(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("name"  , "Vitaly A.");
    СтруктураПолей.Вставить("salary", "999999");

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "name");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", "Vitaly");
    СтруктураФильтра.Вставить("union", "AND");
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Результат = OPI_SQLite.ОбновитьЗаписи(Таблица, СтруктураПолей, СтруктураФильтра, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ОбновитьЗаписи");

    СтруктураФильтра.Вставить("value", "Vitaly A.");

    Фильтры = Новый Массив;
    Фильтры.Добавить(СтруктураФильтра);

    Проверка = OPI_SQLite.ПолучитьЗаписи(Таблица, "['name','salary']", Фильтры, , , База);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "ОбновитьЗаписи", "Проверка", СтруктураПолей);

КонецПроцедуры

Процедура SQLite_УдалитьЗаписи(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "name");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", "Vitaly A.");
    СтруктураФильтра.Вставить("union", "AND");
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Результат = OPI_SQLite.УдалитьЗаписи(Таблица, СтруктураФильтра, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "УдалитьЗаписи");

    Проверка = OPI_SQLite.ПолучитьЗаписи(Таблица, "['name','salary']", Фильтры, , , База);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "УдалитьЗаписи", "Проверка");

КонецПроцедуры

Процедура SQLite_ПолучитьИнформациюОТаблице(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Результат = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПолучитьИнформациюОТаблице");

КонецПроцедуры

Процедура SQLite_ГарантироватьЗаписи(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test_merge";

    СтруктураКолонок = Новый Структура;                            // SKIP
    СтруктураКолонок.Вставить("id"       , "INTEGER PRIMARY KEY"); // SKIP
    СтруктураКолонок.Вставить("name"     , "TEXT");                // SKIP
    СтруктураКолонок.Вставить("age"      , "INTEGER");             // SKIP
    СтруктураКолонок.Вставить("salary"   , "REAL");                // SKIP
    OPI_SQLite.СоздатьТаблицу(Таблица, СтруктураКолонок, База);    // SKIP

    МассивДанных = Новый Массив;

    СтруктураСтроки1 = Новый Структура;
    СтруктураСтроки1.Вставить("id"    , 1);
    СтруктураСтроки1.Вставить("name"  , "Vitaly");
    СтруктураСтроки1.Вставить("age"   , 25);
    СтруктураСтроки1.Вставить("salary", 1000.12);

    СтруктураСтроки2 = Новый Структура;
    СтруктураСтроки2.Вставить("id"    , 2);
    СтруктураСтроки2.Вставить("name"  , "Lesha");
    СтруктураСтроки2.Вставить("age"   , 20);
    СтруктураСтроки2.Вставить("salary", 200.20);

    МассивДанных.Добавить(СтруктураСтроки1);
    МассивДанных.Добавить(СтруктураСтроки2);

    КлючевыеПоля = Новый Массив;
    КлючевыеПоля.Добавить("id");

    Результат = OPI_SQLite.ГарантироватьЗаписи(Таблица, МассивДанных, КлючевыеПоля, , База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ГарантироватьЗаписи", "Вставка");

    Проверка = OPI_SQLite.ПолучитьЗаписи(Таблица, "*", , , , База);
    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "ГарантироватьЗаписи", "Проверка вставки");

    СтруктураСтроки1.Вставить("name"  , "Vitaly Updated");
    СтруктураСтроки1.Вставить("salary", 1500.50);

    СтруктураСтроки3 = Новый Структура;
    СтруктураСтроки3.Вставить("id"    , 3);
    СтруктураСтроки3.Вставить("name"  , "Anton");
    СтруктураСтроки3.Вставить("age"   , 30);
    СтруктураСтроки3.Вставить("salary", 3000.00);

    МассивДанных = Новый Массив;
    МассивДанных.Добавить(СтруктураСтроки1);
    МассивДанных.Добавить(СтруктураСтроки3);

    Результат = OPI_SQLite.ГарантироватьЗаписи(Таблица, МассивДанных, КлючевыеПоля, , База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ГарантироватьЗаписи", "Обновление");

    Проверка = OPI_SQLite.ПолучитьЗаписи(Таблица, "*", , , , База);
    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "ГарантироватьЗаписи", "Проверка обновления");

    OPI_SQLite.УдалитьТаблицу(Таблица, База);

КонецПроцедуры

Процедура SQLite_ПолучитьСтруктуруФильтраЗаписей(ПараметрыФункции)

    Результат = OPI_SQLite.ПолучитьСтруктуруФильтраЗаписей();

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПолучитьСтруктуруФильтраЗаписей");

    Результат = OPI_SQLite.ПолучитьСтруктуруФильтраЗаписей(Истина);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПолучитьСтруктуруФильтраЗаписей", "Пустая");

КонецПроцедуры

Процедура SQLite_УдалитьТаблицу(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Результат = OPI_SQLite.УдалитьТаблицу(Таблица, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "УдалитьТаблицу");

    Проверка = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "УдалитьТаблицу", "Проверка");

    OPI_SQLite.УдалитьТаблицу("test1", База);

КонецПроцедуры

Процедура SQLite_ОчиститьТаблицу(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";

    Результат = OPI_SQLite.ОчиститьТаблицу(Таблица, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ОчиститьТаблицу");

    Проверка = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "ОчиститьТаблицу", "Таблица");

    Проверка = OPI_SQLite.ПолучитьЗаписи(Таблица, , , , , База);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "ОчиститьТаблицу", "Проверка");

КонецПроцедуры

Процедура SQLite_ПодключитьРасширение(ПараметрыФункции)

    Если OPI_Инструменты.ЭтоWindows() Тогда
        Расширение = ПараметрыФункции["SQLite_Ext"];      // URL, Путь или Двоичные данные
    Иначе
        Расширение = ПараметрыФункции["SQLite_ExtLinux"]; // URL, Путь или Двоичные данные
    КонецЕсли;

    База       = ПараметрыФункции["SQLite_DB"];
    ТочкаВхода = "sqlite3_uuid_init";

    Соединение = OPI_SQLite.ОткрытьСоединение(База);
    Результат  = OPI_SQLite.ПодключитьРасширение(Расширение, ТочкаВхода, Соединение);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПодключитьРасширение");

    ИВФ = ПолучитьИмяВременногоФайла("dll");
    КопироватьФайл(Расширение, ИВФ);

    Результат = OPI_SQLite.ПодключитьРасширение(ИВФ, ТочкаВхода, Соединение);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПодключитьРасширение", "Путь");

    Результат = OPI_SQLite.ПодключитьРасширение(Новый ДвоичныеДанные(ИВФ), ТочкаВхода, Соединение);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ПодключитьРасширение", "Двоичные");

    Результат = OPI_SQLite.ЗакрытьСоединение(Соединение);

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла расширение");

КонецПроцедуры

Процедура SQLite_ДобавитьКолонкуТаблицы(ПараметрыФункции)

    База      = ПараметрыФункции["SQLite_DB"];
    Таблица   = "test";
    Имя       = "new_col";
    ТипДанных = "TEXT";

    Результат = OPI_SQLite.ДобавитьКолонкуТаблицы(Таблица, Имя, ТипДанных, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ДобавитьКолонкуТаблицы");

    Результат = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ДобавитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура SQLite_УдалитьКолонкуТаблицы(ПараметрыФункции)

    База    = ПараметрыФункции["SQLite_DB"];
    Таблица = "test";
    Имя     = "new_col";

    Результат = OPI_SQLite.УдалитьКолонкуТаблицы(Таблица, Имя, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "УдалитьКолонкуТаблицы");

    Результат = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "УдалитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура SQLite_ГарантироватьТаблицу(ПараметрыФункции)

    База = ПараметрыФункции["SQLite_DB"];

    Таблица = "test";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("id"        , "INTEGER");
    СтруктураКолонок.Вставить("code"      , "INTEGER");
    СтруктураКолонок.Вставить("name"      , "TEXT");
    СтруктураКолонок.Вставить("age"       , "INTEGER");
    СтруктураКолонок.Вставить("info"      , "TEXT");

    Результат = OPI_SQLite.ГарантироватьТаблицу(Таблица, СтруктураКолонок, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ГарантироватьТаблицу");

    Проверка = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

    Таблица = "test_new";

    Результат = OPI_SQLite.ГарантироватьТаблицу(Таблица, СтруктураКолонок, База);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SQLite", "ГарантироватьТаблицу", "Новая");

    Проверка = OPI_SQLite.ПолучитьИнформациюОТаблице(Таблица, База);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "SQLite", "ГарантироватьТаблицу", "Проверка 2", СтруктураКолонок);

КонецПроцедуры

#КонецОбласти // SQLite

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции
