#Использовать "."
#Использовать "./internal"
#Использовать "./internal/Classes/internal"

Перем ПутьPackagedef;
Перем ОсновнойПутьИсходников;
Перем СоответствиеЗамен;
Перем ПутьПакета;
Перем Версия;
Перем Языки;
Перем КаталогСловарей;
Перем ФайлыФорматирования;
Перем Корень;
Перем ОсновнойЯзык;
Перем КаталогWorkflow;
Перем КаталогJenkins;
Перем КаталогПараметровЛок;
Перем КаталогДополнений;
Перем ФайлПроверкиНабораТестов;
Перем СоответствиеНесовпадающихИмен;
Перем ЛокальныеНастройки;
Перем ДанныеПроекта;

Процедура ПриСозданииОбъекта()

	ДанныеПроекта = Новый ProjectData;
	Обработчик = Новый DictionariesMethods(ДанныеПроекта);
	Обработчик = Новый Versioning(ДанныеПроекта);
	Обработчик = Новый ConversionMethods(ДанныеПроекта);
	Обработчик = Новый LocalizationMethods(ДанныеПроекта);
	Обработчик = Новый CodeFormatingMethods(ДанныеПроекта);
	Обработчик = Новый CodeExamplesMethods(ДанныеПроекта);
	Обработчик = Новый CLIMethods(ДанныеПроекта);
	Обработчик = Новый AlternativeNamesMethods(ДанныеПроекта);
	Обработчик = Новый CLITestsMethods(ДанныеПроекта);
	Обработчик = Новый JenkinsTestsMethods(ДанныеПроекта);
	Обработчик = Новый APICatalogGenerator(ДанныеПроекта);
	Обработчик = Новый TestIndexGenerator(ДанныеПроекта);
	Обработчик = Новый HashSumGenerator(ДанныеПроекта);
	Обработчик = Новый DocsGenerator();
	Обработчик = Новый DocsDeployScript("test", "ru");
	Обработчик = Новый DocsDeployScript("test", "en");

	CommonTools.СообщитьПроцесс("Processing complete!");

КонецПроцедуры

