#Использовать "./internal"
#Использовать "./internal/Classes/internal"

Перем ПутьPackagedef;
Перем ОсновнойПутьИсходников;
Перем СоответствиеЗамен;
Перем ПутьПакета;
Перем Версия;
Перем Языки;
Перем КаталогСловарей;
Перем ФайлыФорматирования;
Перем Корень;
Перем ОсновнойЯзык;
Перем КаталогWorkflow;
Перем КаталогJenkins;
Перем КаталогПараметровЛок;
Перем КаталогДополнений;
Перем ФайлПроверкиНабораТестов;
Перем СоответствиеНесовпадающихИмен;
Перем ЛокальныеНастройки;
Перем ДанныеПроекта;

Процедура ПриСозданииОбъекта()

	ДанныеПроекта      = Новый ProjectData;
	ОбработчикСловарей = Новый DictionariesMethods(ДанныеПроекта);

	Если Не ОбработчикСловарей.ЕстьНовыеСлова() Тогда
	
		Обработчик = Новый Versioning(ДанныеПроекта);
		Обработчик = Новый ConversionMethods(ДанныеПроекта);
		Обработчик = Новый LocalizationMethods(ДанныеПроекта);
		Обработчик = Новый CodeFormatingMethods(ДанныеПроекта);
		Обработчик = Новый CodeExamplesMethods(ДанныеПроекта);
		Обработчик = Новый CLIMethods(ДанныеПроекта);
		Обработчик = Новый AlternativeNamesMethods(ДанныеПроекта);
		Обработчик = Новый CLITestsMethods(ДанныеПроекта);
		Обработчик = Новый JenkinsTestMethods(ДанныеПроекта);
		Обработчик = Новый APICatalogGenerator(ДанныеПроекта);
		Обработчик = Новый TestIndexGenerator(ДанныеПроекта);
		Обработчик = Новый HashSumGenerator(ДанныеПроекта);

	Иначе
		Tools.СообщитьПроцесс("В словарях есть новые слова без перевода. Перевод и создание CLI не выполнено!");
		ЗавершитьРаботу(111);
	КонецЕсли;

	Tools.СообщитьПроцесс("Обработка завершена!");

КонецПроцедуры

