#Использовать oint
#Использовать osparser

Если АргументыКоманднойСтроки.Количество() > 0 Тогда
	Язык = СокрЛП(АргументыКоманднойСтроки[0]);
Иначе
	Язык = "ru";
КонецЕсли;

Парсер          = Новый ПарсерВстроенногоЯзыка;
ДанныеМодуля    = Новый ДвоичныеДанные("./src/" + Язык + "/OInt/tests/Modules/internal/" + ?(Язык = "ru", "OPI_Тесты.os", "OPI_Tests.os"));
ТекстМодуля     = ПолучитьСтрокуИзДвоичныхДанных(ДанныеМодуля);

СтруктураМодуля = Парсер.Разобрать(ТекстМодуля);
НачалоАтомарных = Ложь;

СписокВсехТестов = Новый Массив;

Для Каждого Объявление Из СтруктураМодуля.Объявления Цикл

	Если Не НачалоАтомарных Тогда

		Если Строка(Объявление.Тип) = "ИнструкцияПрепроцессораОбласть" И Объявление.Имя = ?(Язык = "ru", "АтомарныеТесты", "AtomicTests") Тогда
			НачалоАтомарных = Истина;
		КонецЕсли;

	Иначе

		Если Строка(Объявление.Тип) = "ОбъявлениеМетода" Тогда

			Если Не Объявление.Сигнатура.Экспорт Тогда
				Продолжить;
			КонецЕсли;

			СписокВсехТестов.Добавить(Объявление.Имя) ;

		КонецЕсли;

	КонецЕсли;

КонецЦикла;

ВыполненныеТесты = Новый СписокЗначений();
ВыполненныеТесты = ВыполненныеТесты.ЗагрузитьЗначения(OPI_ПолучениеДанныхТестов.ПолучитьСпискоВыполненныхТестов());

Для Каждого Тест Из СписокВсехТестов Цикл

	Если ВыполненныеТесты.НайтиПоЗначению(Тест) = Неопределено Тогда
		ЧастиИмени = СтрРазделить(Тест, "_");
		OPI_ПолучениеДанныхТестов.ЗаписатьПропущенныйТест(ЧастиИмени[0], ЧастиИмени[1]);
	КонецЕсли;

КонецЦикла;



OPI_ПолучениеДанныхТестов.ЗавершитьЗапуск();