#Использовать "../../../../../oint/tools/main"
#Использовать "../../../../../oint/tools/http"

Перем КонтекстВыполнения;

Функция ПолучитьХешСуммуПоследнейСборки() Экспорт
	Возврат OPI_Инструменты.ПолучитьХешСуммуПоследнейСборки();
КонецФункции

Процедура ВыполнитьСкрипт(Знач Скрипт, Ответ, Знач Конфигурация = Неопределено, Знач Контекст = Неопределено) Экспорт
	
	Если КонтекстВыполнения = Неопределено Тогда
		КонтекстВыполнения = Новый Соответствие;
	КонецЕсли;
	
	НормализованныеНастройки = OPI_РасширенныйВызов.НормализоватьНастройки(Конфигурация);
	ЕстьКонтекст             = Контекст <> Неопределено;
	
	Если ЕстьКонтекст Тогда
		UUIDКонтекста = ПрименитьКонтекст(Скрипт, Контекст);
	КонецЕсли;
	
	OPI_РасширенныйВызов.УстановитьНастройки(НормализованныеНастройки);
	Выполнить(Скрипт);
	OPI_РасширенныйВызов.УдалитьНастройки();
	
	Если ЕстьКонтекст Тогда
		КонтекстВыполнения.Удалить(UUIDКонтекста);
	КонецЕсли;

КонецПроцедуры

Функция ПрименитьКонтекст(Скрипт, Знач Контекст)
	
	UUID = Строка(Новый УникальныйИдентификатор);
	КонтекстВыполнения.Вставить(UUID, Контекст);

	ШаблонПеременной     = СтрШаблон("КонтекстВыполнения[""%1""][""%%1""]", UUID);
	ШаблонИдентификатора = """%1""";
	
	Для Каждого ПеременнаяКонтекста Из Контекст Цикл
		
		Скрипт = СтрЗаменить(Скрипт
			, СтрШаблон(ШаблонИдентификатора, ПеременнаяКонтекста.Ключ)
			, СтрШаблон(ШаблонПеременной, ПеременнаяКонтекста.Ключ));
			
	КонецЦикла;
		
	Возврат UUID;

КонецФункции