// OneScript: ./OInt/tools/main/Modules/OPI_ФункцииБиблиотекВызовСервера.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:LineLength-off
// BSLLS:QueryParseError-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:NumberOfParams-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off

//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content
//@skip-check method-too-many-params
//@skip-check constructor-function-return-section

#Использовать "./internal"

#Область СлужебныйПрограммныйИнтерфейс

#Область S3

Функция СгенерироватьПодписьAWS(Знач СтруктураДанных, Знач Адрес, Знач Метод, Знач Заголовки, Знач ВремяЖизни) Экспорт

    AccessKey = СтруктураДанных["AccessKey"];
    SecretKey = СтруктураДанных["SecretKey"];
    Region    = СтруктураДанных["Region"];
    Service   = СтруктураДанных["Service"];

    СтрокаХеша = "UNSIGNED-PAYLOAD";

    ТекущаяДата      = OPI_Инструменты.ПолучитьТекущуюУниверсальнуюДату();
    ВременнаяМетка   = OPI_Инструменты.ВременнаяМеткаISO(ТекущаяДата);
    КлючПодписи      = ПолучитьКлючПодписи(SecretKey, Region, Service, ТекущаяДата);
    Скоуп            = СоздатьСкоуп(Region, Service, ТекущаяДата);
    КлючиЗаголовков  = ПолучитьСтрокуКлючейЗаголовков(Заголовки);
    СтрокаЗаголовков = ПолучитьСтрокуЗаголовков(Заголовки);
    Основа           = OPI_Инструменты.ПолучитьКодированнуюСтроку(AccessKey + "/" + Скоуп, "КодировкаURL");

    ПараметрыURL = Новый ТаблицаЗначений;

    OPI_Инструменты.ДобавитьКлючЗначение(ПараметрыURL, "X-Amz-Algorithm"    , "AWS4-HMAC-SHA256");
    OPI_Инструменты.ДобавитьКлючЗначение(ПараметрыURL, "X-Amz-Credential"   , Основа);
    OPI_Инструменты.ДобавитьКлючЗначение(ПараметрыURL, "X-Amz-Date"         , ВременнаяМетка);
    OPI_Инструменты.ДобавитьКлючЗначение(ПараметрыURL, "X-Amz-Expires"      , ВремяЖизни);
    OPI_Инструменты.ДобавитьКлючЗначение(ПараметрыURL, "X-Amz-SignedHeaders", КлючиЗаголовков);

    ПараметрыСтрокой = OPI_Инструменты.ПараметрыЗапросаВСтроку(ПараметрыURL);
    ПараметрыСтрокой = Прав(ПараметрыСтрокой, СтрДлина(ПараметрыСтрокой) - 1);
    ШаблонЗапроса    = "";
    ЧислоЧастей      = 6;

    Для Н = 1 По ЧислоЧастей Цикл

        ШаблонЗапроса = ШаблонЗапроса + "%" + Строка(Н) + ?(Н = ЧислоЧастей, "", Символы.ПС);

    КонецЦикла;

    КаноническийЗапрос = СтрШаблон(ШаблонЗапроса
        , Метод
        , Адрес
        , ПараметрыСтрокой
        , СтрокаЗаголовков
        , КлючиЗаголовков
        , СтрокаХеша);

    СтрокаДляПодписи = СоздатьСтрокуПодписи(КаноническийЗапрос, Скоуп, ТекущаяДата);
    Сигнатура        = OPI_Криптография.HMAC(КлючПодписи, СтрокаДляПодписи, "SHA256");
    Сигнатура        = нРег(ПолучитьHexСтрокуИзДвоичныхДанных(Сигнатура));

    OPI_Инструменты.ДобавитьКлючЗначение(ПараметрыURL, "X-Amz-Signature", Сигнатура);

    ПодписьURL = OPI_Инструменты.ПараметрыЗапросаВСтроку(ПараметрыURL);

    Возврат ПодписьURL;

КонецФункции

#КонецОбласти

#Область RSS

Функция СоздатьФидRSS(Знач НазваниеКанала
    , Знач ОписаниеКанала
    , Знач СсылкаКанала
    , Знач Элементы
    , Знач ДатаОбновления = Неопределено) Экспорт

    ДатаОбновления = ?(ДатаОбновления = Неопределено
        , OPI_Инструменты.ПолучитьТекущуюДату()
        , ДатаОбновления);

    OPI_ПреобразованиеТипов.ПолучитьСтроку(НазваниеКанала);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(ОписаниеКанала);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(СсылкаКанала);
    OPI_ПреобразованиеТипов.ПолучитьМассив(Элементы);
    OPI_ПреобразованиеТипов.ПолучитьДату(ДатаОбновления);

    ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.УстановитьСтроку("UTF-8");

    ЗаписьXML.ЗаписатьОбъявлениеXML();
    ЗаписьXML.ЗаписатьНачалоЭлемента("rss");
    ЗаписьXML.ЗаписатьАтрибут("version", "2.0");

    ЗаписьXML.ЗаписатьНачалоЭлемента("channel");
    ЗаписатьЭлементXML(ЗаписьXML, "title"      , НазваниеКанала);
    ЗаписатьЭлементXML(ЗаписьXML, "link"       , СсылкаКанала);
    ЗаписатьЭлементXML(ЗаписьXML, "description", ОписаниеКанала);

    ДатаRFC822 = OPI_Инструменты.ДатаRFC822(ДатаОбновления);
    ЗаписатьЭлементXML(ЗаписьXML, "lastBuildDate", ДатаRFC822);

    Для Каждого Элемент Из Элементы Цикл
        ЗаписатьЭлементФида(ЗаписьXML, Элемент);
    КонецЦикла;

    ЗаписьXML.ЗаписатьКонецЭлемента();
    ЗаписьXML.ЗаписатьКонецЭлемента();

    Фид = ЗаписьXML.Закрыть();

    Возврат Фид;

КонецФункции

Функция РазобратьФидRSS(Знач ТекстXML) Экспорт

    Канал = Новый Структура;

    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.УстановитьСтроку(ТекстXML);

    Пока ЧтениеXML.Прочитать() Цикл

        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

            Если ЧтениеXML.Имя = "channel" Тогда
                Канал = ПрочитатьКаналRSS(ЧтениеXML);
                Прервать;
            КонецЕсли;

        КонецЕсли;

    КонецЦикла;

    ЧтениеXML.Закрыть();

    Возврат Канал;

КонецФункции

Функция СоздатьФидAtom(Знач НазваниеФида
    , Знач СсылкаФида
    , Знач IDФида
    , Знач Элементы
    , Знач ДатаОбновления = Неопределено) Экспорт

    ДатаОбновления = ?(ДатаОбновления = Неопределено
        , OPI_Инструменты.ПолучитьТекущуюДату()
        , ДатаОбновления);

    OPI_ПреобразованиеТипов.ПолучитьСтроку(НазваниеФида);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(СсылкаФида);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(IDФида);
    OPI_ПреобразованиеТипов.ПолучитьМассив(Элементы);
    OPI_ПреобразованиеТипов.ПолучитьДату(ДатаОбновления);

    ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.УстановитьСтроку("UTF-8");

    ЗаписьXML.ЗаписатьОбъявлениеXML();
    ЗаписьXML.ЗаписатьНачалоЭлемента("feed");
    ЗаписьXML.ЗаписатьАтрибут("xmlns", "http://www.w3.org/2005/Atom");

    ЗаписатьЭлементXML(ЗаписьXML, "title", НазваниеФида);
    ЗаписатьЭлементXML(ЗаписьXML, "id"   , IDФида);

    ЗаписьXML.ЗаписатьНачалоЭлемента("link");
    ЗаписьXML.ЗаписатьАтрибут("href", СсылкаФида);
    ЗаписьXML.ЗаписатьАтрибут("rel" , "alternate");
    ЗаписьXML.ЗаписатьКонецЭлемента();

    ДатаISO8601 = OPI_Инструменты.ДатаISO8601(ДатаОбновления);
    ЗаписатьЭлементXML(ЗаписьXML, "updated", ДатаISO8601);

    Для Каждого Элемент Из Элементы Цикл
        ЗаписатьЭлементФидаAtom(ЗаписьXML, Элемент);
    КонецЦикла;

    ЗаписьXML.ЗаписатьКонецЭлемента(); // feed

    Фид = ЗаписьXML.Закрыть();

    Возврат Фид;

КонецФункции

Функция РазобратьФидAtom(Знач ТекстXML) Экспорт

    Фид = Новый Структура;

    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.УстановитьСтроку(ТекстXML);

    Пока ЧтениеXML.Прочитать() Цикл

        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

            Если ЧтениеXML.Имя = "feed" Тогда
                Фид = ПрочитатьФидAtom(ЧтениеXML);
                Прервать;
            КонецЕсли;

        КонецЕсли;

    КонецЦикла;

    ЧтениеXML.Закрыть();

    Возврат Фид;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область S3

Функция СоздатьСтрокуПодписи(Знач КаноническийЗапрос, Знач Скоуп, Знач ТекущаяДата)

    ШаблонСтроки = "";
    Алгоритм     = "AWS4-HMAC-SHA256";
    ДатаISO      = OPI_Инструменты.ВременнаяМеткаISO(ТекущаяДата);
    ЧислоЧастей  = 4;

    КаноническийЗапрос = ПолучитьДвоичныеДанныеИзСтроки(КаноническийЗапрос);
    КаноническийЗапрос = OPI_Криптография.Хеш(КаноническийЗапрос, "SHA256");
    КаноническийЗапрос = нРег(ПолучитьHexСтрокуИзДвоичныхДанных(КаноническийЗапрос));

    Для Н = 1 По ЧислоЧастей Цикл

        ШаблонСтроки = ШаблонСтроки + "%" + Строка(Н) + ?(Н = ЧислоЧастей, "", Символы.ПС);

    КонецЦикла;

    СтрокаПодписи = СтрШаблон(ШаблонСтроки, Алгоритм, ДатаISO, Скоуп, КаноническийЗапрос);
    СтрокаПодписи = ПолучитьДвоичныеДанныеИзСтроки(СтрокаПодписи);

    Возврат СтрокаПодписи;

КонецФункции

Функция ПолучитьКлючПодписи(Знач СекретныйКлюч, Знач Регион, Знач Сервис, Знач ТекущаяДата)

    СекретныйКлюч = ПолучитьДвоичныеДанныеИзСтроки("AWS4" + СекретныйКлюч);
    ДанныеДата    = ПолучитьДвоичныеДанныеИзСтроки(Формат(ТекущаяДата, "ДФ=yyyyMMdd;"));
    Регион        = ПолучитьДвоичныеДанныеИзСтроки(Регион);
    Сервис        = ПолучитьДвоичныеДанныеИзСтроки(Сервис);
    AWSЗапрос     = ПолучитьДвоичныеДанныеИзСтроки("aws4_request");
    Sha256_       = "SHA256";

    КлючДанных  = OPI_Криптография.HMAC(СекретныйКлюч, ДанныеДата, Sha256_);
    КлючРегиона = OPI_Криптография.HMAC(КлючДанных, Регион, Sha256_);
    КлючСервиса = OPI_Криптография.HMAC(КлючРегиона, Сервис, Sha256_);

    ФинальныйКлюч = OPI_Криптография.HMAC(КлючСервиса, AWSЗапрос, Sha256_);

    Возврат ФинальныйКлюч;

КонецФункции

Функция СоздатьСкоуп(Знач Регион, Знач Сервис, Знач ТекущаяДата)

    ДатаОбычная = Формат(ТекущаяДата, "ДФ=yyyyMMdd;");

    Скоуп = Новый Массив;
    Скоуп.Добавить(ДатаОбычная);
    Скоуп.Добавить(Регион);
    Скоуп.Добавить(Сервис);
    Скоуп.Добавить("aws4_request");

    СкоупСтрокой = СтрСоединить(Скоуп, "/");

    Возврат СкоупСтрокой;

КонецФункции

Функция ПолучитьСтрокуЗаголовков(Знач Заголовки)

    СписокЗаголовков = Новый СписокЗначений;

    Для Каждого Заголовок Из Заголовки Цикл

        ТекущийКлюч  = Заголовок.Ключ;
        ТекущийКлючН = нРег(ТекущийКлюч);

        Если Не СтрНачинаетсяС(ТекущийКлючН, "host") И Не СтрНачинаетсяС(ТекущийКлючН, "x-amz") Тогда
            Продолжить;
        КонецЕсли;

        СтрокаЗаголовка = нРег(ТекущийКлюч) + ":" + Заголовок.Значение;
        СписокЗаголовков.Добавить(СтрокаЗаголовка);

    КонецЦикла;

    СписокЗаголовков.СортироватьПоЗначению();

    СтрокаЗаголовков = СтрСоединить(СписокЗаголовков.ВыгрузитьЗначения(), Символы.ПС);
    СтрокаЗаголовков = СтрокаЗаголовков + Символы.ПС;

    Возврат СтрокаЗаголовков;

КонецФункции

Функция ПолучитьСтрокуКлючейЗаголовков(Знач Заголовки)

    СписокЗаголовков = Новый СписокЗначений;

    Для Каждого Заголовок Из Заголовки Цикл

        ТекущийКлюч  = Заголовок.Ключ;
        ТекущийКлючН = нРег(ТекущийКлюч);

        Если Не СтрНачинаетсяС(ТекущийКлючН, "host") И Не СтрНачинаетсяС(ТекущийКлючН, "x-amz") Тогда
            Продолжить;
        КонецЕсли;

        СтрокаЗаголовка = нРег(ТекущийКлюч);
        СписокЗаголовков.Добавить(СтрокаЗаголовка);

    КонецЦикла;

    СписокЗаголовков.СортироватьПоЗначению();

    СтрокаЗаголовков = СтрСоединить(СписокЗаголовков.ВыгрузитьЗначения(), ";");

    Возврат СтрокаЗаголовков;

КонецФункции

#КонецОбласти

#Область RSS

Процедура ЗаписатьЭлементXML(ЗаписьXML, ИмяЭлемента, Значение)

    Если ЗначениеЗаполнено(Значение) Тогда
        ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
        ЗаписьXML.ЗаписатьТекст(Значение);
        ЗаписьXML.ЗаписатьКонецЭлемента();
    КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьЭлементФида(ЗаписьXML, Элемент)

    OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Элемент);

    ЗаписьXML.ЗаписатьНачалоЭлемента("item");

    Для Каждого ПолеДанных Из Элемент Цикл

        ТекущийКлюч     = ПолеДанных.Ключ;
        ТекущееЗначение = ПолеДанных.Значение;

        Если ТипЗнч(ТекущееЗначение) = Тип("Дата") Тогда
            ТекущееЗначение = OPI_Инструменты.ДатаRFC822(ТекущееЗначение);
        Иначе
            OPI_ПреобразованиеТипов.ПолучитьСтроку(ТекущееЗначение, Ложь);
        КонецЕсли;

        Если ТекущийКлюч = "guid" Тогда
            ЗаписьXML.ЗаписатьНачалоЭлемента("guid");
            ЗаписьXML.ЗаписатьАтрибут("isPermaLink", "false");
            ЗаписьXML.ЗаписатьТекст(ТекущееЗначение);
            ЗаписьXML.ЗаписатьКонецЭлемента();
        Иначе
            ЗаписатьЭлементXML(ЗаписьXML, ТекущийКлюч, ТекущееЗначение);
        КонецЕсли;

    КонецЦикла;

    ЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

Функция ПрочитатьКаналRSS(ЧтениеXML)

    Канал    = Новый Структура;
    Элементы = Новый Массив;

    Пока ЧтениеXML.Прочитать() Цикл

        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

            ИмяЭлемента = ЧтениеXML.Имя;

            Если ИмяЭлемента = "item" Тогда
                Элемент = ПрочитатьЭлементRSS(ЧтениеXML);
                Элементы.Добавить(Элемент);
            Иначе
                ЧтениеXML.Прочитать();
                Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
                    Канал.Вставить(ИмяЭлемента, ЧтениеXML.Значение);
                КонецЕсли;
            КонецЕсли;

        ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "channel" Тогда
            Прервать;
        Иначе
            Продолжить;
        КонецЕсли;

    КонецЦикла;

    Канал.Вставить("items", Элементы);

    Возврат Канал;

КонецФункции

Функция ПрочитатьЭлементRSS(ЧтениеXML)

    Элемент = Новый Структура;

    Пока ЧтениеXML.Прочитать() Цикл

        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

            ИмяЭлемента = ЧтениеXML.Имя;
            ЧтениеXML.Прочитать();

            Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
                Элемент.Вставить(ИмяЭлемента, ЧтениеXML.Значение);
            КонецЕсли;

        ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "item" Тогда
            Прервать;
        Иначе
            Продолжить;
        КонецЕсли;

    КонецЦикла;

    Возврат Элемент;

КонецФункции

Процедура ЗаписатьЭлементФидаAtom(ЗаписьXML, Элемент)

    OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Элемент);

    ЗаписьXML.ЗаписатьНачалоЭлемента("entry");

    Для Каждого ПолеДанных Из Элемент Цикл

        ТекущийКлюч     = ПолеДанных.Ключ;
        ТекущееЗначение = ПолеДанных.Значение;

        Если ТипЗнч(ТекущееЗначение) = Тип("Дата") Тогда
            ТекущееЗначение = OPI_Инструменты.ДатаISO8601(ТекущееЗначение);
        Иначе
            OPI_ПреобразованиеТипов.ПолучитьСтроку(ТекущееЗначение, Ложь);
        КонецЕсли;

        Если ТекущийКлюч = "link" Тогда
            ЗаписьXML.ЗаписатьНачалоЭлемента("link");
            ЗаписьXML.ЗаписатьАтрибут("href", ТекущееЗначение);
            ЗаписьXML.ЗаписатьАтрибут("rel" , "alternate");
            ЗаписьXML.ЗаписатьКонецЭлемента();
        ИначеЕсли ТекущийКлюч = "author" Тогда
            ЗаписьXML.ЗаписатьНачалоЭлемента("author");
            ЗаписатьЭлементXML(ЗаписьXML, "name"     , ТекущееЗначение);
            ЗаписьXML.ЗаписатьКонецЭлемента();
        ИначеЕсли ТекущийКлюч = "content" Тогда
            ЗаписьXML.ЗаписатьНачалоЭлемента("content");
            ЗаписьXML.ЗаписатьАтрибут("type", "html");
            ЗаписьXML.ЗаписатьТекст(ТекущееЗначение);
            ЗаписьXML.ЗаписатьКонецЭлемента();
        Иначе
            ЗаписатьЭлементXML(ЗаписьXML, ТекущийКлюч, ТекущееЗначение);
        КонецЕсли;

    КонецЦикла;

    ЗаписьXML.ЗаписатьКонецЭлемента(); // entry

КонецПроцедуры

Функция ПрочитатьФидAtom(ЧтениеXML)

    Фид      = Новый Структура;
    Элементы = Новый Массив;

    Пока ЧтениеXML.Прочитать() Цикл

        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

            ИмяЭлемента = ЧтениеXML.Имя;

            Если ИмяЭлемента = "entry" Тогда
                Элемент = ПрочитатьЭлементAtom(ЧтениеXML);
                Элементы.Добавить(Элемент);
            ИначеЕсли ИмяЭлемента = "link" Тогда
                Фид.Вставить("link", ЧтениеXML.ПолучитьАтрибут("href"));
            Иначе
                ЧтениеXML.Прочитать();
                Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
                    Фид.Вставить(ИмяЭлемента, ЧтениеXML.Значение);
                КонецЕсли;
            КонецЕсли;

        ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "feed" Тогда
            Прервать;
        Иначе
            Продолжить;
        КонецЕсли;

    КонецЦикла;

    Фид.Вставить("entries", Элементы);

    Возврат Фид;

КонецФункции

Функция ПрочитатьЭлементAtom(ЧтениеXML)

    Элемент = Новый Структура;

    Пока ЧтениеXML.Прочитать() Цикл

        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

            ИмяЭлемента = ЧтениеXML.Имя;

            Если ИмяЭлемента = "link" Тогда
                Элемент.Вставить("link"  , ЧтениеXML.ПолучитьАтрибут("href"));
            ИначеЕсли ИмяЭлемента = "author" Тогда
                ИмяАвтора = ПрочитатьАвтораAtom(ЧтениеXML);
                Элемент.Вставить("author", ИмяАвтора);
            Иначе
                ЧтениеXML.Прочитать();
                Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
                    Элемент.Вставить(ИмяЭлемента, ЧтениеXML.Значение);
                КонецЕсли;
            КонецЕсли;

        ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "entry" Тогда
            Прервать;
        Иначе
            Продолжить;
        КонецЕсли;

    КонецЦикла;

    Возврат Элемент;

КонецФункции

Функция ПрочитатьАвтораAtom(ЧтениеXML)

    ИмяАвтора = "";

    Пока ЧтениеXML.Прочитать() Цикл

        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "name" Тогда
            ЧтениеXML.Прочитать();
            Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
                ИмяАвтора = ЧтениеXML.Значение;
            КонецЕсли;
        ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "author" Тогда
            Прервать;
        Иначе
            Продолжить;
        КонецЕсли;

    КонецЦикла;

    Возврат ИмяАвтора;

КонецФункции

#КонецОбласти

#КонецОбласти
