// CLI: mcp

#Использовать "../../../oint/tools/main"

Перем ПараметрыКонфигурации;
Перем МассивПоддерживаемыхВерсий;

#Область СлужебныйПрограммныйИнтерфейс

Функция Запустить(Знач Конфигурация) Экспорт

	МассивПоддерживаемыхВерсий = Новый Массив;
	МассивПоддерживаемыхВерсий.Добавить("2024-11-05");

	Если ЗначениеЗаполнено(Конфигурация) Тогда
		ТекстОшибки           = "Конфигурация не является валидной коллекцией ключ и значение";
		ПараметрыКонфигурации = OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Конфигурация, ТекстОшибки);
	КонецЕсли;

	Пока Истина Цикл

		Данные = "";

		ВвестиСтроку(Данные, , , Истина);

		Попытка
			ОтветСтруктура = ОбработатьЗапрос(Данные);
		Исключение
			ОтветСтруктура = ОтветОшибкаСервера(ОписаниеОшибки());
		КонецПопытки;

		ОтветСтрокой = OPI_Инструменты.JSONСтрокой(ОтветСтруктура);

		Сообщить(ОтветСтрокой);

	КонецЦикла;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьЗапрос(Знач СтрокаДанных)

	Попытка
		Данные = OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(СтрокаДанных);
	Исключение
		Возврат ОтветОшибкаJSON();
	КонецПопытки;

	Ошибка = ПроверитьЗапрос(Данные);

	Если Ошибка <> Неопределено Тогда
		Возврат Ошибка;
	КонецЕсли;

	Метод  = Данные["method"];

	Если Метод = "initialize" Тогда

		Результат = ОбработатьInitialize(Данные);

	ИначеЕсли Метод = "tools/list" Тогда

		Результат = ОбработатьToolsList(Данные);

	Иначе

		IDЗапроса = Данные["id"];
		Результат = ОтветОшибкаПараметров(IDЗапроса, "Not implemented");

	КонецЕсли;

	Возврат Результат;

 КонецФункции

Функция ОбработатьInitialize(Знач Данные)

	IDЗапроса = Данные["id"];
	Ответ     = ЗаготовкаОтвета(IDЗапроса);

	Результат = Новый Структура;
	Результат.Вставить("protocolVersion", МассивПоддерживаемыхВерсий[0]);
	Результат.Вставить("capabilities"   , Новый Структура("tools", Новый Структура));
	Результат.Вставить("serverInfo"     , Новый Структура("name,version", "oint-mcp-server", "2.0.0"));

	Ответ.Вставить("result", Результат);

	Возврат Ответ;

КонецФункции

Функция ОбработатьToolsList(Знач Данные)

	IDЗапроса = Данные["id"];
	Ответ     = ЗаготовкаОтвета(IDЗапроса);

	ФайлTools   = ОбъединитьПути(ТекущийСценарий().Каталог, "tools.json");
	ДанныеTools = OPI_Инструменты.ПрочитатьJSONФайл(ФайлTools);
	
	Ответ.Вставить("result", ДанныеTools);

	Возврат Ответ;

КонецФункции

Функция ПроверитьЗапрос(Знач Данные)

	МассивОбязательныхПолей = Новый Массив;
	МассивОбязательныхПолей.Добавить("jsonrpc");
	МассивОбязательныхПолей.Добавить("id");
	МассивОбязательныхПолей.Добавить("method");

	ОтсутствующиеПоля = OPI_Инструменты.НайтиОтсутствующиеПоляКоллекции(Данные, МассивОбязательныхПолей);
	IDЗапроса         = OPI_Инструменты.ПолучитьИли(Данные, "id", Неопределено);

	Если ОтсутствующиеПоля.Количество() > 0 Тогда

		ТекстОшибки = СтрШаблон("Params not found: %1", СтрСоединить(ОтсутствующиеПоля));
		Возврат ОтветОшибкаПараметров(IDЗапроса, ТекстОшибки);

	КонецЕсли;

	Метод = Данные["method"];

	Если Метод = "initialize" Тогда

		ПараметрыКлиента = Неопределено;
		ПротоколКлиента  = Неопределено;

		Если Не OPI_Инструменты.ПолеКоллекцииСуществует(Данные, "params", ПараметрыКлиента) Тогда
			Возврат ОтветОшибкаПараметров(IDЗапроса, "Method params not found");
		КонецЕсли;

		Если Не OPI_Инструменты.ПолеКоллекцииСуществует(ПараметрыКлиента, "protocolVersion", ПротоколКлиента) Тогда
			Возврат ОтветОшибкаПараметров(IDЗапроса, "Protocol version not found");
		КонецЕсли;

		Если МассивПоддерживаемыхВерсий.Найти(ПротоколКлиента) = Неопределено Тогда
			Возврат ОтветНеподдерживаемаяВерсия(IDЗапроса, ПротоколКлиента);
		КонецЕсли;

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ОтветОшибкаJSON()

	Ответ = ЗаготовкаОшибки();
	Ответ["error"]["message"] = "Parse error";
	Ответ["error"]["code"]    = -32700;

	Возврат Ответ;

КонецФункции

Функция ОтветНеподдерживаемаяВерсия(Знач IDЗапроса, Знач Версия)

	Ответ = ЗаготовкаОшибки();
	Ответ["error"]["message"] = "Unsupported protocol version";
	Ответ["error"]["code"]    = -32602;

	Ответ["error"]["data"].Вставить("requested", Версия);
	Ответ["error"]["data"].Вставить("supported", МассивПоддерживаемыхВерсий);

	Возврат Ответ;

КонецФункции

Функция ОтветОшибкаПараметров(Знач IDЗапроса, Знач ТекстОшибки)

	Ответ = ЗаготовкаОшибки(IDЗапроса);
	Ответ["error"]["message"] = "Invalid Request";
	Ответ["error"]["data"].Вставить("details", ТекстОшибки);

	Возврат Ответ;

КонецФункции

Функция ОтветОшибкаСервера(Знач ТекстОшибки)

	Ответ = ЗаготовкаОшибки();
	Ответ["error"]["code"]    = -32000;
	Ответ["error"]["message"] = "	Server error";
	Ответ["error"]["data"].Вставить("details", ТекстОшибки);

	Возврат Ответ;

КонецФункции

Функция ЗаготовкаОшибки(Знач IDЗапроса = Неопределено)

	СтруктураОтвета = ЗаготовкаОтвета(IDЗапроса);

	Ошибка = Новый Структура("code,message,data"
		, -32600
		, "Unexpected error"
		, Новый Структура);

	СтруктураОтвета.Вставить("error", Ошибка);

	Возврат СтруктураОтвета;

КонецФункции

Функция ЗаготовкаОтвета(Знач IDЗапроса = Неопределено)

	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("jsonrpc", "2.0");

	Если ЗначениеЗаполнено(IDЗапроса) Тогда
		OPI_ПреобразованиеТипов.ПолучитьЧисло(IDЗапроса);
	КонецЕсли;

	СтруктураОтвета.Вставить("id", IDЗапроса);

	Возврат СтруктураОтвета;

КонецФункции

#КонецОбласти