// CLI: server
// Tool: true

#Использовать "../../../oint/tools/main"
#Использовать "../../core/Classes/internal"
#Использовать "../../data"


Перем ОбъектОПИ;

#Область ПрограммныйИнтерфейс

#Область МетодыСервера

// stdio
// Запускает сервер для обмена через стандартные потоки ввода вывода
// 
// Параметры:
//  ПродолжатьПриОшибке  - Булево  - Продолжать или завершать работу при возникновении ошибки - continue
//  РазделительСообщений - Строка  - Строка, добавляемая в конец ответа от сервера            - sprt
//
// Возвращаемое значение:
//  Строка - пустая строка
Функция stdio(Знач ПродолжатьПриОшибке, Знач РазделительСообщений = "\n-OINT-MSG-END-") Экспорт
	
	OPI_ПреобразованиеТипов.ПолучитьБулево(ПродолжатьПриОшибке);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(РазделительСообщений);
	
	ОбъектОПИ = Новый LibraryComposition;

	Пока Истина Цикл
		
		Данные = "";

		ВвестиСтроку(Данные);
		
		Если Не ЗначениеЗаполнено(Данные) Тогда
			Приостановить(100);
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			Ответ = ОбработатьЗапрос(Данные);
			
		Исключение
			
			Если ПродолжатьПриОшибке Тогда
				Ответ = ОписаниеОшибки();
			Иначе
				ВызватьИсключение ОписаниеОшибки()
			КонецЕсли;
			
		КонецПопытки;
		
		Если Ответ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		OPI_ПреобразованиеТипов.ПолучитьСтроку(Ответ);		
		Консоль.ВывестиСтроку(СтрШаблон("%1%2", СокрЛП(Ответ), РазделительСообщений));
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьЗапрос(Знач СтрокаДанных)
	
	Если Не ЗначениеЗаполнено(СтрокаДанных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧастиСтроки = СтрРазделить(СтрокаДанных, " ", Истина);
	
	Если ЧастиСтроки.Количество() < 2 Тогда
		ВызватьИсключение  "Отсутствует имя метода или команды!"
	КонецЕсли;
	
	Команда = ЧастиСтроки[0];
	ЧастиСтроки.Удалить(0);

	Метод = ЧастиСтроки[0];
	ЧастиСтроки.Удалить(0);

	ДанныеМетода = ОбъектОПИ.ПолучитьИнформациюОМетоде(Команда, Метод);
    
	Если ДанныеМетода = Неопределено Тогда
		ВызватьИсключение  "Ошибка в имени метода или команды!"	
	КонецЕсли;
	
	СписокОписанийПараметров = ДанныеМетода["params"];
	СписокПоискаПараметров   = Новый СписокЗначений;
	ОпцииОбработанные        = Новый Соответствие;
	
	Для Каждого ОписаниеПараметров Из СписокОписанийПараметров Цикл
		СписокПоискаПараметров.Добавить(ОписаниеПараметров["name"]);
		СписокПоискаПараметров.Добавить(ОписаниеПараметров["short"]);
	КонецЦикла;
	
	ТекущаяОпция   = Неопределено;
	ТекущаяСклейка = Неопределено;

	Для Каждого ЧастьСтроки Из ЧастиСтроки Цикл
		
		Если СписокПоискаПараметров.НайтиПоЗначению(ЧастьСтроки) = Неопределено Тогда
			
			Если ТекущаяСклейка = Неопределено Тогда
				ВызватьИсключение "Проверьте порядок и экранирование при вводе команды!"
			КонецЕсли;

			ТекущаяСклейка.Добавить(ЧастьСтроки);
			
		Иначе
			
			Если ЗначениеЗаполнено(ТекущаяСклейка) Тогда
				
				ТекущееЗначение = СтрСоединить(ТекущаяСклейка, " ");
				ОпцииОбработанные.Вставить(ТекущаяОпция, ТекущееЗначение);
				
			КонецЕсли;
			
			ТекущаяОпция   = ЧастьСтроки;
			ТекущаяСклейка = Новый Массив;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекущаяСклейка) Тогда
		
		ТекущееЗначение = СтрСоединить(ТекущаяСклейка, " ");
		ОпцииОбработанные.Вставить(ТекущаяОпция, ТекущееЗначение);
		
	КонецЕсли;
	
	СтруктураВызова = ОбъектОПИ.СформироватьСтрокуВызоваМетода(ОпцииОбработанные, Команда, Метод);
	
	Если СтруктураВызова["Ошибка"] Тогда
		
		ВызватьИсключение "Проверьте порядок и экранирование при вводе команды!"
		
	КонецЕсли;
	
	ТекстВыполнения = СтруктураВызова["Результат"];
	
	Результат = Неопределено;
	
	Попытка
		Executor.ВыполнитьСкрипт(ТекстВыполнения, Результат);
	Исключение
		Результат = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

#КонецОбласти