// CLI: server
// Tool: true

#Использовать "../../../oint/tools/main"
#Использовать "../../core/Classes/internal"
#Использовать "../../data"

Перем ОбъектОПИ;
Перем ПеременныеСеанса;

#Область ПрограммныйИнтерфейс

#Область МетодыСервера

// stdio
// Запускает сервер для обмена через стандартные потоки ввода вывода
// 
// Параметры:
//  РазделительСообщений - Строка  - Строка, добавляемая в конец ответа от сервера                 - sprt
//  РазделятьНачало      - Булево  - Дополнительно вставляет разделитель в начало сообщения        - bsprt
//  КодировкаПотоков     - Строка  - Использовать конкретную кодировку вне зависимости от оболочки - enc
//
// Возвращаемое значение:
//  Строка - пустая строка
Функция stdio(Знач РазделительСообщений = "", Знач РазделятьНачало = Ложь, Знач КодировкаПотоков = "") Экспорт
	
	ПеременныеСеанса = Новый Соответствие;

	OPI_ПреобразованиеТипов.ПолучитьСтроку(КодировкаПотоков);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(РазделительСообщений);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(РазделятьНачало);
	
	ОбъектОПИ = Новый LibraryComposition;
	
	Если ЗначениеЗаполнено(КодировкаПотоков) Тогда
		Консоль.КодировкаВходногоПотока  = КодировкаПотоков;
		Консоль.КодировкаВыходногоПотока = КодировкаПотоков;
	КонецЕсли;

	Пока Истина Цикл
		
		Данные = "";

		ВвестиСтроку(Данные);
		
		Если Не ЗначениеЗаполнено(Данные) Тогда
			Приостановить(100);
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			Ответ = ОбработатьЗапрос(Данные);
			
		Исключение
			
			Ответ = ОписаниеОшибки();

		КонецПопытки;
		
		Если Ответ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		OPI_ПреобразованиеТипов.ПолучитьСтроку(Ответ);		
		
		Если РазделятьНачало Тогда
			ШаблонОтвета = "%2%1%2";
		Иначе
			ШаблонОтвета = "%1%2";
		КонецЕсли;

		Консоль.Вывести(СтрШаблон(ШаблонОтвета, СокрЛП(Ответ), РазделительСообщений));
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьЗапрос(Знач СтрокаДанных)
	
	Если Не ЗначениеЗаполнено(СтрокаДанных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧастиСтроки = СтрРазделить(СтрокаДанных, " ", Истина);
	
	Если ЧастиСтроки.Количество() < 2 Тогда
		Возврат ОбработатьСлужебнуюКоманду(ЧастиСтроки[0]);
	КонецЕсли;
	
	Команда = ЧастиСтроки[0];
	ЧастиСтроки.Удалить(0);

	Метод = ЧастиСтроки[0];
	ЧастиСтроки.Удалить(0);

	ДанныеМетода = ОбъектОПИ.ПолучитьИнформациюОМетоде(Команда, Метод);
    
	Если ДанныеМетода = Неопределено Тогда
		ВызватьИсключение  "Ошибка в имени метода или команды!"	
	КонецЕсли;
	
	СписокОписанийПараметров = ДанныеМетода["params"];
	СписокПоискаПараметров   = Новый СписокЗначений;
	ОпцииОбработанные        = Новый Соответствие;
	
	Для Каждого ОписаниеПараметров Из СписокОписанийПараметров Цикл
		СписокПоискаПараметров.Добавить(ОписаниеПараметров["name"]);
		СписокПоискаПараметров.Добавить(ОписаниеПараметров["short"]);
	КонецЦикла;
	
	ТекущаяОпция   = Неопределено;
	ТекущаяСклейка = Неопределено;
	Контекст       = Новый Соответствие;

	Для Каждого ЧастьСтроки Из ЧастиСтроки Цикл
		
		Если СписокПоискаПараметров.НайтиПоЗначению(ЧастьСтроки) = Неопределено Тогда
			
			Если ТекущаяСклейка = Неопределено Тогда
				ВызватьИсключение "Проверьте порядок и экранирование при вводе команды!"
			КонецЕсли;

			ТекущаяСклейка.Добавить(ЧастьСтроки);
			
		Иначе
			
			Если ЗначениеЗаполнено(ТекущаяСклейка) Тогда
				
				ТекущееЗначение = СтрСоединить(ТекущаяСклейка, " ");
				ДополнитьКонтекст(Контекст, ТекущееЗначение);
				ОпцииОбработанные.Вставить(ТекущаяОпция, ТекущееЗначение);
				
			КонецЕсли;
			
			ТекущаяОпция   = ЧастьСтроки;
			ТекущаяСклейка = Новый Массив;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекущаяСклейка) Тогда
		
		ТекущееЗначение = СтрСоединить(ТекущаяСклейка, " ");
		ДополнитьКонтекст(Контекст, ТекущееЗначение);
		ОпцииОбработанные.Вставить(ТекущаяОпция, ТекущееЗначение);
		
	КонецЕсли;
	
	СтруктураВызова = ОбъектОПИ.СформироватьСтрокуВызоваМетода(ОпцииОбработанные, Команда, Метод, , Истина);
	
	Если СтруктураВызова["Ошибка"] Тогда
		
		ВызватьИсключение "Проверьте порядок и экранирование при вводе команды!"
		
	КонецЕсли;
	
	ТекстВыполнения = СтруктураВызова["Результат"];
	
	Результат = Неопределено;
	
	Попытка
		Executor.ВыполнитьСкрипт(ТекстВыполнения, Результат, , Контекст);
		НормализоватьРезультат(Результат);
	Исключение
		Результат = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

Функция ОбработатьСлужебнуюКоманду(Знач Команда)
	
	Команда = СокрЛП(Команда);
	
	Если Команда = "help" Тогда
		
		Возврат "Служебные команды:
		|
		|exit  - завершение работы сервера
		|vars  - вывод списка переменных процесса
		|clear - очистка списка переменных процесса";
		
	ИначеЕсли Команда = "exit" Тогда
		
		ЗавершитьРаботу(0);
		
	ИначеЕсли Команда = "vars" Тогда
		
		Если Не ЗначениеЗаполнено(ПеременныеСеанса) Тогда
			Возврат "";
		КонецЕсли;
		
		ШаблонПеременной = "%1 %2";
		МассивВывода     = Новый Массив;

		Для Каждого Переменная Из ПеременныеСеанса Цикл
			МассивВывода.Добавить(СтрШаблон(ШаблонПеременной, Переменная.Ключ, Строка(ТипЗнч(Переменная.Значение))));
		КонецЦикла;
		
		Возврат СтрСоединить(МассивВывода, Символы.ПС);
		
	ИначеЕсли Команда = "clear" Тогда
		
		ПеременныеСеанса.Очистить();
		Возврат "OK"
		
	Иначе
		ВызватьИсключение  "Отсутствует имя метода или команды!";
	КонецЕсли;

КонецФункции

Функция СгенерироватьКлючПеременной()
	
	КлючПеременной = "";
	ШаблонКлюча    = "{oint-%1}";
	
	Пока КлючПеременной = "" Или ПеременныеСеанса.Получить(КлючПеременной) <> Неопределено Цикл
		
		КлючПеременной = СтрШаблон(ШаблонКлюча, Лев(Строка(Новый УникальныйИдентификатор), 6));
		
	КонецЦикла;
	
	Возврат КлючПеременной;
	
КонецФункции

Процедура НормализоватьРезультат(Результат)
	
	ТипРезультата = ТипЗнч(Результат);
	
	Если ТипРезультата = Тип("ДвоичныеДанные") Тогда

		Результат = ПолучитьBase64СтрокуИзДвоичныхДанных(Результат);
		
	ИначеЕсли СтрНачинаетсяС(Строка(ТипРезультата), "AddIn.") Тогда
		
		КлючПеременной = СгенерироватьКлючПеременной();
		ПеременныеСеанса.Вставить(КлючПеременной, Результат);	
		Результат = КлючПеременной;
		
	Иначе
		OPI_ПреобразованиеТипов.ПолучитьСтроку(Результат);
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьКонтекст(Контекст, Знач ТекущееЗначение)
	
	OPI_ПреобразованиеТипов.ПолучитьСтроку(ТекущееЗначение);
	
	ЗначениеПеременной = ПеременныеСеанса.Получить(ТекущееЗначение);
	
	Если ЗначениеПеременной <> Неопределено Тогда
		Контекст.Вставить(ТекущееЗначение, ЗначениеПеременной);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти