// CLI: proxy

#Использовать "internal"
#Использовать "oint"

#Область СлужебныйПрограммныйИнтерфейс

// Разложить JSON на параметры
// Показывает значения, которые можно получить из переданного JSON и возвращает
// 
// Параметры:
//  JSON                           - Строка  - JSON данные                                                          - json
//  МаксимальныйУровеньВложенности - Число   - Ограничение на ур. вложенности разбора. На всю глубину по умолчанию  - nesting
//  ИмяПараметра                   - Строка  - Имя поля для получения. Выводит весь список, если не указано         - name 
//  Кодировка                      - Строка  - Кодировка, в которой записаны JSON данные                            - enc
// 
// Возвращаемое значение:
//  Строка - пустая строка
Функция Запустить(Знач Порт, Знач Проект, Знач Пароль) Экспорт

	OPI_ПреобразованиеТипов.ПолучитьЧисло(Порт);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Проект);
	OPI_ПреобразованиеТипов.ПолучитьСтроку(Пароль);

	ВебСервер  = Новый ВебСервер(Порт);
	Обработчик = Новый ОбработчикЗапросов();

	ВебСервер.ДобавитьОбработчикЗапросов(Обработчик, "ОсновнаяОбработка");
	ВебСервер.Запустить();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти