//Набор тестов для YAxUnit
//@skip-check undefined-variable

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
   
    ЮТТесты 
 		.ДобавитьТестовыйНабор("Телеграм")               								
            .ДобавитьСерверныйТест("Телеграм_ПолучитьИнформациюБота"      , "Получить информацию бота") 	
			.ДобавитьСерверныйТест("Телеграм_ПолучитьОбновления"          , "Получить обновления")
			.ДобавитьСерверныйТест("Телеграм_УстановитьWebhook"           , "Установить Webhook")
			.ДобавитьСерверныйТест("Телеграм_УдалитьWebhook"              , "Удалить Webhook")
			.ДобавитьСерверныйТест("Телеграм_ОтправитьТекстовоеСообщение" , "Отправить текстовое сообщение")
			.ДобавитьСерверныйТест("Телеграм_ОтправитьКартинку"           , "Отправить картинку")
			.ДобавитьСерверныйТест("Телеграм_ОтправитьВидео"              , "Отправить видео")
            .ДобавитьСерверныйТест("Телеграм_ОтправитьАудио"              , "Отправить аудио")
            .ДобавитьСерверныйТест("Телеграм_ОтправитьДокумент"           , "Отправить документ")
            .ДобавитьСерверныйТест("Телеграм_ОтправитьГифку"              , "Отправить гифку");

КонецПроцедуры

#Область Тесты

#Область Telegram

Процедура Телеграм_ПолучитьИнформациюБота() Экспорт

    Токен 		= ПолучитьПараметр("Телеграм_Токен");
	Результат 	= OPI_Telegram.ПолучитьИнформациюБота(Токен);
	
	ЮТест.ОжидаетЧто(Результат) 
        .ИмеетТип("Соответствие") 
        .Заполнено()
		.Свойство("ok").Равно(Истина)
		.Свойство("result.username").Заполнено();
		
КонецПроцедуры

Процедура Телеграм_ПолучитьОбновления() Экспорт
	
	Токен 		= ПолучитьПараметр("Телеграм_Токен");
	Результат 	= OPI_Telegram.ПолучитьОбновления(Токен);

	OPI_Telegram.УдалитьWebhook(Токен);
	
	ЮТест.ОжидаетЧто(Результат) 
		.ИмеетТип("Соответствие") 
		.Заполнено()
		.Свойство("ok").Равно(Истина)
		.Свойство("result").ИмеетТип(Тип("Массив"));

КонецПроцедуры

Процедура Телеграм_УстановитьWebhook() Экспорт
	
	Токен 		= ПолучитьПараметр("Телеграм_Токен");
	URL 		= ПолучитьПараметр("Телеграм_URL");

	Результат 	= OPI_Telegram.УстановитьWebhook(Токен, URL);

	ЮТест.ОжидаетЧто(Результат) 
		.ИмеетТип("Соответствие") 
		.Заполнено()
		.Свойство("ok").Равно(Истина)
		.Свойство("result").Равно(Истина)
		.Свойство("description").Равно("Webhook was set");
		
КонецПроцедуры
	
Процедура Телеграм_УдалитьWebhook() Экспорт
	
	Токен 		= ПолучитьПараметр("Телеграм_Токен");
	
	Результат 	= OPI_Telegram.УдалитьWebhook(Токен);
	
	ЮТест.ОжидаетЧто(Результат) 
		.ИмеетТип("Соответствие") 
		.Заполнено()
		.Свойство("ok").Равно(Истина)
		.Свойство("result").Равно(Истина)
		.Свойство("description").Равно("Webhook was deleted");
	                   
КонецПроцедуры

Процедура Телеграм_ОтправитьТекстовоеСообщение() Экспорт
	
	Токен  	 = ПолучитьПараметр("Телеграм_Токен");
	IDЧата 	 = ПолучитьПараметр("Телеграм_Чат");
	IDКанала = ПолучитьПараметр("Телеграм_Канал");
	Текст    = "Сообщение из автоматического теста";
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDЧата, Текст));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, IDКанала, Текст));
	
	Для Каждого Результат Из МассивРезультатов Цикл
		
		ЮТест.ОжидаетЧто(Результат) 
			.ИмеетТип("Соответствие") 
			.Заполнено()
			.Свойство("ok").Равно(Истина)
			.Свойство("result.text").Равно(Текст);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура Телеграм_ОтправитьКартинку() Экспорт
	
	Токен  	 = ПолучитьПараметр("Телеграм_Токен");
	IDЧата 	 = ПолучитьПараметр("Телеграм_Чат");
	IDКанала = ПолучитьПараметр("Телеграм_Канал");
	Текст    = "Сообщение из автоматического теста";
	Картинка = ПолучитьДвоичные("Картинка");
	ИВФ      = ПолучитьИмяВременногоФайла("png");
	Картинка.Записать(ИВФ);
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьКартинку(Токен, IDЧата  , Текст, Картинка));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьКартинку(Токен, IDКанала, Текст, Картинка));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьКартинку(Токен, IDЧата  , Текст, ИВФ));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьКартинку(Токен, IDКанала, Текст, ИВФ));
	
	Для Каждого Результат Из МассивРезультатов Цикл

		ЮТест.ОжидаетЧто(Результат) 
			.ИмеетТип("Соответствие") 
			.Заполнено()
			.Свойство("ok").Равно(Истина)
			.Свойство("result.caption").Равно(Текст)
			.Свойство("result.photo").ИмеетТип(Тип("Массив"));
		
	КонецЦикла;
	
	УдалитьФайлы(ИВФ);
	
КонецПроцедуры

Процедура Телеграм_ОтправитьВидео() Экспорт
	
	Токен  	 = ПолучитьПараметр("Телеграм_Токен");
	IDЧата 	 = ПолучитьПараметр("Телеграм_Чат");
	IDКанала = ПолучитьПараметр("Телеграм_Канал");
	Текст    = "Сообщение из автоматического теста";
	Картинка = ПолучитьДвоичные("Видео");
	ИВФ      = ПолучитьИмяВременногоФайла("mp4");
	Картинка.Записать(ИВФ);
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьВидео(Токен, IDЧата  , Текст, Картинка));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьВидео(Токен, IDКанала, Текст, Картинка));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьВидео(Токен, IDЧата  , Текст, ИВФ));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьВидео(Токен, IDКанала, Текст, ИВФ));
	
	Для Каждого Результат Из МассивРезультатов Цикл

		//@skip-warning
		ЮТест.ОжидаетЧто(Результат) 
			.ИмеетТип("Соответствие") 
			.Заполнено()
			.Свойство("ok").Равно(Истина)
			.Свойство("result.caption").Равно(Текст)
			.Свойство("result.video.mime_type").Равно("video/mp4");
		
	КонецЦикла;
	
	УдалитьФайлы(ИВФ);
	
КонецПроцедуры

Процедура Телеграм_ОтправитьАудио() Экспорт
	
	Токен  	 = ПолучитьПараметр("Телеграм_Токен");
	IDЧата 	 = ПолучитьПараметр("Телеграм_Чат");
	IDКанала = ПолучитьПараметр("Телеграм_Канал");
	Текст    = "Сообщение из автоматического теста";
	Аудио    = ПолучитьДвоичные("Аудио");
	ИВФ      = ПолучитьИмяВременногоФайла("mp3");
	Аудио.Записать(ИВФ);
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьАудио(Токен, IDЧата  , Текст, Аудио));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьАудио(Токен, IDКанала, Текст, Аудио));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьАудио(Токен, IDЧата  , Текст, ИВФ));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьАудио(Токен, IDКанала, Текст, ИВФ));
	
	Для Каждого Результат Из МассивРезультатов Цикл

		ЮТест.ОжидаетЧто(Результат) 
			.ИмеетТип("Соответствие") 
			.Заполнено()
			.Свойство("ok").Равно(Истина)
			.Свойство("result.caption").Равно(Текст)
			.Свойство("result.audio.mime_type").Равно("audio/mpeg");
		
	КонецЦикла;
	
	УдалитьФайлы(ИВФ);
	
КонецПроцедуры

Процедура Телеграм_ОтправитьДокумент() Экспорт
	
	Токен  	 = ПолучитьПараметр("Телеграм_Токен");
	IDЧата 	 = ПолучитьПараметр("Телеграм_Чат");
	IDКанала = ПолучитьПараметр("Телеграм_Канал");
	Текст    = "Сообщение из автоматического теста";
	Документ = ПолучитьДвоичные("Документ");
	ИВФ      = ПолучитьИмяВременногоФайла("docx");
	Документ.Записать(ИВФ);
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьДокумент(Токен, IDЧата  , Текст, Документ));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьДокумент(Токен, IDКанала, Текст, Документ));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьДокумент(Токен, IDЧата  , Текст, ИВФ));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьДокумент(Токен, IDКанала, Текст, ИВФ));
	
	Для Каждого Результат Из МассивРезультатов Цикл

		ЮТест.ОжидаетЧто(Результат) 
			.ИмеетТип("Соответствие") 
			.Заполнено()
			.Свойство("ok").Равно(Истина)
			.Свойство("result.caption").Равно(Текст)
			.Свойство("result.document").ИмеетТип("Соответствие").Заполнено();
		
	КонецЦикла;
	
	УдалитьФайлы(ИВФ);
	
КонецПроцедуры

Процедура Телеграм_ОтправитьГифку() Экспорт
	
	Токен  	 = ПолучитьПараметр("Телеграм_Токен");
	IDЧата 	 = ПолучитьПараметр("Телеграм_Чат");
	IDКанала = ПолучитьПараметр("Телеграм_Канал");
	Текст    = "Сообщение из автоматического теста";
	Гифка    = ПолучитьДвоичные("Гифка");
	ИВФ      = ПолучитьИмяВременногоФайла("gif");
	Гифка.Записать(ИВФ);
	
	МассивРезультатов = Новый Массив;
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьГифку(Токен, IDЧата  , Текст, Гифка));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьГифку(Токен, IDКанала, Текст, Гифка));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьГифку(Токен, IDЧата  , Текст, ИВФ));
	МассивРезультатов.Добавить(OPI_Telegram.ОтправитьГифку(Токен, IDКанала, Текст, ИВФ));
	
	Для Каждого Результат Из МассивРезультатов Цикл

		ЮТест.ОжидаетЧто(Результат) 
			.ИмеетТип("Соответствие") 
			.Заполнено()
			.Свойство("ok").Равно(Истина)
			.Свойство("result.caption").Равно(Текст)
            .Свойство("result.document").ИмеетТип("Соответствие").Заполнено()
			.Свойство("result.animation.mime_type").Равно("video/mp4");
		
	КонецЦикла;
	
	УдалитьФайлы(ИВФ);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметр(Параметр) 

	ИмяСправочника  = "ЮТПараметры";
	ИмяРеквизита    = "Значение";
	
	Возврат ПолучитьЗначение(Параметр, ИмяСправочника, ИмяРеквизита);

КонецФункции

Функция ПолучитьДвоичные(Имя)
	
	ИмяСправочника  = "ЮТФайлы";
	ИмяРеквизита    = "Значение";

	Возврат ПолучитьЗначение(Имя, ИмяСправочника, ИмяРеквизита);
	
КонецФункции

Функция ПолучитьЗначение(Параметр, ИмяСправочника, ИмяРеквизита) 
		
	ЭлементСпр = Справочники[ИмяСправочника].НайтиПоНаименованию(Параметр);
	Значение   = ЭлементСпр[ИмяРеквизита];
	
	Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
		Значение = Значение.Получить();
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура ЗаписатьПараметр(Параметр, Значение)
	                
	ИмяСправочника  = "ЮТПараметры";
	ИмяРеквизита    = "Значение";
	
	ЭлементСпр = Справочники[ИмяСправочника].НайтиПоНаименованию(Параметр);
	ОбъектСпр  = ЭлементСпр.ПолучитьОбъект();
	
	ОбъектСпр[ИмяРеквизита] = Значение; 
	ОбъектСпр.Записать();
	
КонецПроцедуры

#КонецОбласти
