// OneScript: ./OInt/tests/Modules/OPItc_MySQL.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

//#Использовать "../../tools/main"
//#Использовать "../../tools/http"
//#Использовать "../../api"
//#Использовать asserts
//#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯксCLI("MySQL");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("MySQL");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область MySQL

Процедура MYS_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровMySQL();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        MySQL_СформироватьСтрокуПодключения(ПараметрыТеста);
        MySQL_ОткрытьСоединение(ПараметрыТеста);
        MySQL_ЗакрытьСоединение(ПараметрыТеста);
        MySQL_ЭтоКоннектор(ПараметрыТеста);
        MySQL_ВыполнитьЗапросSQL(ПараметрыТеста);
        MySQL_ПолучитьНастройкиTLS(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура MYS_ORM() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровMySQL();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        MySQL_СоздатьБазуДанных(ПараметрыТеста);
        MySQL_СоздатьТаблицу(ПараметрыТеста);
        MySQL_ДобавитьЗаписи(ПараметрыТеста);
        MySQL_ГарантироватьЗаписи(ПараметрыТеста);
        MySQL_ПолучитьЗаписи(ПараметрыТеста);
        MySQL_ОбновитьЗаписи(ПараметрыТеста);
        MySQL_УдалитьЗаписи(ПараметрыТеста);
        MySQL_ОчиститьТаблицу(ПараметрыТеста);
        MySQL_ПолучитьИнформациюОТаблице(ПараметрыТеста);
        MySQL_ДобавитьКолонкуТаблицы(ПараметрыТеста);
        MySQL_УдалитьКолонкуТаблицы(ПараметрыТеста);
        MySQL_ГарантироватьТаблицу(ПараметрыТеста);
        MySQL_УдалитьТаблицу(ПараметрыТеста);
        MySQL_УдалитьБазуДанных(ПараметрыТеста);
        MySQL_ПолучитьСтруктуруФильтраЗаписей(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

#КонецОбласти // MySQL

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область MySQL

Процедура MySQL_СформироватьСтрокуПодключения(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    // END

    Результат = СтрЗаменить(Результат, Пароль, "***");
    Результат = СтрЗаменить(Результат, Адрес , "127.0.0.1");

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "СформироватьСтрокуПодключения");

КонецПроцедуры

Процедура MySQL_ОткрытьСоединение(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Результат = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    // END

    OPI_MySQL.ЗакрытьСоединение(Результат);
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ОткрытьСоединение");

КонецПроцедуры

Процедура MySQL_ЗакрытьСоединение(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);
    Результат  = OPI_MySQL.ЗакрытьСоединение(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ЗакрытьСоединение");

КонецПроцедуры

Процедура MySQL_ЭтоКоннектор(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);
    Результат  = OPI_MySQL.ЭтоКоннектор(Соединение);

    OPI_MySQL.ЗакрытьСоединение(Результат);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ЭтоКоннектор");

КонецПроцедуры

Процедура MySQL_ВыполнитьЗапросSQL(ПараметрыФункции)

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Соединение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    OPI_MySQL.УдалитьТаблицу("users"     , Соединение);                    // SKIP
    OPI_MySQL.УдалитьТаблицу("test_data" , Соединение);                    // SKIP
    OPI_MySQL.УдалитьТаблицу("test_table", Соединение);                   // SKIP

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Соединение, "MySQL", "ВыполнитьЗапросSQL", "Соединение");  // SKIP

    // CREATE

    ТекстЗапроса = "
                   |CREATE TABLE test_table (
                   |id INT AUTO_INCREMENT PRIMARY KEY,
                   |name VARCHAR(255),
                   |age INT,
                   |salary DOUBLE,
                   |amount FLOAT,
                   |type TINYINT UNSIGNED,
                   |date DATE,
                   |time TIME,
                   |data MEDIUMBLOB
                   |);";

    Опции = Новый Структура;
    Опции.Вставить("sql", ТекстЗапроса);
    Опции.Вставить("dbc", Соединение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ВыполнитьЗапросSQL", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ВыполнитьЗапросSQL", "Create");  // SKIP

    // INSERT с параметрами

    ТекстЗапроса = "
                   |INSERT INTO test_table (name, age, salary, amount, type, date, time, data)
                   |VALUES (?, ?, ?, ?, ?, ?, ?, ?);";

    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(Новый Структура("TEXT"  , "Vitaly"));
    МассивПараметров.Добавить(Новый Структура("INT"   , 25));
    МассивПараметров.Добавить(Новый Структура("DOUBLE", 1000.12));
    МассивПараметров.Добавить(Новый Структура("FLOAT" , 1000.12));
    МассивПараметров.Добавить(Новый Структура("UINT"  , 1));
    МассивПараметров.Добавить(Новый Структура("DATE"  , OPI_Инструменты.ПолучитьТекущуюДату()));
    МассивПараметров.Добавить(Новый Структура("TIME"  , OPI_Инструменты.ПолучитьТекущуюДату()));
    МассивПараметров.Добавить(Новый Структура("BYTES" , Картинка));

    Опции = Новый Структура;
    Опции.Вставить("sql", ТекстЗапроса);
    Опции.Вставить("params", МассивПараметров);
    Опции.Вставить("dbc", Соединение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ВыполнитьЗапросSQL", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ВыполнитьЗапросSQL", "Insert");  // SKIP

    // SELECT (Результат этого запроса приведен в следующем блоке)

    ТекстЗапроса = "SELECT name, age, salary, amount, type, date, time, data FROM test_table;";

    Опции = Новый Структура;
    Опции.Вставить("sql", ТекстЗапроса);
    Опции.Вставить("dbc", Соединение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ВыполнитьЗапросSQL", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ВыполнитьЗапросSQL", , Картинка);  // SKIP

    Результат = OPI_MySQL.ВыполнитьЗапросSQL("create table test_data (id INT,first_name VARCHAR(50),last_name VARCHAR(50),email VARCHAR(50),gender VARCHAR(50),ip_address VARCHAR(20));",  , , Соединение); // SKIP
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ВыполнитьЗапросSQL", "Test data");  // SKIP

    // SQL запрос из файла

    ФайлSQL = ПараметрыФункции["SQL2"]; // Двоичные данные, URL или путь к файлу

    Опции = Новый Структура;
    Опции.Вставить("sql", ФайлSQL);
    Опции.Вставить("dbc", Соединение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ВыполнитьЗапросSQL", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ВыполнитьЗапросSQL", "Файл");  // SKIP

    Закрытие = OPI_MySQL.ЗакрытьСоединение(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Закрытие, "MySQL", "ВыполнитьЗапросSQL", "Закрытие");  // SKIP

КонецПроцедуры

Процедура MySQL_СоздатьБазуДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    База = "testbase1";

    OPI_MySQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("base", База);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СоздатьБазуДанных", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "СоздатьБазуДанных");

    База = "testbase2";
    OPI_MySQL.УдалитьБазуДанных(База, СтрокаПодключения, НастройкиTLS);

    Подключение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Подключение, "MySQL", "СоздатьБазуДанных", "Открытие");

    Опции = Новый Структура;
    Опции.Вставить("base", База);
    Опции.Вставить("dbc", Подключение);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СоздатьБазуДанных", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "СоздатьБазуДанных", "Создание");

    Опции = Новый Структура;
    Опции.Вставить("base", База);
    Опции.Вставить("dbc", Подключение);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СоздатьБазуДанных", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "СоздатьБазуДанных", "Существующая");

    OPI_MySQL.ЗакрытьСоединение(Подключение);

КонецПроцедуры

Процедура MySQL_СоздатьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("char_field"      , "CHAR(5)");
    СтруктураКолонок.Вставить("varchar_field"   , "VARCHAR(255)");
    СтруктураКолонок.Вставить("tinytext_field"  , "TINYTEXT");
    СтруктураКолонок.Вставить("text_field"      , "TEXT");
    СтруктураКолонок.Вставить("mediumtext_field", "MEDIUMTEXT");
    СтруктураКолонок.Вставить("longtext_field"  , "LONGTEXT");
    СтруктураКолонок.Вставить("tinyint_field"   , "TINYINT");
    СтруктураКолонок.Вставить("smallint_field"  , "SMALLINT");
    СтруктураКолонок.Вставить("mediumint_field" , "MEDIUMINT");
    СтруктураКолонок.Вставить("int_field"       , "INT");
    СтруктураКолонок.Вставить("uint_field"      , "INT UNSIGNED");
    СтруктураКолонок.Вставить("bigint_field"    , "BIGINT");
    СтруктураКолонок.Вставить("float_field"     , "FLOAT");
    СтруктураКолонок.Вставить("double_field"    , "DOUBLE");
    СтруктураКолонок.Вставить("date_field"      , "DATE");
    СтруктураКолонок.Вставить("time_field"      , "TIME");
    СтруктураКолонок.Вставить("datetime_field"  , "DATETIME");
    СтруктураКолонок.Вставить("timestamp_field" , "TIMESTAMP");
    СтруктураКолонок.Вставить("mediumblob_field", "MEDIUMBLOB");
    СтруктураКолонок.Вставить("set_field"       , "SET('one','two','three')");

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("cols", СтруктураКолонок);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СоздатьТаблицу", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "СоздатьТаблицу");

    Таблица = "АБВ ГДЕ";

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("cols", СтруктураКолонок);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СоздатьТаблицу", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "СоздатьТаблицу", "Ошибка имени");

    Таблица = "somename";
    СтруктураКолонок.Вставить("wtf_field", "WTF");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("cols", СтруктураКолонок);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СоздатьТаблицу", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "СоздатьТаблицу", "Ошибка типа");

КонецПроцедуры

Процедура MySQL_ДобавитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица       = "testtable";
    МассивЗаписей = Новый Массив;

    Картинка = ПараметрыФункции["Picture"];
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // Картинка - Тип: ДвоичныеДанные

    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();

    СтруктураЗаписи = Новый Структура;
    СтруктураЗаписи.Вставить("char_field"      , Новый Структура("TEXT"  , "AAAAA"));
    СтруктураЗаписи.Вставить("varchar_field"   , Новый Структура("TEXT"  , "Some varchar"));
    СтруктураЗаписи.Вставить("tinytext_field"  , Новый Структура("TEXT"  , "Some tiny text"));
    СтруктураЗаписи.Вставить("text_field"      , Новый Структура("TEXT"  , "Some text"));
    СтруктураЗаписи.Вставить("mediumtext_field", Новый Структура("TEXT"  , "Some medium text"));
    СтруктураЗаписи.Вставить("longtext_field"  , Новый Структура("TEXT"  , "Some looooooong text"));
    СтруктураЗаписи.Вставить("tinyint_field"   , Новый Структура("INT"   , 127));
    СтруктураЗаписи.Вставить("smallint_field"  , Новый Структура("INT"   , -32767));
    СтруктураЗаписи.Вставить("mediumint_field" , Новый Структура("INT"   , 8388607));
    СтруктураЗаписи.Вставить("int_field"       , Новый Структура("INT"   , -2147483647));
    СтруктураЗаписи.Вставить("uint_field"      , Новый Структура("UINT"  , 4294967295));
    СтруктураЗаписи.Вставить("bigint_field"    , Новый Структура("INT"   , 9223372036854775807));
    СтруктураЗаписи.Вставить("float_field"     , Новый Структура("FLOAT" , 100.50));
    СтруктураЗаписи.Вставить("double_field"    , Новый Структура("FLOAT" , 100.512123));
    СтруктураЗаписи.Вставить("date_field"      , Новый Структура("DATE"  , ТекущаяДата));
    СтруктураЗаписи.Вставить("time_field"      , Новый Структура("TIME"  , ТекущаяДата));
    СтруктураЗаписи.Вставить("datetime_field"  , Новый Структура("DATE"  , ТекущаяДата));
    СтруктураЗаписи.Вставить("timestamp_field" , Новый Структура("DATE"  , ТекущаяДата));
    СтруктураЗаписи.Вставить("mediumblob_field", Новый Структура("BYTES" , Картинка));
    СтруктураЗаписи.Вставить("set_field"       , Новый Структура("TEXT"  , "one"));

    МассивЗаписей.Добавить(СтруктураЗаписи);

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("rows", МассивЗаписей);
    Опции.Вставить("trn", Истина);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ДобавитьЗаписи", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ДобавитьЗаписи");

КонецПроцедуры

Процедура MySQL_ПолучитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    // Все записи без отборов

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьЗаписи", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ПолучитьЗаписи"); // SKIP

    // Отборы, выбранные поля, количество и сортировка

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", "test_data");
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Таблица = "test_data";

    Поля = Новый Массив;
    Поля.Добавить("first_name");
    Поля.Добавить("last_name");
    Поля.Добавить("email");

    Фильтры = Новый Массив;

    СтруктураФильтра1 = Новый Структура;

    СтруктураФильтра1.Вставить("field", "gender");
    СтруктураФильтра1.Вставить("type" , "=");
    СтруктураФильтра1.Вставить("value", "Male");
    СтруктураФильтра1.Вставить("union", "AND");
    СтруктураФильтра1.Вставить("raw"  , Ложь);

    СтруктураФильтра2 = Новый Структура;

    СтруктураФильтра2.Вставить("field", "id");
    СтруктураФильтра2.Вставить("type" , "BETWEEN");
    СтруктураФильтра2.Вставить("value", "20 AND 50");
    СтруктураФильтра2.Вставить("raw"  , Истина);

    Фильтры.Добавить(СтруктураФильтра1);
    Фильтры.Добавить(СтруктураФильтра2);

    Сортировка = Новый Структура("ip_address", "DESC");
    Количество = 5;

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("fields", Поля);
    Опции.Вставить("filter", Фильтры);
    Опции.Вставить("order", Сортировка);
    Опции.Вставить("limit", Количество);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьЗаписи", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ПолучитьЗаписи", "Отборы");

КонецПроцедуры

Процедура MySQL_ОбновитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "test_data";

    СтруктураПолей = Новый Структура;
    СтруктураПолей.Вставить("ip_address", Новый Структура("VARCHAR", "127.0.0.1"));

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "gender");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "Male"));
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Фильтры.Добавить(СтруктураФильтра);

    Количество = OPI_MySQL.ПолучитьЗаписи(Таблица, , Фильтры, , , СтрокаПодключения, НастройкиTLS); // SKIP
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Количество, "MySQL", "ОбновитьЗаписи", "Количество");                                // SKIP
    Количество = Количество["data"].Количество();                                                   // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("values", СтруктураПолей);
    Опции.Вставить("filter", СтруктураФильтра);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ОбновитьЗаписи", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ОбновитьЗаписи");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("fields", "['ip_address']");
    Опции.Вставить("filter", Фильтры);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьЗаписи", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Проверка, "MySQL", "ОбновитьЗаписи", "Проверка", Количество, СтруктураПолей);

КонецПроцедуры

Процедура MySQL_УдалитьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "test_data";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "test_data";

    Фильтры = Новый Массив;

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "gender");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "Male"));
    СтруктураФильтра.Вставить("raw"  , Ложь);
    СтруктураФильтра.Вставить("union", "AND");

    Фильтры.Добавить(СтруктураФильтра);

    СтруктураФильтра = Новый Структура;

    СтруктураФильтра.Вставить("field", "ip_address");
    СтруктураФильтра.Вставить("type" , "=");
    СтруктураФильтра.Вставить("value", Новый Структура("VARCHAR", "127.0.0.1"));
    СтруктураФильтра.Вставить("raw"  , Ложь);

    Получение = OPI_MySQL.ПолучитьЗаписи(Таблица, , Фильтры, , , СтрокаПодключения, НастройкиTLS); // SKIP

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("filter", Фильтры);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "УдалитьЗаписи", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Получение, "MySQL", "УдалитьЗаписи", "Получение");

    Количество = Получение["data"].Количество();
    Остаток    = 100 - Количество;

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьЗаписи");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьЗаписи", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьЗаписи", "Проверка", Остаток);

КонецПроцедуры

Процедура MySQL_УдалитьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "УдалитьТаблицу", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьТаблицу");

    База    = "test_data";
    Таблица = "test_data";

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "УдалитьТаблицу", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьТаблицу", "Тест");

КонецПроцедуры

Процедура MySQL_УдалитьБазуДанных(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    База = "testbase1";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("base", База);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "УдалитьБазуДанных", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьБазуДанных");

    База = "testbase2";

    Подключение = OPI_MySQL.ОткрытьСоединение(СтрокаПодключения, НастройкиTLS);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Подключение, "MySQL", "УдалитьБазуДанных", "Открытие");

    Опции = Новый Структура;
    Опции.Вставить("base", База);
    Опции.Вставить("dbc", Подключение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "УдалитьБазуДанных", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьБазуДанных", "Удаление");

    Опции = Новый Структура;
    Опции.Вставить("base", База);
    Опции.Вставить("dbc", Подключение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "УдалитьБазуДанных", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьБазуДанных", "Ошибка");

    Закрытие = OPI_MySQL.ЗакрытьСоединение(Подключение);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Закрытие, "MySQL", "УдалитьБазуДанных", "Закрытие");

    Опции = Новый Структура;
    Опции.Вставить("base", База);
    Опции.Вставить("dbc", Подключение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "УдалитьБазуДанных", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьБазуДанных", "Ошибка подключения");

КонецПроцедуры

Процедура MySQL_ОчиститьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ОчиститьТаблицу", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ОчиститьТаблицу");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьЗаписи", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ОчиститьТаблицу", "Проверка");

КонецПроцедуры

Процедура MySQL_ГарантироватьЗаписи(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "test_merge";

    СтруктураКолонок = Новый Структура;                     // SKIP
    СтруктураКолонок.Вставить("id"    , "INT PRIMARY KEY"); // SKIP
    СтруктураКолонок.Вставить("name"  , "TEXT");            // SKIP
    СтруктураКолонок.Вставить("age"   , "INT");             // SKIP
    СтруктураКолонок.Вставить("salary", "DOUBLE");          // SKIP
    OPI_MySQL.СоздатьТаблицу(Таблица, СтруктураКолонок, СтрокаПодключения, НастройкиTLS); // SKIP

    МассивДанных = Новый Массив;

    СтруктураСтроки1 = Новый Структура;
    СтруктураСтроки1.Вставить("id"    , Новый Структура("INT"   , 1));
    СтруктураСтроки1.Вставить("name"  , Новый Структура("TEXT"  , "Vitaly"));
    СтруктураСтроки1.Вставить("age"   , Новый Структура("INT"   , 25));
    СтруктураСтроки1.Вставить("salary", Новый Структура("DOUBLE", 1000.12));

    СтруктураСтроки2 = Новый Структура;
    СтруктураСтроки2.Вставить("id"    , Новый Структура("INT"   , 2));
    СтруктураСтроки2.Вставить("name"  , Новый Структура("TEXT"  , "Lesha"));
    СтруктураСтроки2.Вставить("age"   , Новый Структура("INT"   , 20));
    СтруктураСтроки2.Вставить("salary", Новый Структура("DOUBLE", 200.20));

    МассивДанных.Добавить(СтруктураСтроки1);
    МассивДанных.Добавить(СтруктураСтроки2);

    КлючевыеПоля = Новый Массив;
    КлючевыеПоля.Добавить("id");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("rows", МассивДанных);
    Опции.Вставить("db", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ГарантироватьЗаписи", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ГарантироватьЗаписи", "Вставка");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("fields", "*");
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьЗаписи", Опции);
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Проверка, "MySQL", "ГарантироватьЗаписи", "Проверка вставки");

    СтруктураСтроки1.Вставить("name"  , Новый Структура("TEXT"  , "Vitaly Updated"));
    СтруктураСтроки1.Вставить("salary", Новый Структура("DOUBLE", 1500.50));

    СтруктураСтроки3 = Новый Структура;
    СтруктураСтроки3.Вставить("id"    , Новый Структура("INT"   , 3));
    СтруктураСтроки3.Вставить("name"  , Новый Структура("TEXT"  , "Anton"));
    СтруктураСтроки3.Вставить("age"   , Новый Структура("INT"   , 30));
    СтруктураСтроки3.Вставить("salary", Новый Структура("DOUBLE", 3000.00));

    МассивДанных = Новый Массив;
    МассивДанных.Добавить(СтруктураСтроки1);
    МассивДанных.Добавить(СтруктураСтроки3);

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("rows", МассивДанных);
    Опции.Вставить("db", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ГарантироватьЗаписи", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ГарантироватьЗаписи", "Обновление");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("fields", "*");
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьЗаписи", Опции);
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Проверка, "MySQL", "ГарантироватьЗаписи", "Проверка обновления");

    OPI_MySQL.УдалитьТаблицу(Таблица, СтрокаПодключения, НастройкиTLS);

КонецПроцедуры

Процедура MySQL_ПолучитьСтруктуруФильтраЗаписей(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьСтруктуруФильтраЗаписей", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ПолучитьСтруктуруФильтраЗаписей");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьСтруктуруФильтраЗаписей", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ПолучитьСтруктуруФильтраЗаписей", "Пустая");

КонецПроцедуры

Процедура MySQL_ПолучитьНастройкиTLS(ПараметрыФункции)

    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ПолучитьНастройкиTLS");

КонецПроцедуры

Процедура MySQL_ПолучитьИнформациюОТаблице(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьИнформациюОТаблице", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ПолучитьИнформациюОТаблице");

    Таблица = "heyho";

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьИнформациюОТаблице", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ПолучитьИнформациюОТаблице", "Ошибка");

КонецПроцедуры

Процедура MySQL_ДобавитьКолонкуТаблицы(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица   = "testtable";
    Имя       = "new_field";
    ТипДанных = "MEDIUMTEXT";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("name", Имя);
    Опции.Вставить("type", ТипДанных);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ДобавитьКолонкуТаблицы", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ДобавитьКолонкуТаблицы");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьИнформациюОТаблице", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ДобавитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура MySQL_УдалитьКолонкуТаблицы(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";
    Имя     = "new_field";

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("name", Имя);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "УдалитьКолонкуТаблицы", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьКолонкуТаблицы");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьИнформациюОТаблице", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "УдалитьКолонкуТаблицы", "Проверка");

КонецПроцедуры

Процедура MySQL_ГарантироватьТаблицу(ПараметрыФункции)

    Адрес  = ПараметрыФункции["PG_IP"];
    Логин  = "bayselonarrend";
    Пароль = ПараметрыФункции["PG_Password"];
    База   = "testbase1";

    TLS = Истина;
    TLS = ПараметрыФункции["TLS"]; // SKIP

    Порт = 3306;
    Порт = ?(TLS, 3307, 3306); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("db", База);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("port", Порт);

    СтрокаПодключения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "СформироватьСтрокуПодключения", Опции);

    Если TLS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьНастройкиTLS", Опции);
    Иначе
        НастройкиTLS = Неопределено;
    КонецЕсли;

    Таблица = "testtable";

    СтруктураКолонок = Новый Структура;
    СтруктураКолонок.Вставить("smallint_field" , "SMALLINT");
    СтруктураКолонок.Вставить("double_field"   , "DOUBLE");
    СтруктураКолонок.Вставить("bigint_field"   , "BIGINT");
    СтруктураКолонок.Вставить("custom_field"   , "TEXT");

    // При использовании строки подключения инициализируется новое соединение,
    // которое будет закрыто после выполнения функции.
    // В случае выполнения нескольких операций желательно использовать одно соединение,
    // заранее созданное функцией ОткрытьСоединение()
    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("cols", СтруктураКолонок);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ГарантироватьТаблицу", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ГарантироватьТаблицу");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьИнформациюОТаблице", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Проверка, "MySQL", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

    Таблица = "test_new";

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("cols", СтруктураКолонок);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ГарантироватьТаблицу", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "MySQL", "ГарантироватьТаблицу", "Новая");

    Опции = Новый Структура;
    Опции.Вставить("table", Таблица);
    Опции.Вставить("dbc", СтрокаПодключения);
    Опции.Вставить("tls", НастройкиTLS);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("mysql", "ПолучитьИнформациюОТаблице", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Проверка, "MySQL", "ГарантироватьТаблицу", "Проверка", СтруктураКолонок);

КонецПроцедуры

#КонецОбласти // MySQL

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure MYS_CommonMethods() Export
    MYS_ОсновныеМетоды();
EndProcedure

#EndRegion
