Перем СоответствиеТаблицПараметров;
Перем СоответствиеКомандМодулей;

Процедура ПриСозданииОбъекта()
    
    СоответствиеТаблицПараметров = Новый Соответствие();
    СоответствиеКомандМодулей = Новый Соответствие();
    СоответствиеКомандМодулей.Вставить("telegram", "OPI_Telegram");
    
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьИмяМодуля(Знач ИмяКоманды = "") Экспорт
    
    Если ЗначениеЗаполнено(ИмяКоманды) Тогда
        Результат = СоответствиеКомандМодулей.Получить(ИмяКоманды);
    Иначе
        Результат = СоответствиеКомандМодулей;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(Результат) Тогда
        ВызватьИсключение "Неизвестная команда: " + ИмяКоманды;
    Иначе
        Возврат Результат;
    КонецЕсли;
    
КонецФункции

Функция ПолучитьТаблицуПараметров(Знач ИмяКоманды) Экспорт
    
    ТПМ = СоответствиеТаблицПараметров.Получить(ИмяКоманды);
    
    Если ТПМ = Неопределено Тогда
        
        ТПМ = Новый ТаблицаЗначений();
        
        ТПМ.Колонки.Добавить("Метод");
        ТПМ.Колонки.Добавить("МетодПоиска");
        ТПМ.Колонки.Добавить("Параметр");
        ТПМ.Колонки.Добавить("Описание");
        ТПМ.Колонки.Добавить("ВариантОбработки");
        
        Попытка
            Выполнить("ЗаполнитьТаблицуПараметров" + ИмяКоманды + "(ТПМ);");
        Исключение
            ВызватьИсключение "Неизвестная команда: " + ИмяКоманды;
        КонецПопытки;
        
        СоответствиеТаблицПараметров.Вставить(ИмяКоманды, ТПМ);
        
    КонецЕсли;
    
    Возврат ТПМ;
    
КонецФункции

Процедура ЗаполнитьТаблицуПараметровTelegram(ТПМ) Экспорт
    
    ДобавитьПараметрМетода(ТПМ, "ПолучитьИнформациюБота"     , "--token", "Токен бота");
    
    ДобавитьПараметрМетода(ТПМ, "ПолучитьОбновления"         , "--token", "Токен бота");
    
    ДобавитьПараметрМетода(ТПМ, "УстановитьWebhook"          , "--token", "Токен бота");
    ДобавитьПараметрМетода(ТПМ, "УстановитьWebhook"          , "--url", "Адрес обработки запросов (с https://)");
    
    ДобавитьПараметрМетода(ТПМ, "УдалитьWebHook"             , "--token", "Токен бота");
    
    ДобавитьПараметрМетода(ТПМ, "ОтправитьТекстовоеСообщение", "--token", "Токен бота");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьТекстовоеСообщение", "--id", "ID чата / ID чата*ID темы");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьТекстовоеСообщение", "--text", "Текст сообщения");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьТекстовоеСообщение", "--keyboard", "JSON клавиатуры / файл .json клавиатуры (необяз.)", "ОбработатьПараметрТекст");
    
    ДобавитьПараметрМетода(ТПМ, "ОтправитьКартинку"          , "--token", "Токен бота");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьКартинку"          , "--id", "ID чата / ID чата*ID темы");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьКартинку"          , "--text", "Текст сообщения");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьКартинку"          , "--path", "Путь к файлу");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьКартинку"          , "--keyboard", "JSON клавиатуры / файл .json клавиатуры (необяз.)", "ОбработатьПараметрТекст");
    
    ДобавитьПараметрМетода(ТПМ, "ОтправитьВидео"             , "--token", "Токен бота");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьВидео"             , "--id", "ID чата / ID чата*ID темы");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьВидео"             , "--text", "Текст сообщения");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьВидео"             , "--path", "Путь к файлу");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьВидео"             , "--keyboard", "JSON клавиатуры / файл .json клавиатуры (необяз.)", "ОбработатьПараметрТекст");
    
    ДобавитьПараметрМетода(ТПМ, "ОтправитьГифку"             , "--token", "Токен бота");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьГифку"             , "--id", "ID чата / ID чата*ID темы");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьГифку"             , "--text", "Текст сообщения");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьГифку"             , "--path", "Путь к файлу");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьГифку"             , "--keyboard", "JSON клавиатуры / файл .json клавиатуры (необяз.)", "ОбработатьПараметрТекст");
    
    ДобавитьПараметрМетода(ТПМ, "ОтправитьАудио"             , "--token", "Токен бота");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьАудио"             , "--id", "ID чата / ID чата*ID темы");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьАудио"             , "--text", "Текст сообщения");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьАудио"             , "--path", "Путь к файлу");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьАудио"             , "--keyboard", "JSON клавиатуры / файл .json клавиатуры (необяз.)", "ОбработатьПараметрТекст");
    
    ДобавитьПараметрМетода(ТПМ, "ОтправитьДокумент"          , "--token", "Токен бота");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьДокумент"          , "--id", "ID чата / ID чата*ID темы");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьДокумент"          , "--text", "Текст сообщения");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьДокумент"          , "--path", "Путь к файлу");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьДокумент"          , "--keyboard", "JSON клавиатуры / файл .json клавиатуры (необяз.)", "ОбработатьПараметрТекст");
    
	ОписаниеПараметра = "Путь к JSON-файлу описания медиагруппы:
	    |
	    |{
		|""Путь к файлу"": ""Тип медиа"",
		|...
		|}
		|
		|Возможные типы медиа: audio, document, photo, video
		|";

	ДобавитьПараметрМетода(ТПМ, "ОтправитьМедиагруппу"       , "--token", "Токен бота");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьМедиагруппу"       , "--id", "ID чата / ID чата*ID темы");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьМедиагруппу"       , "--text", "Текст сообщения");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьМедиагруппу"       , "--path", ОписаниеПараметра, "СоответствиеJSON");
    ДобавитьПараметрМетода(ТПМ, "ОтправитьМедиагруппу"       , "--keyboard", "JSON клавиатуры / файл .json клавиатуры (необяз.)", "ОбработатьПараметрТекст");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПараметрМетода(Таблица
        , Знач Метод
        , Знач Параметр
        , Знач Описание
        , Знач ВариантОбработки = "Строка")
    
    НовыйПараметр = Таблица.Добавить();
    НовыйПараметр.МетодПоиска      = вРег(Метод);
    НовыйПараметр.Метод            = Метод;
    НовыйПараметр.Параметр         = Параметр;
    НовыйПараметр.Описание         = Описание;
    НовыйПараметр.ВариантОбработки = ВариантОбработки;
    
КонецПроцедуры

#КонецОбласти

ПриСозданииОбъекта();