#Использовать "../../data"

Перем СоответствиеТаблицПараметров Экспорт;
Перем СоответствиеКомандМодулей Экспорт;
Перем Версия Экспорт;

Процедура ПриСозданииОбъекта()
    
    СоответствиеТаблицПараметров = Новый Соответствие();
    СоответствиеКомандМодулей    = Новый Соответствие();

    Версия                       = СоставБиблиотеки.ПолучитьВерсию();
    ТаблицаСостава               = СоставБиблиотеки.ПолучитьСостав();
    СоответствиеКомандМодулей    = СоставБиблиотеки.ПолучитьСоответствиеКомандМодулей();

    Для Каждого КомандаМодуля Из СоответствиеКомандМодулей Цикл

        Библиотека    = КомандаМодуля.Ключ;
        Отбор         = Новый Структура("Библиотека", Библиотека);
        СтрокиКоманды = ТаблицаСостава.Скопировать(Отбор);

        СоответствиеТаблицПараметров.Вставить(Библиотека, СтрокиКоманды);

    КонецЦикла;

КонецПроцедуры

