// OneScript: ./OInt/api/ws/Modules/OPI_WebSocket.os
// Lib: WebSocket
// CLI: none
// Keywords: websocket, ws

// DocsCategory: Exchange
// DocsNameRU: WebSocket
// DocsNameEN: WebSocket

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:LineLength-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off

//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content
//@skip-check method-too-many-params

// #Использовать "../../../tools/main"
// #Использовать "../../../tools/http"

#Область ПрограммныйИнтерфейс

#Область Общие

// Получить настройки логирования !NOCLI
// Получает структуру настроек для запуска логирования при старте сервера
//
// Параметры:
//  ЗаписьВПамять   - Булево - Запись лога в память для дальнейшего получения из объекта компоненты - memory
//  МаксимумСобытий - Число  - Максимальное число события, хранящееся в память                     - count
//  ПутьКФайлу      - Строка - Путь к файлу для сохранения полного лога, если необходимо           - path
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Структура настроек
Функция ПолучитьНастройкиЛогирования(Знач ЗаписьВПамять = Истина
    , Знач МаксимумСобытий = 300
    , Знач ПутьКФайлу = "") Экспорт

    //@skip-check constructor-function-return-section
    Возврат OPI_Компоненты.ПолучитьНастройкиЛогирования(ЗаписьВПамять, МаксимумСобытий, ПутьКФайлу);

КонецФункции

// Получить лог !NOCLI
// Получает данные лога сервера (при включенном логировании в память)
//
// Параметры:
//  ОбъектСервера - Произвольный - Объект компоненты сервера или клиента                      - srv
//  КакСтрока     - Булево       - Истина > возвращает лог одной строкой, Ложь > как массив   - str
//  ЧислоСобытий  - Число        - Число последних событий для получения. 0 > без ограничений - count
//
// Возвращаемое значение:
//  Строка, Соответствие Из КлючИЗначение - Лог как строка или соответствие с полным результатом выполнения
Функция ПолучитьЛог(Знач ОбъектСервера, Знач КакСтрока = Ложь, Знач ЧислоСобытий = 100) Экспорт

    Возврат OPI_Компоненты.ПолучитьЛог(ОбъектСервера
        , КакСтрока
        , ЧислоСобытий);

КонецФункции

#КонецОбласти

#Область МетодыКлиента

// Открыть соединение !NOCLI
// Создает WebSocket соединение
//
// Параметры:
//  Адрес       - Строка                        - Адрес и порт для подключения                                   - address
//  Tls         - Структура Из КлючИЗначение    - Настройки TLS, если необходимо. См. ПолучитьНастройкиTls       - tls
//  Прокси      - Структура Из КлючИЗначение    - Настройки прокси, если необходимо. См. ПолучитьНастройкиПрокси - proxy
//  Заголовки   - Соответствие Из КлючИЗначение - Соответствие дополнительных HTTP заголовков для handshake      - headers
//  Логирование - Структура Из КлючИЗначение    - Настройки логирования. См. ПолучитьНастройкиЛогирования        - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Возвращает объект WebSocket клиента при успешном подключении или информацию об ошибке
Функция ОткрытьСоединение(Знач Адрес
    , Знач Tls = Неопределено
    , Знач Прокси = Неопределено
    , Знач Заголовки = Неопределено
    , Знач Логирование = Неопределено) Экспорт

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Адрес);
    OPI_Инструменты.ВернутьУправляющиеПоследовательности(Адрес);

    WSКлиент = OPI_Компоненты.ПолучитьКомпоненту("WSClient");
    Tls      = OPI_Компоненты.УстановитьTls(WSКлиент, Tls);

    Если Не OPI_Инструменты.ПолучитьИли(Tls, "result", Ложь) Тогда
        Возврат Tls;
    КонецЕсли;

    Если ЗначениеЗаполнено(Прокси) Тогда

        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Прокси);
        ПроксиСтрокой = OPI_Инструменты.JSONСтрокой(Прокси);

        Установка = WSКлиент.SetProxySettings(ПроксиСтрокой);
        Установка = OPI_Инструменты.JsonВСтруктуру(Установка);

        Если Не OPI_Инструменты.ПолучитьИли(Установка, "result", Ложь) Тогда
            Возврат Установка;
        КонецЕсли;

    КонецЕсли;

    Если Логирование = Неопределено Тогда

        СтрокаНастроек = "";

    Иначе

        ТекстОшибки    = "Некорректные настройки логирования";
        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Логирование, ТекстОшибки);
        СтрокаНастроек = OPI_Инструменты.JSONСтрокой(Логирование);

    КонецЕсли;

    Если ЗначениеЗаполнено(Заголовки) Тогда

        ТекстОшибки = "Некорректная структура заголовков";
        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Заголовки, ТекстОшибки);

        ЗаголовкиСтрокой = OPI_Инструменты.JSONСтрокой(Заголовки);
        Результат        = WSКлиент.SetHeaders(ЗаголовкиСтрокой);
        Результат        = OPI_Инструменты.JsonВСтруктуру(Результат);

        Если Не OPI_Инструменты.ПолучитьИли(Результат, "result", Ложь) Тогда
            Возврат Результат;
        КонецЕсли;

    КонецЕсли;

    Результат = WSКлиент.Connect(Адрес, СтрокаНастроек);
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат ?(Результат["result"], WSКлиент, Результат);

КонецФункции

// Закрыть соединение !NOCLI
// Явно закрывает созданное ранее соединение
//
// Параметры:
//  Соединение - Произвольный - Соединение, См. ОткрытьСоединение - conn
//  Код        - Число        - Код состояния                     - code
//  Причина    - Строка       - Текстовое сообщение при закрытии  - reason
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Результат закрытия соединения
Функция ЗакрытьСоединение(Знач Соединение, Знач Код = 1000, Знач Причина = "") Экспорт

    Если ЭтоОбъектКлиента(Соединение) Тогда

        OPI_ПреобразованиеТипов.ПолучитьЧисло(Код);
        OPI_ПреобразованиеТипов.ПолучитьСтроку(Причина);

        Результат = Соединение.Close(Код, Причина);
        Результат = OPI_Инструменты.JsonВСтруктуру(Результат, Ложь);

    Иначе

        Результат = Новый Структура("result,error", Ложь, "It's not a connection");

    КонецЕсли;

    //@skip-check constructor-function-return-section
    Возврат Результат;

КонецФункции

// Отправить пинг !NOCLI
// Отправляет пинг удаленному серверу
//
// Параметры:
//  Соединение - Произвольный - Соединение, См. ОткрытьСоединение - conn
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ОтправитьПинг(Знач Соединение) Экспорт

    Если Не ЭтоОбъектКлиента(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    Результат = Соединение.SendPing();
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат Результат;

КонецФункции

// Отправить понг !NOCLI
// Отправляет понг удаленному серверу
//
// Параметры:
//  Соединение - Произвольный - Соединение, См. ОткрытьСоединение - conn
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ОтправитьПонг(Знач Соединение) Экспорт

    Если Не ЭтоОбъектКлиента(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    Результат = Соединение.SendPong();
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат Результат;

КонецФункции

// Получить сообщение !NOCLI
// Получает входящее сообщение из очереди или ожидает новое
//
// Параметры:
//  Соединение - Произвольный - Соединение, См. ОткрытьСоединение  - conn
//  Таймаут    - Число        - Таймаут ожидания сообщения (в мс.) - tout
//
// Возвращаемое значение:
//  ДвоичныеДанные - Полученное сообщение
Функция ПолучитьСообщение(Знач Соединение, Знач Таймаут = 10000) Экспорт

    Если Не ЭтоОбъектКлиента(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьЧисло(Таймаут);

    Результат = Соединение.ReceiveMessage(Таймаут);
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    ТипСообщения = OPI_Инструменты.ПолучитьИли(Результат, "type", "");
    Данные       = OPI_Инструменты.ПолучитьИли(Результат, "data", "");

    Если ТипСообщения = "binary" Тогда

        Если ЗначениеЗаполнено(Данные) Тогда
            Результат.Вставить("data", OPI_Компоненты.ПолучитьДанные(Соединение, Данные));
        КонецЕсли;

    КонецЕсли;

    Если ТипСообщения = "text" Тогда

        Попытка

            Если СтрНачинаетсяС(Данные, "{") Или СтрНачинаетсяС(Данные, "[") Тогда
                OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Данные);
                Результат["data"] = Данные;
            КонецЕсли;

        Исключение
            Результат["data"] = Строка(Данные);
        КонецПопытки;

    КонецЕсли;

    Возврат Результат;

КонецФункции

// Отправить текстовое сообщение !NOCLI
// Отправляет текст в соединение
//
// Параметры:
//  Соединение - Произвольный - Соединение, См. ОткрытьСоединение - conn
//  Текст      - Строка       - Текст или путь к текстовому файлу - text
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ОтправитьТекстовоеСообщение(Знач Соединение, Знач Текст) Экспорт

    Если Не ЭтоОбъектКлиента(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Текст, Истина);

    Результат = Соединение.SendText(Текст);
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат Результат;

КонецФункции

// Отправить двоичное сообщение !NOCLI
// Отправляет двоичные данные в соединение
//
// Параметры:
//  Соединение - Произвольный           - Соединение, См. ОткрытьСоединение - conn
//  Данные     - ДвоичныеДанные, Строка - Двоичные данные или путь к файлу  - data
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ОтправитьДвоичноеСообщение(Знач Соединение, Знач Данные) Экспорт

    Если Не ЭтоОбъектКлиента(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Данные, Истина);

    Результат = Соединение.SendBinary(Данные);
    Результат = OPI_Инструменты.JsonВСтруктуру(Результат);

    Возврат Результат;

КонецФункции

// Получить настройки TLS !NOCLI
// Формирует настройки для использования TLS при выполнении запросов
//
// Примечание:
// Настройки Tls могут быть установлены только в момент создания соединения: явного, при использовании функции `ОткрытьСоединение`^^
// или неявного, при передаче строки подключения в метод `ОбработатьЗапрос`
//
// Параметры:
//  ОтключитьПроверкуСертификатов - Булево - Позволяет работать с некорректными сертификатами, в т.ч. самоподписанными  - trust
//  ПутьКСертификату              - Строка - Путь к корневому PEM файлу сертификата, если его нет в системном хранилище - cert
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Структура настроек TLS соединения
Функция ПолучитьНастройкиTls(Знач ОтключитьПроверкуСертификатов, Знач ПутьКСертификату = "") Экспорт

    Возврат OPI_Компоненты.ПолучитьНастройкиTls(ОтключитьПроверкуСертификатов, ПутьКСертификату);

КонецФункции

// Получить настройки прокси
// Формирует структуру настроек прокси-сервера для соединения
//
// Параметры:
//  Адрес  - Строка               - Адрес прокси                            - addr
//  Порт   - Число                - Порт прокси                             - port
//  Вид    - Строка               - Вид прокси: socks5, socks4, http        - type
//  Логин  - Строка, Неопределено - Логин авторизации, если необходимо      - login
//  Пароль - Строка, Неопределено - Пароль для авторизации, если необходимо - pass
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Структура настроек прокси
Функция ПолучитьНастройкиПрокси(Знач Адрес
    , Знач Порт
    , Знач Вид = "socks5"
    , Знач Логин = Неопределено
    , Знач Пароль = Неопределено) Экспорт

    //@skip-check constructor-function-return-section
    Возврат OPI_Компоненты.ПолучитьНастройкиПрокси(Адрес, Порт, Вид, Логин, Пароль);

КонецФункции

// Это объект клиента !NOCLI
// Проверяет, что значение является объектом внешней компоненты клиента WebSocket
//
// Параметры:
//  Значение - Произвольный - Значение для проверки - value
//
// Возвращаемое значение:
//  Булево -  Это коннектор
Функция ЭтоОбъектКлиента(Знач Значение) Экспорт

    Возврат Строка(ТипЗнч(Значение)) = "AddIn.OPI_WSClient.Main";

КонецФункции

#КонецОбласти

#Область МетодыСервера

// Запустить сервер !NOCLI
// Запускает ожидание сообщений на указанном порту
//
// Параметры:
//  Порт        - Число                      - Порт сервера                                              - port
//  РазмерПула  - Число                      - Максимальное число одновременно поддерживаемых соединений - psize
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования   - log
//
// Возвращаемое значение:
//  Произвольный - Объект сервера или соответствие с информацией об ошибке
Функция ЗапуститьСервер(Знач Порт, Знач РазмерПула = 100, Знач Логирование = Неопределено) Экспорт

    Возврат OPI_УниверсальныйСервер.ЗапуститьСервер(OPI_WebSocket, Порт, РазмерПула, Логирование);

КонецФункции

// Остановить сервер !NOCLI
// Завершает работу сервера
//
// Параметры:
//  ОбъектСервера - Произвольный - Объект компоненты запущенного сервера - srv
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ОстановитьСервер(Знач ОбъектСервера) Экспорт

    Возврат OPI_УниверсальныйСервер.ОстановитьСервер(OPI_WebSocket, ОбъектСервера);

КонецФункции

// Получить данные очередного соединения !NOCLI
// Получает данные из буфера очередного активного соединения в очереди, где есть данные входящие данные
//
// Параметры:
//  ОбъектСервера      - Произвольный - Объект компоненты запущенного сервера                   - srv
//  Таймаут            - Число        - Период ожидания новых данных, если очередь пуста (в мс) - tout
//  МаксимальныйРазмер - Число        - Максимальный размер данных для получения                - msize
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ПолучитьДанныеОчередногоСоединения(Знач ОбъектСервера, Знач Таймаут = 1000) Экспорт

    Возврат OPI_УниверсальныйСервер.ПолучитьДанныеОчередногоСоединения(OPI_WebSocket
        , ОбъектСервера
        , Таймаут
        , Неопределено);

КонецФункции

// Получить данные соединения !NOCLI
// Получает данные из буфера конкретного соединения по ID
//
// Параметры:
//  ОбъектСервера - Произвольный - Объект компоненты запущенного сервера                   - srv
//  IDСоединения  - Строка       - Идентификатор соединения                                - id
//  Таймаут       - Число        - Период ожидания новых данных, если очередь пуста (в мс) - tout
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ПолучитьДанныеСоединения(Знач ОбъектСервера
    , Знач IDСоединения
    , Знач Таймаут = 1000) Экспорт

    Возврат OPI_УниверсальныйСервер.ПолучитьДанныеСоединения(OPI_WebSocket
        , ОбъектСервера
        , IDСоединения
        , Таймаут
        , Неопределено);

КонецФункции

// Отправить данные !NOCLI
// Отправляет данные в указанное соединение
//
// Параметры:
//  ОбъектСервера - Произвольный           - Объект компоненты запущенного сервера - srv
//  IDСоединения  - Строка                 - Идентификатор соединения              - id
//  Данные        - Строка, ДвоичныеДанные - Данные для отправки                   - data
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ОтправитьДанные(Знач ОбъектСервера, Знач IDСоединения, Знач Данные) Экспорт

    Возврат OPI_УниверсальныйСервер.ОтправитьДанные(OPI_WebSocket, ОбъектСервера, IDСоединения, Данные);

КонецФункции

// Закрыть входящее соединение !NOCLI
// Закрывает входящее соединение сервера по ID
//
// Параметры:
//  ОбъектСервера - Произвольный - Объект компоненты запущенного сервера                    - srv
//  IDСоединения  - Строка       - Идентификатор соединения                                 - id
//  УдалятьСразу  - Булево       - Если Истина, то соединение будет удалено из списка сразу - rm
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ЗакрытьВходящееСоединение(Знач ОбъектСервера, Знач IDСоединения, Знач УдалятьСразу = Истина) Экспорт

    УдалятьСразу = ?(УдалятьСразу = Неопределено, Ложь, УдалятьСразу);
    Возврат OPI_УниверсальныйСервер.ЗакрытьВходящееСоединение(OPI_WebSocket, ОбъектСервера, IDСоединения, УдалятьСразу);

КонецФункции

// Получить список соединений !NOCLI
// Получает список соединений
//
// Примечание:
// В списке выводятся активные соединения и закрытые соединения с необработанными данными в буфере
//
// Параметры:
//  ОбъектСервера - Произвольный - Объект компоненты запущенного сервера - srv
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция ПолучитьСписокСоединений(Знач ОбъектСервера) Экспорт

    Возврат OPI_УниверсальныйСервер.ПолучитьСписокСоединений(OPI_WebSocket, ОбъектСервера);

КонецФункции

// Это объект сервера !NOCLI
// Проверяет, что значение является объектом внешней компоненты сервера WebSocket
//
// Параметры:
//  Значение - Произвольный - Значение для проверки - value
//
// Возвращаемое значение:
//  Булево -  Это коннектор
Функция ЭтоОбъектСервера(Знач Значение) Экспорт

    Возврат Строка(ТипЗнч(Значение)) = "AddIn.OPI_WSServer.Main";

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяКомпоненты() Экспорт

    Возврат "WSServer";

КонецФункции

#КонецОбласти
