#Область СлужебныйПрограммныйИнтерфейс

#Область БСП

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция HMACSHA256(Знач Ключ, Знач Данные) Экспорт
    
    Возврат HMAC(Ключ, Данные, ХешФункция.SHA256, 64);
    
КонецФункции

Функция Хеш(ДвоичныеДанные, Тип) Экспорт
    
    Хеширование = Новый ХешированиеДанных(Тип);
    Хеширование.Добавить(ДвоичныеДанные);
    
    Возврат Хеширование.ХешСумма;
        
КонецФункции

Функция HMAC(Знач Ключ, Знач Данные, Тип, РазмерБлока) Экспорт
    
    Если Ключ.Размер() > РазмерБлока Тогда
        Ключ = Хеш(Ключ, Тип);
    КонецЕсли;
    
    Если Ключ.Размер() <= РазмерБлока Тогда
        Ключ = ПолучитьHexСтрокуИзДвоичныхДанных(Ключ);
        Ключ = Лев(Ключ + ПовторитьСтроку("00", РазмерБлока), РазмерБлока * 2);
    КонецЕсли;
    
    Ключ = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ПолучитьДвоичныеДанныеИзHexСтроки(Ключ));
    
    Ipad = ПолучитьБуферДвоичныхДанныхИзHexСтроки(ПовторитьСтроку("36", РазмерБлока));
    Opad = ПолучитьБуферДвоичныхДанныхИзHexСтроки(ПовторитьСтроку("5c", РазмерБлока));
    
    Ipad.ЗаписатьПобитовоеИсключительноеИли(0, Ключ);
    Ikeypad = ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(ipad);
    
    Opad.ЗаписатьПобитовоеИсключительноеИли(0, Ключ);
    Okeypad = ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(opad);
    
    Возврат Хеш(СклеитьДвоичныеДанные(okeypad, Хеш(СклеитьДвоичныеДанные(ikeypad, Данные), Тип)), Тип);
    
КонецФункции

Функция СклеитьДвоичныеДанные(ДвоичныеДанные1, ДвоичныеДанные2) Экспорт
    
    МассивДвоичныхДанных = Новый Массив;
    МассивДвоичныхДанных.Добавить(ДвоичныеДанные1);
    МассивДвоичныхДанных.Добавить(ДвоичныеДанные2);
    
    Возврат СоединитьДвоичныеДанные(МассивДвоичныхДанных);
    
КонецФункции

Функция ПовторитьСтроку(Строка, Количество) Экспорт
    
    Части = Новый Массив(Количество);
    Для к = 1 По Количество Цикл
        Части.Добавить(Строка);
    КонецЦикла;
    
    Возврат СтрСоединить(Части, "");
    
КонецФункции

#КонецОбласти

#КонецОбласти
