// OneScript: ./OInt/tests/Modules/OPIt_NativeAPI.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MethodSize-off
// BSLLS:NumberOfOptionalParams-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check module-unused-local-variable

#Если Не ВебКлиент Тогда // !OPI

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯкс("NativeAPI");

КонецПроцедуры

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертс("NativeAPI");

КонецФункции

#Область ЗапускаемыеТесты

Процедура NativeAPI_ОсновныеМетоды() Экспорт

    NativeAPI_ПолучитьНастройкиЛогирования();
    NativeAPI_СоздатьХост();
    NativeAPI_ЭтоХост();
    NativeAPI_ПолучитьЛог();

КонецПроцедуры

Процедура NativeAPI_РаботаСБиблиотекой() Экспорт

    NativeAPI_СоздатьХост();
    NativeAPI_ПолучитьИменаКлассов();

КонецПроцедуры

Процедура NativeAPI_РаботаСЭкземпляром() Экспорт

    NativeAPI_СоздатьХост();
    NativeAPI_СоздатьЭкземпляр();
    NativeAPI_ПолучитьМетаданные();
    NativeAPI_ПолучитьСвойства();
    NativeAPI_ВызватьМетод();
    NativeAPI_ПолучитьСвойство();
    NativeAPI_УстановитьСвойство();
    NativeAPI_УничтожитьЭкземпляр();

КонецПроцедуры

#КонецОбласти

#Область АтомарныеТесты

Процедура NativeAPI_ПолучитьНастройкиЛогирования()

    Результат = OPI_NativeAPI.ПолучитьНастройкиЛогирования(Истина, 100, ПолучитьИмяВременногоФайла());

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьНастройкиЛогирования");

    Результат = OPI_NativeAPI.ПолучитьНастройкиЛогирования(Ложь, , ПолучитьИмяВременногоФайла());

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьНастройкиЛогирования", "Файл");

    Результат = OPI_NativeAPI.ПолучитьНастройкиЛогирования(Истина);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьНастройкиЛогирования", "Память");

КонецПроцедуры

Процедура NativeAPI_СоздатьХост()

    ИВФ = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_Cryptography").Записать(ИВФ);

    Результат = OPI_NativeAPI.СоздатьХост(ИВФ);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "СоздатьХост");

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("NativeAPI_Host", Результат);

КонецПроцедуры

Процедура NativeAPI_ЭтоХост()

    Хост = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Результат = OPI_NativeAPI.ЭтоХост(Хост);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ЭтоХост");

    Результат = OPI_NativeAPI.ЭтоХост("not a host");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ЭтоХост", "Ложь");

КонецПроцедуры

Процедура NativeAPI_ПолучитьЛог()

    ФайлЛога             = ПолучитьИмяВременногоФайла("txt");
    НастройкиЛогирования = OPI_NativeAPI.ПолучитьНастройкиЛогирования(Истина, 100, ФайлЛога);
    ИВФ                  = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_Cryptography").Записать(ИВФ);
    Хост                 = OPI_NativeAPI.СоздатьХост(ИВФ, НастройкиЛогирования);

    Результат = OPI_NativeAPI.ПолучитьЛог(Хост);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьЛог", , ФайлЛога);

    Результат = OPI_NativeAPI.ПолучитьЛог(Хост, Истина);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьЛог", "КакСтрока", ФайлЛога);

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла компоненты");

КонецПроцедуры

Процедура NativeAPI_ПолучитьИменаКлассов()

    Хост = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Результат = OPI_NativeAPI.ПолучитьИменаКлассов(Хост);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьИменаКлассов");

    ИВФ = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_Cryptography").Записать(ИВФ);
    Результат = OPI_NativeAPI.ПолучитьИменаКлассов(ИВФ);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьИменаКлассов", "Путь");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла компоненты");

КонецПроцедуры

Процедура NativeAPI_СоздатьЭкземпляр()

    Хост = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Результат = OPI_NativeAPI.СоздатьЭкземпляр(Хост, "Main");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "СоздатьЭкземпляр");

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("NativeAPI_Instance", Результат["instance_id"]);

КонецПроцедуры

Процедура NativeAPI_УничтожитьЭкземпляр()

    Хост      = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Экземпляр = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Instance");
    Результат = OPI_NativeAPI.УничтожитьЭкземпляр(Хост, Экземпляр);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "УничтожитьЭкземпляр");

КонецПроцедуры

Процедура NativeAPI_ПолучитьМетаданные()

    Хост      = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Экземпляр = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Instance");
    Результат = OPI_NativeAPI.ПолучитьМетаданные(Хост, Экземпляр);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьМетаданные");

    ИВФ = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_Cryptography").Записать(ИВФ);
    Результат = OPI_NativeAPI.ПолучитьМетаданные(ИВФ, "Main");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьМетаданные", "ИмяКласса");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла компоненты");

КонецПроцедуры

Процедура NativeAPI_ПолучитьСвойства()

    Хост      = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Экземпляр = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Instance");
    Результат = OPI_NativeAPI.ПолучитьСвойства(Хост, Экземпляр);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьСвойства");

    ИВФ = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_Cryptography").Записать(ИВФ);
    Результат = OPI_NativeAPI.ПолучитьСвойства(ИВФ, "Main");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьСвойства", "ИмяКласса");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла компоненты");

КонецПроцедуры

Процедура NativeAPI_ВызватьМетод()

    Хост      = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Экземпляр = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Instance");
    Параметры = Новый Массив;
    Параметры.Добавить(Новый ДвоичныеДанные("key"));
    Параметры.Добавить(Новый ДвоичныеДанные("data"));

    Результат = OPI_NativeAPI.ВызватьМетод(Хост, Экземпляр, "HmacSha256", Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ВызватьМетод");

    Результат = OPI_NativeAPI.ВызватьМетод(Хост, Экземпляр, "Version", Новый Массив);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ВызватьМетод", "Version");

    Результат = OPI_NativeAPI.ВызватьМетод(Хост, Экземпляр, "Version");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ВызватьМетод", "БезПараметров");

    ИВФ = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_Cryptography").Записать(ИВФ);
    Результат = OPI_NativeAPI.ВызватьМетод(ИВФ, "Main", "Version", Новый Массив);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ВызватьМетод", "ИмяКласса");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла компоненты");

    ИВФКомпоненты = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_SQLite").Записать(ИВФКомпоненты);
    ИВФ           = ПолучитьИмяВременногоФайла("sqlite");
    Свойства      = Новый Соответствие;
    Свойства.Вставить("Database", ИВФ);

    Результат = OPI_NativeAPI.ВызватьМетод(ИВФКомпоненты, "Main", "Connect", Новый Массив, Свойства);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ВызватьМетод", "SQLite", ИВФ);

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла базы");
    OPI_Инструменты.УдалитьФайлВПопытке(ИВФКомпоненты, "Ошибка удаления файла компоненты");

    ИВФКомпоненты = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_SQLite").Записать(ИВФКомпоненты);
    ИВФ           = ПолучитьИмяВременногоФайла("sqlite");
    ХостSQLite    = OPI_NativeAPI.СоздатьХост(ИВФКомпоненты);
    Создание      = OPI_NativeAPI.СоздатьЭкземпляр(ХостSQLite, "Main");
    Инстанс       = Создание["instance_id"];

    Свойства = Новый Соответствие;
    Свойства.Вставить("Database", ИВФ);

    OPI_NativeAPI.ВызватьМетод(ХостSQLite, Инстанс, "Connect", Новый Массив, Свойства);

    Параметры = Новый Массив;
    Параметры.Добавить("SELECT 1 AS n");
    Параметры.Добавить(Истина);
    Параметры.Добавить(Ложь);

    Результат = OPI_NativeAPI.ВызватьМетод(ХостSQLite, Инстанс, "InitQuery", Параметры, Свойства);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ВызватьМетод", "SQLiteЗапрос");

    OPI_NativeAPI.УничтожитьЭкземпляр(ХостSQLite, Инстанс);
    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла базы");
    OPI_Инструменты.УдалитьФайлВПопытке(ИВФКомпоненты, "Ошибка удаления файла компоненты");

КонецПроцедуры

Процедура NativeAPI_ПолучитьСвойство()

    Хост      = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Экземпляр = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Instance");
    Результат = OPI_NativeAPI.ПолучитьСвойство(Хост, Экземпляр, "MissingProperty");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьСвойство");

    ИВФ = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_Cryptography").Записать(ИВФ);
    Результат = OPI_NativeAPI.ПолучитьСвойство(ИВФ, "Main", "MissingProperty");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "ПолучитьСвойство", "ИмяКласса");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла компоненты");

КонецПроцедуры

Процедура NativeAPI_УстановитьСвойство()

    Хост      = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Host");
    Экземпляр = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("NativeAPI_Instance");
    Результат = OPI_NativeAPI.УстановитьСвойство(Хост, Экземпляр, "MissingProperty", "value");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "УстановитьСвойство");

    ИВФ = ПолучитьИмяВременногоФайла();
    OPI_Инструменты.ПолучитьМакетКомпоненты("OPI_Cryptography").Записать(ИВФ);
    Результат = OPI_NativeAPI.УстановитьСвойство(ИВФ, "Main", "MissingProperty", "value");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "NativeAPI", "УстановитьСвойство", "ИмяКласса");

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Ошибка удаления файла компоненты");

КонецПроцедуры

#КонецОбласти

#КонецЕсли // !OPI
