// OneScript: ./OInt/tests/Modules/OPItc_Ollama.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

//#Использовать "../../tools/main"
//#Использовать "../../tools/http"
//#Использовать "../../api"
//#Использовать asserts
//#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯксCLI("Ollama");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("Ollama");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область Ollama

Процедура OLLM_ОбработкаЗапросов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_URL"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_Token", ПараметрыТеста);

    Ollama_СкачатьМодель(ПараметрыТеста);
    Ollama_ПолучитьВерсию(ПараметрыТеста);
    Ollama_ПолучитьОтвет(ПараметрыТеста);
    Ollama_ПолучитьОтветВКонтексте(ПараметрыТеста);
    Ollama_ПолучитьПредставления(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруПараметровЗапроса(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруПараметровВКонтексте(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруСообщенияКонтекста(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруПараметровПредставлений(ПараметрыТеста);

КонецПроцедуры

Процедура OLLM_РаботаСМоделями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_URL"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_Token", ПараметрыТеста);

    Ollama_СкачатьМодель(ПараметрыТеста);
    Ollama_ЗагрузитьМодельВПамять(ПараметрыТеста);
    Ollama_ВыгрузитьМодельИзПамяти(ПараметрыТеста);
    Ollama_СоздатьМодель(ПараметрыТеста);
    Ollama_ПолучитьИнформациюОМодели(ПараметрыТеста);
    Ollama_ПолучитьСписокМоделей(ПараметрыТеста);
    Ollama_ПолучитьСписокЗапущенныхМоделей(ПараметрыТеста);
    Ollama_КопироватьМодель(ПараметрыТеста);
    Ollama_ОтправитьМодель(ПараметрыТеста);
    Ollama_ПолучитьСтруктуруНастроекМодели(ПараметрыТеста);
    Ollama_УдалитьМодель(ПараметрыТеста);

КонецПроцедуры

Процедура OLLM_РаботаСBlob() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_URL"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Ollama_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"     , ПараметрыТеста);

    Ollama_ОтправитьBlob(ПараметрыТеста);
    Ollama_ПроверитьBlob(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // Ollama

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область Ollama

Процедура Ollama_ПолучитьОтвет(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Промпт = "What is 1C:Enterprise?";
    Модель = "tinyllama";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("prompt", Промпт);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьОтвет", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьОтвет"); // SKIP

    // С параметрами

    Промпт = "Ollama is 22 years old and is busy saving the world. Respond using JSON";

    Формат = OPI_Инструменты.JSONВСтруктуру("
    |{
    |""type"": ""object"",
    |""properties"": {
    |  ""age"": {
    |    ""type"": ""integer""
    |  },
    |  ""available"": {
    |    ""type"": ""boolean""
    |  }
    |},
    |""required"": [
    |  ""age"",
    |  ""available""
    |]
    |}");

    ДопПараметры = Новый Структура("format", Формат);

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("prompt", Промпт);
    Опции.Вставить("options", ДопПараметры);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьОтвет", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьОтвет", "Параметры");

КонецПроцедуры

Процедура Ollama_ПолучитьОтветВКонтексте(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Модель = "tinyllama";

    МассивСообщений = Новый Массив;

    Опции = Новый Структура;
    Опции.Вставить("role", "user");
    Опции.Вставить("text", "What is 1C:Enterprise?");

    Вопрос1 = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруСообщенияКонтекста", Опции);
    Вопрос2 = OPI_Ollama.ПолучитьСтруктуруСообщенияКонтекста("user", "When the first version was released?"); // Вопрос без конкретики

    // Добавляем первый вопрос в контекст
    МассивСообщений.Добавить(Вопрос1);

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("msgs", МассивСообщений);
    Опции.Вставить("headers", ДопЗаголовки);

    Ответ1 = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьОтветВКонтексте", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Ответ1, "Ollama", "ПолучитьОтветВКонтексте", "Предварительный"); // SKIP

    МассивСообщений.Добавить(Ответ1["message"]); // Добавляем ответ на первый вопрос в контекст
    МассивСообщений.Добавить(Вопрос2);           // Добавляем второй вопрос в контекст

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("msgs", МассивСообщений);
    Опции.Вставить("headers", ДопЗаголовки);

    Ответ2 = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьОтветВКонтексте", Опции);

    МассивСообщений.Добавить(Ответ2["message"]);

    // ...

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Ответ2, "Ollama", "ПолучитьОтветВКонтексте");

    МассивСообщений = Новый Массив;

    Вопрос = Новый Структура("role,content", "user", "Hello!");
    МассивСообщений.Добавить(Вопрос);

    Опции        = Новый Структура("seed,temperature", 101, 0);
    ДопПараметры = Новый Структура("options", Опции);

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("msgs", МассивСообщений);
    Опции.Вставить("options", ДопПараметры);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьОтветВКонтексте", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьОтветВКонтексте", "Сид 1");

    Сообщение1 = Результат["message"]["content"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("msgs", МассивСообщений);
    Опции.Вставить("options", ДопПараметры);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьОтветВКонтексте", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьОтветВКонтексте", "Сид 2");

    Сообщение2 = Результат["message"]["content"];

    Опции        = Новый Структура("seed,temperature", 555, 10);
    ДопПараметры = Новый Структура("options", Опции);

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("msgs", МассивСообщений);
    Опции.Вставить("options", ДопПараметры);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьОтветВКонтексте", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьОтветВКонтексте", "Сид 3");

    Сообщение3 = Результат["message"]["content"];

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Сообщение3, "Ollama", "ПолучитьОтветВКонтексте", "Сравнение", Сообщение1, Сообщение2, Сообщение3);

КонецПроцедуры

Процедура Ollama_ЗагрузитьМодельВПамять(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "tinyllama";
    Период = 500;

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("keep", Период);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ЗагрузитьМодельВПамять", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ЗагрузитьМодельВПамять");

КонецПроцедуры

Процедура Ollama_ВыгрузитьМодельИзПамяти(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "tinyllama";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ВыгрузитьМодельИзПамяти", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ВыгрузитьМодельИзПамяти");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруПараметровЗапроса(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруПараметровЗапроса", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруПараметровЗапроса");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруПараметровЗапроса", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруПараметровЗапроса", "Пустая");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруПараметровВКонтексте(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруПараметровВКонтексте", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруПараметровВКонтексте");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруПараметровВКонтексте", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруПараметровВКонтексте", "Пустая");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруСообщенияКонтекста(ПараметрыФункции)

    Опции = Новый Структура;
    Опции.Вставить("role", "user");
    Опции.Вставить("text", "Hello!");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруСообщенияКонтекста", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруСообщенияКонтекста");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруНастроекМодели(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруНастроекМодели", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруНастроекМодели");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруНастроекМодели", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруНастроекМодели", "Пустая");

КонецПроцедуры

Процедура Ollama_СоздатьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "mario";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Настройки = Новый Структура("from,system", "tinyllama", "You are Mario from Super Mario Bros.");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("settings", Настройки);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "СоздатьМодель", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "СоздатьМодель");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("prompt", "How are you?");
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьОтвет", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "СоздатьМодель", "Запрос");

КонецПроцедуры

Процедура Ollama_УдалитьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "mario";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "УдалитьМодель", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "УдалитьМодель");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", "library/tinyllama:latest");
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "УдалитьМодель", Опции);
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "УдалитьМодель", "Tiny");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", "bayselonarrend/tinyllama:latest");
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "УдалитьМодель", Опции);
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "УдалитьМодель", "Tiny, аккаунт");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСписокМоделей", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "УдалитьМодель", "Список");

КонецПроцедуры

Процедура Ollama_ПолучитьСписокМоделей(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСписокМоделей", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСписокМоделей");

КонецПроцедуры

Процедура Ollama_ПолучитьСписокЗапущенныхМоделей(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСписокЗапущенныхМоделей", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСписокЗапущенныхМоделей");

КонецПроцедуры

Процедура Ollama_ПолучитьИнформациюОМодели(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "mario";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("verbose", Ложь);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьИнформациюОМодели", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьИнформациюОМодели");

КонецПроцедуры

Процедура Ollama_КопироватьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "mario";
    Имя    = "mario2";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("name", Имя);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "КопироватьМодель", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "КопироватьМодель");

    OPI_Ollama.УдалитьМодель(URL, Имя, ДопЗаголовки);

КонецПроцедуры

Процедура Ollama_ПолучитьВерсию(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьВерсию", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьВерсию");

КонецПроцедуры

Процедура Ollama_ПолучитьПредставления(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    МассивСтрок = Новый Массив;
    МассивСтрок.Добавить("Why is the sky blue?");
    МассивСтрок.Добавить("Why is the grass green?");

    Модель = "tinyllama";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("input", МассивСтрок);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьПредставления", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьПредставления");

КонецПроцедуры

Процедура Ollama_ПолучитьСтруктуруПараметровПредставлений(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруПараметровПредставлений", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруПараметровПредставлений");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПолучитьСтруктуруПараметровПредставлений", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПолучитьСтруктуруПараметровПредставлений", "Пустая");

КонецПроцедуры

Процедура Ollama_ОтправитьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "bayselonarrend/tinyllama:latest";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ОтправитьМодель", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ОтправитьМодель");

КонецПроцедуры

Процедура Ollama_СкачатьМодель(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Модель = "tinyllama";

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", Модель);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "СкачатьМодель", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "СкачатьМодель");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("model", "bayselonarrend/tinyllama:latest");
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "СкачатьМодель", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "СкачатьМодель", "Аккаунт");

КонецПроцедуры

Процедура Ollama_ОтправитьBlob(ПараметрыФункции)

    URL   = ПараметрыФункции["Ollama_URL"];
    Токен = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка, Истина);                   // SKIP
    Рандом   = ПолучитьДвоичныеДанныеИзСтроки(Строка(Новый УникальныйИдентификатор));   // SKIP
    Картинка = OPI_Инструменты.СклеитьДанные(Картинка, Рандом);                         // SKIP

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("data", Картинка);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ОтправитьBlob", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ОтправитьBlob", , ПараметрыФункции);

КонецПроцедуры

Процедура Ollama_ПроверитьBlob(ПараметрыФункции)

    URL    = ПараметрыФункции["Ollama_URL"];
    Токен  = ПараметрыФункции["Ollama_Token"]; // Авторизация - не часть API Ollama
    SHA256 = ПараметрыФункции["Ollama_Blob"];

    ДопЗаголовки = Новый Соответствие;
    ДопЗаголовки.Вставить("Authorization", СтрШаблон("Bearer %1", Токен));

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("digest", SHA256);
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПроверитьBlob", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПроверитьBlob");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("digest", "yoyoyo");
    Опции.Вставить("headers", ДопЗаголовки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ollama", "ПроверитьBlob", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Ollama", "ПроверитьBlob", "Ошибка");

КонецПроцедуры

#КонецОбласти // Ollama

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure OLLM_RequestsProcessing() Export
    OLLM_ОбработкаЗапросов();
EndProcedure

Procedure OLLM_ModelsManagement() Export
    OLLM_РаботаСМоделями();
EndProcedure

Procedure OLLM_WorkingWithBlob() Export
    OLLM_РаботаСBlob();
EndProcedure

#EndRegion
