// OneScript: ./OInt/api/zeromq/Modules/OPI_ZeroMQ.os
// Lib: ZeroMQ
// CLI: none
// Keywords: zeromq, zmq

// DocsCategory: Exchange
// DocsNameRU: ZeroMQ
// DocsNameEN: ZeroMQ

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:LineLength-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:CommonModuleNameClientServer-off

//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content
//@skip-check method-too-many-params

#Использовать "../../../tools/main"
#Использовать "../../../tools/http"


#Область ПрограммныйИнтерфейс

#Область Общие

// Получить настройки логирования !NOCLI
// Получает структуру настроек для запуска логирования при создании соединения или открытии порта
//
// Параметры:
//  ЗаписьВПамять   - Булево - Запись лога в память для дальнейшего получения из объекта компоненты - memory
//  МаксимумСобытий - Число  - Максимальное число событий, хранящееся в память                      - count
//  ПутьКФайлу      - Строка - Путь к файлу для сохранения полного лога, если необходимо            - path
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Структура настроек
Функция ПолучитьНастройкиЛогирования(Знач ЗаписьВПамять = Истина
    , Знач МаксимумСобытий = 300
    , Знач ПутьКФайлу = "") Экспорт

    //@skip-check constructor-function-return-section
    Возврат OPI_Компоненты.ПолучитьНастройкиЛогирования(ЗаписьВПамять, МаксимумСобытий, ПутьКФайлу);

КонецФункции

// Получить лог !NOCLI
// Получает данные лога соединения (при включенном логировании в память)
//
// Параметры:
//  Соединение   - Произвольный - Объект компоненты с открытым соединением или портом        - conn
//  КакСтрока    - Булево       - Истина > возвращает лог одной строкой, Ложь > как массив   - str
//  ЧислоСобытий - Число        - Число последних событий для получения. 0 > без ограничений - count
//
// Возвращаемое значение:
//  Строка, Соответствие Из КлючИЗначение - Лог как строка или соответствие с полным результатом выполнения
Функция ПолучитьЛог(Знач Соединение, Знач КакСтрока = Ложь, Знач ЧислоСобытий = 100) Экспорт

    Возврат OPI_Компоненты.ПолучитьЛог(Соединение
        , КакСтрока
        , ЧислоСобытий);

КонецФункции

#КонецОбласти

#Область МетодыПодключения

// Создать соединение (REQ) !NOCLI
// Создает соединение для отправки запроса
//
// Параметры:
//  Адрес       - Строка                     - Адрес приемника                                         - addr
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция СоздатьСоединениеReq(Знач Адрес, Знач Логирование = Неопределено) Экспорт

    Результат = ИнициализироватьКоннектор(Адрес, "ConnectReq", Логирование);
    Возврат Результат;

КонецФункции

// Создать соединение (SUB) !NOCLI
// Создает соединение подписчика
//
// Параметры:
//  Адрес       - Строка                     - Адрес приемника                                         - addr
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция СоздатьСоединениеSub(Знач Адрес, Знач Логирование = Неопределено) Экспорт

    Результат = ИнициализироватьКоннектор(Адрес, "ConnectSub", Логирование);
    Возврат Результат;

КонецФункции

// Создать соединение (PUSH) !NOCLI
// Создает соединение отправки в пайплайн
//
// Параметры:
//  Адрес       - Строка                     - Адрес приемника                                         - addr
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция СоздатьСоединениеPush(Знач Адрес, Знач Логирование = Неопределено) Экспорт

    Результат = ИнициализироватьКоннектор(Адрес, "ConnectPush", Логирование);
    Возврат Результат;

КонецФункции

// Создать соединение (PULL) !NOCLI
// Создает соединение чтения пайплайна
//
// Параметры:
//  Адрес       - Строка                     - Адрес приемника                                         - addr
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция СоздатьСоединениеPull(Знач Адрес, Знач Логирование = Неопределено) Экспорт

    Результат = ИнициализироватьКоннектор(Адрес, "ConnectPull", Логирование);
    Возврат Результат;

КонецФункции

#КонецОбласти

#Область МетодыПрослушивания

// Открыть порт (REP) !NOCLI
// Открывает порт для входящих запросов
//
// Параметры:
//  Порт        - Число                      - Целевой порт                                            - port
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция ОткрытьПортRep(Знач Порт, Знач Логирование = Неопределено) Экспорт

    Результат = ИнициализироватьКоннектор(Порт, "BindRep", Логирование);
    Возврат Результат;

КонецФункции

// Открыть порт (PUB) !NOCLI
// Открывает порт для подписчиков
//
// Параметры:
//  Порт        - Число                      - Целевой порт                                            - port
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция ОткрытьПортPub(Знач Порт, Знач Логирование = Неопределено) Экспорт

    Результат = ИнициализироватьКоннектор(Порт, "BindPub", Логирование);
    Возврат Результат;

КонецФункции

// Открыть порт (PUSH)
// Открывает порт пайплайна для отправки данных
//
// Параметры:
//  Порт        - Число                      - Целевой порт                                            - port
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция ОткрытьПортPush(Знач Порт, Знач Логирование = Неопределено) Экспорт

    Результат = ИнициализироватьКоннектор(Порт, "BindPush", Логирование);
    Возврат Результат;

КонецФункции

// Открыть порт (PULL) !NOCLI
// Открывает порт пайплайна для получения данных
//
// Параметры:
//  Порт        - Число                      - Целевой порт                                            - port
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение, Произвольный -  Объект компоненты или соответствие с информацией об ошибке
Функция ОткрытьПортPull(Знач Порт, Знач Логирование = Неопределено) Экспорт

    Результат = ИнициализироватьКоннектор(Порт, "BindPull", Логирование);
    Возврат Результат;

КонецФункции

#КонецОбласти

#Область МетодыВзаимодействия

// Отправить данные !NOCLI
// Отправляет данные в соединение
//
// Параметры:
//  Соединение - Произвольный        - Объект компоненты с открытым соединением или портом - conn
//  Данные     - ДвоичныеДанные      - Данные для отправки                                 - data
//  Таймаут    - Число, Неопределено - Таймаут (в мс). Без таймаута, если неопределено     - tout
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ОтправитьДанные(Знач Соединение, Знач Данные, Знач Таймаут = Неопределено) Экспорт

    Если Не ЭтоОбъектКоннектора(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Данные, Истина);

    Если Таймаут = Неопределено Тогда

        Таймаут = -1;

    Иначе
        OPI_ПреобразованиеТипов.ПолучитьЧисло(Таймаут);
    КонецЕсли;

    Результат = Соединение.Send(Данные, Таймаут);
    Результат = OPI_Компоненты.ДесериализоватьJanx(Результат);

    Возврат Результат;

КонецФункции

// Получить данные !NOCLI
// Получает очередное сообщение из соединения
//
// Параметры:
//  Соединение - Произвольный        - Объект компоненты с открытым соединением или портом - conn
//  Таймаут    - Число, Неопределено - Таймаут (в мс). Без таймаута, если неопределено     - tout
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ПолучитьДанные(Знач Соединение, Знач Таймаут) Экспорт

    Если Не ЭтоОбъектКоннектора(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    Если Таймаут = Неопределено Тогда

        Таймаут = -1;

    Иначе
        OPI_ПреобразованиеТипов.ПолучитьЧисло(Таймаут);
    КонецЕсли;

    РезультатДД = Соединение.Recv(Таймаут);

    Возврат OPI_Компоненты.ДесериализоватьJanx(РезультатДД);

КонецФункции

// Обработать запрос !NOCLI
// Отправляет запрос и ожидает ответ в течении указанного времени (для схемы REQ/REP)
//
// Параметры:
//  Соединение       - Произвольный        - Объект компоненты с открытым соединением                  - conn
//  Данные           - ДвоичныеДанные      - Данные для отправки                                       - data
//  ТаймаутОтправки  - Число, Неопределено - Таймаут отправки (в мс). Без таймаута, если неопределено  - treq
//  ТаймаутПолучения - Число, Неопределено - Таймаут получения (в мс). Без таймаута, если неопределено - trep
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ОбработатьЗапрос(Знач Соединение
    , Знач Данные
    , Знач ТаймаутОтправки = Неопределено
    , Знач ТаймаутПолучения = Неопределено) Экспорт

    РезультатОтправки = ОтправитьДанные(Соединение, Данные, ТаймаутОтправки);

    Если Не РезультатОтправки["result"] Тогда
        Возврат РезультатОтправки;
    КонецЕсли;

    РезультатПолучения = ПолучитьДанные(Соединение, ТаймаутПолучения);

    Возврат РезультатПолучения;

КонецФункции

// Подписаться !NOCLI
// Осуществляет подписку на тему в схеме PUB/SUB
//
// Параметры:
//  Соединение - Произвольный - Объект компоненты с открытым соединением или портом - conn
//  Префикс    - Строка       - Требуемый префикс (тема) сообщений для получения    - prefix
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция Подписаться(Знач Соединение, Знач Префикс) Экспорт

    Если Не ЭтоОбъектКоннектора(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Префикс);

    Результат = Соединение.Subscribe(Префикс);
    Результат = OPI_Компоненты.ДесериализоватьJanx(Результат);

    Возврат Результат;

КонецФункции

// Закрыть соединение !NOCLI
// Закрывает ранее созданное соединение
//
// Параметры:
//  Соединение - Произвольный - Объект компоненты с открытым соединением или портом - conn
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат обработки
Функция ЗакрытьСоединение(Знач Соединение) Экспорт

    Если Не ЭтоОбъектКоннектора(Соединение) Тогда

        СоответствиеОшибки = Новый Соответствие;
        СоответствиеОшибки.Вставить("result", Ложь);
        СоответствиеОшибки.Вставить("error" , "Implicit connection opening is senseless in this case");

        Возврат СоответствиеОшибки;

    КонецЕсли;

    Результат = Соединение.Close();
    Результат = OPI_Компоненты.ДесериализоватьJanx(Результат);

    Возврат Результат;

КонецФункции

// Это объект клиента !NOCLI
// Проверяет, что значение является объектом внешней компоненты ZeroMQ
//
// Параметры:
//  Значение - Произвольный - Значение для проверки - value
//
// Возвращаемое значение:
//  Булево -  Это коннектор
Функция ЭтоОбъектКоннектора(Знач Значение) Экспорт

    Возврат Строка(ТипЗнч(Значение)) = "AddIn.OPI_ZeroMQ.Main";

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьКоннектор(Знач АдресПорт, Знач Вид, Знач Логирование = Неопределено)

    Если СтрНачинаетсяС(Вид, "Connect") Тогда
        OPI_ПреобразованиеТипов.ПолучитьСтроку(АдресПорт);
        OPI_Инструменты.ВернутьУправляющиеПоследовательности(АдресПорт);
    Иначе
        OPI_ПреобразованиеТипов.ПолучитьЧисло(АдресПорт);
    КонецЕсли;

    ZMQ = OPI_Компоненты.ПолучитьКомпоненту("ZeroMQ");

    Если Логирование = Неопределено Тогда

        СтрокаНастроек = "";

    Иначе

        ТекстОшибки    = "Некорректные настройки логирования";
        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Логирование, ТекстОшибки);
        СтрокаНастроек = OPI_Компоненты.СериализоватьJanx(Логирование);

    КонецЕсли;

    Если ЗначениеЗаполнено(СтрокаНастроек) Тогда

        РезультатЛога = ZMQ.SetLogger(СтрокаНастроек);
        РезультатЛога = OPI_Компоненты.ДесериализоватьJanx(РезультатЛога);

        Если Не РезультатЛога["result"] Тогда
            Возврат РезультатЛога;
        КонецЕсли;

    КонецЕсли;

    Результат = ВыполнитьИнициализацию(ZMQ, АдресПорт, Вид);

    Возврат ?(Результат["result"], ZMQ, Результат);

КонецФункции

Функция ВыполнитьИнициализацию(Знач Коннектор, Знач АдресПорт, Знач Вид)

    Если Вид = "ConnectReq" Тогда
        Результат = Коннектор.ConnectReq(АдресПорт);
    ИначеЕсли Вид = "ConnectSub" Тогда
        Результат = Коннектор.ConnectSub(АдресПорт);
    ИначеЕсли Вид = "ConnectPush" Тогда
        Результат = Коннектор.ConnectPush(АдресПорт);
    ИначеЕсли Вид = "ConnectPull" Тогда
        Результат = Коннектор.ConnectPull(АдресПорт);
    ИначеЕсли Вид = "BindRep" Тогда
        Результат = Коннектор.BindRep(АдресПорт);
    ИначеЕсли Вид = "BindPub" Тогда
        Результат = Коннектор.BindPub(АдресПорт);
    ИначеЕсли Вид = "BindPush" Тогда
        Результат = Коннектор.BindPush(АдресПорт);
    ИначеЕсли Вид = "BindPull" Тогда
        Результат = Коннектор.BindPull(АдресПорт);
    Иначе
        ВызватьИсключение "Неподдерживаемый вид инициализации ZMQ!"
    КонецЕсли;

    Результат = OPI_Компоненты.ДесериализоватьJanx(Результат);

    Возврат Результат;

КонецФункции

#КонецОбласти


#Region Alternate

Function GetLoggingSettings(Val WriteToMemory = True, Val MaxEvents = 300, Val FilePath = "") Export
    Return ПолучитьНастройкиЛогирования(WriteToMemory, MaxEvents, FilePath);
EndFunction

Function GetLog(Val Connection, Val AsString = False, Val EventCount = 100) Export
    Return ПолучитьЛог(Connection, AsString, EventCount);
EndFunction

Function CreateConnectionReq(Val Address, Val Logging = Undefined) Export
    Return СоздатьСоединениеReq(Address, Logging);
EndFunction

Function CreateConnectionSub(Val Address, Val Logging = Undefined) Export
    Return СоздатьСоединениеSub(Address, Logging);
EndFunction

Function CreateConnectionPush(Val Address, Val Logging = Undefined) Export
    Return СоздатьСоединениеPush(Address, Logging);
EndFunction

Function CreateConnectionPull(Val Address, Val Logging = Undefined) Export
    Return СоздатьСоединениеPull(Address, Logging);
EndFunction

Function BindPortRep(Val Port, Val Logging = Undefined) Export
    Return ОткрытьПортRep(Port, Logging);
EndFunction

Function BindPortPub(Val Port, Val Logging = Undefined) Export
    Return ОткрытьПортPub(Port, Logging);
EndFunction

Function BindPortPush(Val Port, Val Logging = Undefined) Export
    Return ОткрытьПортPush(Port, Logging);
EndFunction

Function BindPortPull(Val Port, Val Logging = Undefined) Export
    Return ОткрытьПортPull(Port, Logging);
EndFunction

Function SendData(Val Connection, Val Data, Val Timeout = Undefined) Export
    Return ОтправитьДанные(Connection, Data, Timeout);
EndFunction

Function ReceiveData(Val Connection, Val Timeout) Export
    Return ПолучитьДанные(Connection, Timeout);
EndFunction

Function ProcessRequest(Val Connection, Val Data, Val SendingTimeout = Undefined, Val ReceivingTimeout = Undefined) Export
    Return ОбработатьЗапрос(Connection, Data, SendingTimeout, ReceivingTimeout);
EndFunction

Function Subscribe(Val Connection, Val Prefix) Export
    Return Подписаться(Connection, Prefix);
EndFunction

Function CloseConnection(Val Connection) Export
    Return ЗакрытьСоединение(Connection);
EndFunction

Function IsConnectorObject(Val Value) Export
    Return ЭтоОбъектКоннектора(Value);
EndFunction

#EndRegion