// OneScript: ./OInt/tests/Modules/OPItc_S3.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

#Использовать "../../tools/main"
#Использовать "../../tools/http"
#Использовать "../../api"
#Использовать asserts
#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯксCLI("S3");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("S3");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область S3

Процедура AWS_ОбщиеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровS3();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        S3_ПолучитьСтруктуруДанных(ПараметрыТеста);
        S3_ОтправитьЗапросБезТела(ПараметрыТеста);
        S3_ОтправитьЗапросСТелом(ПараметрыТеста);

   КонецЦикла;

КонецПроцедуры

Процедура AWS_РаботаСБакетами() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровS3();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        S3_СоздатьБакет(ПараметрыТеста);
        S3_ПолучитьСписокБакетов(ПараметрыТеста);
        S3_ПроверитьДоступностьБакета(ПараметрыТеста);
        S3_УстановитьТегиБакета(ПараметрыТеста);
        S3_ПолучитьТегиБакета(ПараметрыТеста);
        S3_УдалитьТегиБакета(ПараметрыТеста);
        S3_УстановитьШифрованиеБакета(ПараметрыТеста);
        S3_ПолучитьШифрованиеБакета(ПараметрыТеста);
        S3_УдалитьШифрованиеБакета(ПараметрыТеста);
        S3_УстановитьНастройкиВерсионированияБакета(ПараметрыТеста);
        S3_ПолучитьНастройкиВерсионированияБакета(ПараметрыТеста);
        S3_УдалитьБакет(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура AWS_РаботаСОбъектами() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровS3();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        S3_СоздатьБакет(ПараметрыТеста);
        S3_ЗагрузитьОбъект(ПараметрыТеста);
        S3_ЗагрузитьОбъектЦеликом(ПараметрыТеста);
        S3_ИнициализироватьЗагрузкуЧастями(ПараметрыТеста);
        S3_ЗагрузитьЧастьОбъекта(ПараметрыТеста);
        S3_ЗавершитьЗагрузкуЧастями(ПараметрыТеста);
        S3_ОтменитьЗагрузкуЧастями(ПараметрыТеста);
        S3_ПолучитьОписаниеОбъекта(ПараметрыТеста);
        S3_КопироватьОбъект(ПараметрыТеста);
        S3_УстановитьТегиОбъекта(ПараметрыТеста);
        S3_ПолучитьТегиОбъекта(ПараметрыТеста);
        S3_УдалитьТегиОбъекта(ПараметрыТеста);
        S3_ПолучитьСписокОбъектов(ПараметрыТеста);
        S3_ПолучитьСписокВерсийОбъектов(ПараметрыТеста);
        S3_ПолучитьОбъект(ПараметрыТеста);
        S3_ПолучитьСсылкуСкачиванияОбъекта(ПараметрыТеста);
        S3_УдалитьОбъект(ПараметрыТеста);
        S3_УдалитьБакет(ПараметрыТеста);
        S3_ПолучитьСсылкуЗагрузкиОбъекта(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

#КонецОбласти // S3

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область S3

Процедура S3_ПолучитьСтруктуруДанных(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьСтруктуруДанных");

КонецПроцедуры

Процедура S3_ОтправитьЗапросБезТела(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"] + "/opi-newbucket2";
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);
    Метод          = "GET";

    Опции = Новый Структура;
    Опции.Вставить("method", Метод);
    Опции.Вставить("basic", ОсновныеДанные);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ОтправитьЗапросБезТела", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ОтправитьЗапросБезТела");

КонецПроцедуры

Процедура S3_ОтправитьЗапросСТелом(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Метод = "PUT";
    Тело  = "C:\test_data\document.docx";  // URL, Путь или Двоичные данные

    Опции = Новый Структура;
    Опции.Вставить("method", Метод);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("body", Тело);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ОтправитьЗапросСТелом", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ОтправитьЗапросСТелом");

КонецПроцедуры

Процедура S3_СоздатьБакет(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Результат = OPI_S3.УдалитьБакет(Наименование, ОсновныеДанные, Каталог); // SKIP
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "СоздатьБакет", "Удаление");                // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "СоздатьБакет", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "СоздатьБакет");

КонецПроцедуры

Процедура S3_УдалитьБакет(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УдалитьБакет", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УдалитьБакет");

КонецПроцедуры

Процедура S3_ПолучитьСписокБакетов(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);
    Опции = Новый Структура;
    Опции.Вставить("basic", ОсновныеДанные);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСписокБакетов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьСписокБакетов");

КонецПроцедуры

Процедура S3_ПроверитьДоступностьБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПроверитьДоступностьБакета", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПроверитьДоступностьБакета"); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);
    Опции.Вставить("account", "1234");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПроверитьДоступностьБакета", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПроверитьДоступностьБакета", "Аккаунт");

КонецПроцедуры

Процедура S3_ПолучитьШифрованиеБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьШифрованиеБакета", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьШифрованиеБакета");

КонецПроцедуры

Процедура S3_УдалитьШифрованиеБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УдалитьШифрованиеБакета", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УдалитьШифрованиеБакета");

КонецПроцедуры

Процедура S3_УстановитьШифрованиеБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    XMLКонфигурация = "<ServerSideEncryptionConfiguration xmlns=""http://s3.amazonaws.com/doc/2006-03-01/"">
                      | <Rule>
                      | <ApplyServerSideEncryptionByDefault>
                      | <SSEAlgorithm>AES256</SSEAlgorithm>
                      | </ApplyServerSideEncryptionByDefault>
                      | </Rule>
                      |</ServerSideEncryptionConfiguration>";

    ИВФ             = ПолучитьИмяВременногоФайла("xml");                       // SKIP
    ПолучитьДвоичныеДанныеИзСтроки(XMLКонфигурация).Записать(ИВФ); // SKIP
    XMLКонфигурация = ИВФ;                                         // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("conf", XMLКонфигурация);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УстановитьШифрованиеБакета", Опции);

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(XMLКонфигурация, "Ошибка удаления файла после теста");

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УстановитьШифрованиеБакета");

КонецПроцедуры

Процедура S3_ПолучитьТегиБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьТегиБакета", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьТегиБакета");

КонецПроцедуры

Процедура S3_УстановитьТегиБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    СтруктураТегов = Новый Структура;
    СтруктураТегов.Вставить("MyTag1", "SomeValue");
    СтруктураТегов.Вставить("MyTag2", "AnotherOne");

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("tagset", СтруктураТегов);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УстановитьТегиБакета", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УстановитьТегиБакета");

КонецПроцедуры

Процедура S3_УдалитьТегиБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УдалитьТегиБакета", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УдалитьТегиБакета");

КонецПроцедуры

Процедура S3_ПолучитьНастройкиВерсионированияБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьНастройкиВерсионированияБакета", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьНастройкиВерсионированияБакета");

КонецПроцедуры

Процедура S3_УстановитьНастройкиВерсионированияБакета(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);
    Статус         = Истина;

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Наименование = ПараметрыФункции["S3_DB"];
    Наименование = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("status", Статус);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УстановитьНастройкиВерсионированияБакета", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УстановитьНастройкиВерсионированияБакета");

КонецПроцедуры

Процедура S3_ЗагрузитьОбъект(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Наименование = "picture.jpg";
    Содержимое   = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("data", Содержимое);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ЗагрузитьОбъект", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗагрузитьОбъект"); // SKIP

    Наименование = "fileChunked.mp3";
    Содержимое   = ПараметрыФункции["Audio"]; // URL, Путь или Двоичные данные

    ОсновныеДанные.Вставить("ChunkSize", 5242880); // Размер части для загрузки в несколько запросов

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("data", Содержимое);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ЗагрузитьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗагрузитьОбъект", "Частями");

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные, , , Каталог);

КонецПроцедуры

Процедура S3_ЗагрузитьОбъектЦеликом(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "pictureSmall.jpg";
    Содержимое   = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("data", Содержимое);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ЗагрузитьОбъектЦеликом", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗагрузитьОбъектЦеликом");

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные, , , Каталог);

КонецПроцедуры

Процедура S3_УдалитьОбъект(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УдалитьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УдалитьОбъект");

КонецПроцедуры

Процедура S3_ПолучитьОписаниеОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьОписаниеОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьОписаниеОбъекта");

КонецПроцедуры

Процедура S3_КопироватьОбъект(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    ПутьИсточник  = "picture.jpg";
    БакетИсточник = "newbucket2";

    ПутьПриемник  = "new_picture.jpg";
    БакетПриемник = ПараметрыФункции["S3_DB"];
    БакетПриемник = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("sname", ПутьИсточник);
    Опции.Вставить("sbucket", БакетИсточник);
    Опции.Вставить("name", ПутьПриемник);
    Опции.Вставить("bucket", БакетПриемник);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "КопироватьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "КопироватьОбъект");

    OPI_S3.УдалитьОбъект(ПутьПриемник, БакетПриемник, ОсновныеДанные, , , Каталог);

КонецПроцедуры

Процедура S3_УстановитьТегиОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    СтруктураТегов = Новый Структура;

    СтруктураТегов.Вставить("MyTag1", "SomeValue");
    СтруктураТегов.Вставить("MyTag2", "AnotherOne");

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("tagset", СтруктураТегов);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УстановитьТегиОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УстановитьТегиОбъекта");

КонецПроцедуры

Процедура S3_ПолучитьТегиОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьТегиОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьТегиОбъекта");

КонецПроцедуры

Процедура S3_УдалитьТегиОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "УдалитьТегиОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "УдалитьТегиОбъекта");

КонецПроцедуры

Процедура S3_ПолучитьСписокОбъектов(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСписокОбъектов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьСписокОбъектов");

КонецПроцедуры

Процедура S3_ПолучитьСписокВерсийОбъектов(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Префикс   = "pic";
    Опции = Новый Структура;
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("prefix", Префикс);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСписокВерсийОбъектов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьСписокВерсийОбъектов");

КонецПроцедуры

Процедура S3_ПолучитьОбъект(ПараметрыФункции)

    Картинка          = ПараметрыФункции["Picture"];          // SKIP
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // SKIP
    НеобходимыйРазмер = Картинка.Размер();                    // SKIP

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьОбъект", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьОбъект", , НеобходимыйРазмер); // SKIP

    ВременныйФайл = ПолучитьИмяВременногоФайла();
    ОсновныеДанные.Вставить("ChunkSize", 200000);

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("out", ВременныйФайл);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьОбъект", "Файл", НеобходимыйРазмер);

    Наименование = "bigfile.exe";
    Бакет        = "newbucket2";

    ВременныйФайлБольшой = ПолучитьИмяВременногоФайла();
    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("out", ВременныйФайлБольшой);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьОбъект", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьОбъект", "Большой файл", 34432400);

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьОбъект", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьОбъект", "Большой ДД", 34432400);

    OPI_Инструменты.УдалитьФайлВПопытке(ВременныйФайлБольшой, "Не удалось удалить временный файл после теста!");
    OPI_Инструменты.УдалитьФайлВПопытке(ВременныйФайл       , "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура S3_ИнициализироватьЗагрузкуЧастями(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "fileChunked.mp3";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Содержимое = ПараметрыФункции["Audio"]; // URL, Путь или Двоичные данные
    Содержимое = OPI_ЗапросыHTTP.Get(Содержимое);

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ИнициализироватьЗагрузкуЧастями", Опции);
    // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ИнициализироватьЗагрузкуЧастями"); // SKIP

    IDЗагрузки    = Результат["response"]["InitiateMultipartUploadResult"]["UploadId"];
    ОбщийРазмер   = Содержимое.Размер();
    РазмерУчастка = 5242880;
    ПрочитаноБайт = 0;
    НомерЧасти    = 1;

    ЧтениеДанных  = Новый ЧтениеДанных(Содержимое);
    ИсходныйПоток = ЧтениеДанных.ИсходныйПоток();
    МассивТегов   = Новый Массив;

    Пока ПрочитаноБайт < ОбщийРазмер Цикл

        ТекущееЧтение = ЧтениеДанных.Прочитать(РазмерУчастка);
        ТекущиеДанные = ТекущееЧтение.ПолучитьДвоичныеДанные();

        Если ТекущиеДанные.Размер() = 0 Тогда
            Прервать;
        КонецЕсли;

        Результат = OPI_S3.ЗагрузитьЧастьОбъекта(Наименование
            , Бакет
            , ОсновныеДанные
            , IDЗагрузки
            , НомерЧасти
            , ТекущиеДанные
            , Каталог);

        OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ИнициализироватьЗагрузкуЧастями", "Часть"); // SKIP

        ПрочитаноБайт = ИсходныйПоток.ТекущаяПозиция();

        ETag = Результат["headers"]["Etag"];
        ETag = ?(ETag = Неопределено, Результат["headers"]["ETag"], ETag);

        МассивТегов.Добавить(ETag);

        НомерЧасти = НомерЧасти + 1;

    КонецЦикла;

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("upload", IDЗагрузки);
    Опции.Вставить("tags", МассивТегов);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ЗавершитьЗагрузкуЧастями", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ИнициализироватьЗагрузкуЧастями", "Завершение");

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные);

КонецПроцедуры

Процедура S3_ЗавершитьЗагрузкуЧастями(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "fileChunked.mp3";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Содержимое = ПараметрыФункции["Audio"]; // URL, Путь или Двоичные данные
    Содержимое = OPI_ЗапросыHTTP.Get(Содержимое);

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ИнициализироватьЗагрузкуЧастями", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗавершитьЗагрузкуЧастями", "Начало"); // SKIP

    IDЗагрузки    = Результат["response"]["InitiateMultipartUploadResult"]["UploadId"];
    ОбщийРазмер   = Содержимое.Размер();
    РазмерУчастка = 5242880;
    ПрочитаноБайт = 0;
    НомерЧасти    = 1;

    ЧтениеДанных  = Новый ЧтениеДанных(Содержимое);
    ИсходныйПоток = ЧтениеДанных.ИсходныйПоток();
    МассивТегов   = Новый Массив;

    Пока ПрочитаноБайт < ОбщийРазмер Цикл

        ТекущееЧтение = ЧтениеДанных.Прочитать(РазмерУчастка);
        ТекущиеДанные = ТекущееЧтение.ПолучитьДвоичныеДанные();

        Если ТекущиеДанные.Размер() = 0 Тогда
            Прервать;
        КонецЕсли;

        Результат = OPI_S3.ЗагрузитьЧастьОбъекта(Наименование
            , Бакет
            , ОсновныеДанные
            , IDЗагрузки
            , НомерЧасти
            , ТекущиеДанные
            , Каталог);

        OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗавершитьЗагрузкуЧастями", "Часть"); // SKIP

        ПрочитаноБайт = ИсходныйПоток.ТекущаяПозиция();

        ETag = Результат["headers"]["Etag"];
        ETag = ?(ETag = Неопределено, Результат["headers"]["ETag"], ETag);

        МассивТегов.Добавить(ETag);

        НомерЧасти = НомерЧасти + 1;

    КонецЦикла;

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("upload", IDЗагрузки);
    Опции.Вставить("tags", МассивТегов);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ЗавершитьЗагрузкуЧастями", Опции);
    // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗавершитьЗагрузкуЧастями");

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные);

КонецПроцедуры

Процедура S3_ЗагрузитьЧастьОбъекта(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "fileChunked.mp3";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Содержимое = ПараметрыФункции["Audio"]; // URL, Путь или Двоичные данные
    Содержимое = OPI_ЗапросыHTTP.Get(Содержимое);

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ИнициализироватьЗагрузкуЧастями", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗагрузитьЧастьОбъекта", "Начало"); // SKIP

    IDЗагрузки    = Результат["response"]["InitiateMultipartUploadResult"]["UploadId"];
    ОбщийРазмер   = Содержимое.Размер();
    РазмерУчастка = 5242880;
    ПрочитаноБайт = 0;
    НомерЧасти    = 1;

    ЧтениеДанных  = Новый ЧтениеДанных(Содержимое);
    ИсходныйПоток = ЧтениеДанных.ИсходныйПоток();
    МассивТегов   = Новый Массив;

    Пока ПрочитаноБайт < ОбщийРазмер Цикл

        ТекущееЧтение = ЧтениеДанных.Прочитать(РазмерУчастка);
        ТекущиеДанные = ТекущееЧтение.ПолучитьДвоичныеДанные();

        Если ТекущиеДанные.Размер() = 0 Тогда
            Прервать;
        КонецЕсли;

        Результат = OPI_S3.ЗагрузитьЧастьОбъекта(Наименование
            , Бакет
            , ОсновныеДанные
            , IDЗагрузки
            , НомерЧасти
            , ТекущиеДанные
            , Каталог);

        // ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

        OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗагрузитьЧастьОбъекта"); // SKIP

        ПрочитаноБайт = ИсходныйПоток.ТекущаяПозиция();

        ETag = Результат["headers"]["Etag"];
        ETag = ?(ETag = Неопределено, Результат["headers"]["ETag"], ETag);

        МассивТегов.Добавить(ETag);

        НомерЧасти = НомерЧасти + 1;

    КонецЦикла;

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("upload", IDЗагрузки);
    Опции.Вставить("tags", МассивТегов);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ЗавершитьЗагрузкуЧастями", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ЗагрузитьЧастьОбъекта", "Завершение"); // SKIP

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные);

КонецПроцедуры

Процедура S3_ОтменитьЗагрузкуЧастями(ПараметрыФункции)

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "fileChunked.mp3";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("dir", Каталог);

    Начало = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ИнициализироватьЗагрузкуЧастями", Опции);
    IDЗагрузки = Начало["response"]["InitiateMultipartUploadResult"]["UploadId"];

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("upload", IDЗагрузки);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ОтменитьЗагрузкуЧастями", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ОтменитьЗагрузкуЧастями");

КонецПроцедуры

Процедура S3_ПолучитьСсылкуСкачиванияОбъекта(ПараметрыФункции)

    Картинка          = ПараметрыФункции["Picture"];          // SKIP
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // SKIP
    НеобходимыйРазмер = Картинка.Размер();                    // SKIP

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "picture.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = ПараметрыФункции["S3_DB"];
    Бакет = ?(Каталог, ПараметрыФункции["S3_DB"], ПараметрыФункции["S3_GPB"]); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("expires", 7200);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСсылкуСкачиванияОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьСсылкуСкачиванияОбъекта");

    Результат = OPI_ЗапросыHTTP.Get(Результат);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьСсылкуСкачиванияОбъекта", "Проверка", НеобходимыйРазмер);

КонецПроцедуры

Процедура S3_ПолучитьСсылкуЗагрузкиОбъекта(ПараметрыФункции)

    Картинка          = ПараметрыФункции["Picture"];          // SKIP
    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(Картинка); // SKIP
    НеобходимыйРазмер = Картинка.Размер();                    // SKIP

    URL       = ПараметрыФункции["S3_URL"];
    AccessKey = ПараметрыФункции["S3_AccessKey"];
    SecretKey = ПараметрыФункции["S3_SecretKey"];
    Region    = "BTC";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("access", AccessKey);
    Опции.Вставить("secret", SecretKey);
    Опции.Вставить("region", Region);

    ОсновныеДанные = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСтруктуруДанных", Опции);

    Наименование = "pictureU.jpg";

    Каталог = Истина; // Формирование URL в path-style
    Каталог = ПараметрыФункции["Directory"]; // SKIP

    Бакет = "newbucket2";

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);
    Опции.Вставить("expires", 7200);
    Опции.Вставить("dir", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьСсылкуЗагрузкиОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьСсылкуЗагрузкиОбъекта");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать(Результат)
        .УстановитьДвоичноеТело(Картинка)
        .ОбработатьЗапрос("PUT");

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "S3", "ПолучитьСсылкуЗагрузкиОбъекта", "Загрузка");

    Опции = Новый Структура;
    Опции.Вставить("name", Наименование);
    Опции.Вставить("bucket", Бакет);
    Опции.Вставить("basic", ОсновныеДанные);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("s3", "ПолучитьОписаниеОбъекта", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Проверка, "S3", "ПолучитьСсылкуЗагрузкиОбъекта", "Проверка", НеобходимыйРазмер);

    OPI_S3.УдалитьОбъект(Наименование, Бакет, ОсновныеДанные);

КонецПроцедуры

#КонецОбласти // S3

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции


#Region Alternate

Procedure AWS_CommonMethods() Export
    AWS_ОбщиеМетоды();
EndProcedure

Procedure AWS_BucketsManagement() Export
    AWS_РаботаСБакетами();
EndProcedure

Procedure AWS_ObjectsManagement() Export
    AWS_РаботаСОбъектами();
EndProcedure

#EndRegion
