// OneScript: ./OInt/tests/Modules/OPIt_Twitter.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

#Использовать oint
#Использовать asserts
#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯкс("Twitter");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертс("Twitter");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область Twitter

Процедура Твиттер_ДанныеАккаунта() Экспорт

    ПараметрыТеста = Новый Структура;

    Twitter_ПолучитьТокен(ПараметрыТеста);
    Twitter_ПолучитьСсылкуАвторизации(ПараметрыТеста);
    // !DISABLED! Twitter_ОбновитьТокен(ПараметрыТеста);

КонецПроцедуры

Процедура Твиттер_Твиты() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GIF"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video"   , ПараметрыТеста);

    Twitter_СоздатьТекстовыйТвит(ПараметрыТеста);
    Twitter_ЗагрузитьМассивВложений(ПараметрыТеста);
    Twitter_СоздатьТвитВидео(ПараметрыТеста);
    Twitter_СоздатьТвитКартинки(ПараметрыТеста);
    Twitter_СоздатьТвитГифки(ПараметрыТеста);
    Twitter_СоздатьТвитОпрос(ПараметрыТеста);
    Twitter_СоздатьПроизвольныйТвит(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // Twitter

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыАвторизацииТвиттер()

    Параметры = Новый Соответствие;

    ТокенСервера = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Access_Token");

    URL = OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_TokenURL");

    Результат = OPI_ЗапросыHTTP.НовыйЗапрос()
        .Инициализировать()
        .УстановитьURL(URL)
        .ДобавитьBearerАвторизацию(ТокенСервера) // <---
        .ОбработатьЗапрос("GET")
        .ВернутьОтветКакJSONКоллекцию();

    Токен = Результат["data"];

    Параметры.Вставить("redirect_uri"      , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_Redirect"));
    Параметры.Вставить("client_id"         , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_ClientID"));
    Параметры.Вставить("client_secret"     , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_ClientSecret"));
    Параметры.Вставить("access_token"      , Токен);
    Параметры.Вставить("refresh_token"     , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_Refresh"));
    Параметры.Вставить("oauth_token"       , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_OAuthToken"));
    Параметры.Вставить("oauth_token_secret", OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_OAuthSecret"));

    Параметры.Вставить("oauth_consumer_key"   , OPI_ПолучениеДанныхТестов.ПолучитьПараметр("Twitter_OAuthConsumerKey"));
    Параметры.Вставить("oauth_consumer_secret", OPI_ПолучениеДанныхТестов.ПолучитьПараметр(
        "Twitter_OAuthConsumerSecret"));

    Возврат Параметры;

КонецФункции

#Область АтомарныеТесты

#Область Twitter

Процедура Twitter_ПолучитьТокен(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Код       = "123456";

    Результат = OPI_Twitter.ПолучитьТокен(Код, Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "ПолучитьТокен");

КонецПроцедуры

Процедура Twitter_ПолучитьСсылкуАвторизации(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Результат = OPI_Twitter.ПолучитьСсылкуАвторизации(Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "ПолучитьСсылкуАвторизации");

КонецПроцедуры

Процедура Twitter_ОбновитьТокен(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Результат = OPI_Twitter.ОбновитьТокен(Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "ОбновитьТокен");

КонецПроцедуры

Процедура Twitter_СоздатьТекстовыйТвит(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);

    Результат = OPI_Twitter.СоздатьТекстовыйТвит(Текст, Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТекстовыйТвит", , Текст);

КонецПроцедуры

Процедура Twitter_СоздатьТвитКартинки(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);

    Картинка  = ПараметрыФункции["Picture"];  // URL, Двоичные или Путь к файлу
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Двоичные или Путь к файлу

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка);
    МассивКартинок.Добавить(Картинка2);

    Результат = OPI_Twitter.СоздатьТвитКартинки(Текст, МассивКартинок, Параметры);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитКартинки", , Текст); // SKIP

    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитКартинки(Текст, Картинка, Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитКартинки", "Одиночная", Текст);

    Картинка = OPI_ЗапросыHTTP.Get(Картинка);

    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитКартинки(Текст, Картинка, Параметры);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитКартинки", "Двоичные", Текст);

КонецПроцедуры

Процедура Twitter_СоздатьТвитВидео(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);

    Видео  = ПараметрыФункции["Video"]; // URL, Двоичные или Путь к файлу
    Видео2 = ПараметрыФункции["Video"]; // URL, Двоичные или Путь к файлу

    МассивВидео = Новый Массив;
    МассивВидео.Добавить(Видео);
    МассивВидео.Добавить(Видео2);

    Результат = OPI_Twitter.СоздатьТвитВидео(Текст, МассивВидео, Параметры);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитВидео", , Текст); // SKIP

    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитВидео(Текст, Видео, Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитВидео", "Одиночная", Текст);

    Видео = OPI_ЗапросыHTTP.Get(Видео);

    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитВидео(Текст, Видео, Параметры);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитВидео", "Двоичные", Текст);

КонецПроцедуры

Процедура Twitter_СоздатьТвитГифки(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);

    Гифка  = ПараметрыФункции["GIF"]; // URL, Двоичные или Путь к файлу
    Гифка2 = ПараметрыФункции["GIF"]; // URL, Двоичные или Путь к файлу

    МассивГифок = Новый Массив;
    МассивГифок.Добавить(Гифка);
    МассивГифок.Добавить(Гифка2);

    Результат = OPI_Twitter.СоздатьТвитГифки(Текст, МассивГифок, Параметры);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитГифки", , Текст); // SKIP

    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитГифки(Текст, Гифка, Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитГифки", "Одиночная", Текст);

    Гифка = OPI_ЗапросыHTTP.Get(Гифка);

    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);
    Результат = OPI_Twitter.СоздатьТвитГифки(Текст, Гифка, Параметры);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитГифки", "Двоичные", Текст);

КонецПроцедуры

Процедура Twitter_СоздатьТвитОпрос(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);

    МассивОтветов = Новый Массив;
    МассивОтветов.Добавить("Вариант 1");
    МассивОтветов.Добавить("Вариант 2");

    Результат = OPI_Twitter.СоздатьТвитОпрос(Текст, МассивОтветов, 60, Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьТвитОпрос", , Текст);

КонецПроцедуры

Процедура Twitter_СоздатьПроизвольныйТвит(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();
    Текст     = "Тестовый твит" + Строка(Новый УникальныйИдентификатор);

    Картинка1 = ПараметрыФункции["Picture"];  // URL, Двоичные данные или Путь к файлу
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Двоичные данные или Путь к файлу

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка1);
    МассивКартинок.Добавить(Картинка2);

    МассивМедиа = OPI_Twitter.ЗагрузитьМассивВложений(МассивКартинок, "tweet_image", Параметры);
    Результат   = OPI_Twitter.СоздатьПроизвольныйТвит(Текст, МассивМедиа, , , Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "СоздатьПроизвольныйТвит", , Текст);

КонецПроцедуры

Процедура Twitter_ЗагрузитьМассивВложений(ПараметрыФункции)

    Параметры = ПолучитьПараметрыАвторизацииТвиттер();

    Картинка1 = ПараметрыФункции["Picture"];  // URL, Двоичные данные или Путь к файлу
    Картинка2 = ПараметрыФункции["Picture2"]; // URL, Двоичные данные или Путь к файлу

    МассивКартинок = Новый Массив;
    МассивКартинок.Добавить(Картинка1);
    МассивКартинок.Добавить(Картинка2);

    Результат = OPI_Twitter.ЗагрузитьМассивВложений(МассивКартинок, "tweet_image", Параметры);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Twitter", "ЗагрузитьМассивВложений");

КонецПроцедуры

#КонецОбласти // Twitter

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure TwitterAPI_AccountData() Export
    Твиттер_ДанныеАккаунта();
EndProcedure

Procedure TwitterAPI_Tweets() Export
    Твиттер_Твиты();
EndProcedure

#EndRegion