// OneScript: ./OInt/tests/Modules/OPItc_ReportPortal.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

#Использовать "../../tools/main"
#Использовать "../../tools/http"
#Использовать "../../api"
#Использовать asserts
#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_СписокТестовКлиентСервер.СформироватьТестыЯксCLI("ReportPortal");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("ReportPortal");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область ReportPortal

Процедура RPortal_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_URL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_Login"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_Password", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_UserID"  , ПараметрыТеста);

    ReportPortal_ПолучитьВременныйТокен(ПараметрыТеста);
    ReportPortal_ПолучитьПостоянныйТокен(ПараметрыТеста);
    ReportPortal_УдалитьПостоянныйТокен(ПараметрыТеста);
    ReportPortal_ПолучитьТокеныПользователя(ПараметрыТеста);

КонецПроцедуры

Процедура RPortal_УправлениеТестами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_TempToken", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_URL"      , ПараметрыТеста);

    ReportPortal_СоздатьЗапуск(ПараметрыТеста);
    ReportPortal_ПолучитьЗапуск(ПараметрыТеста);
    ReportPortal_ПолучитьЭлементыЗапуска(ПараметрыТеста);
    ReportPortal_ИзменитьЗапуск(ПараметрыТеста);
    ReportPortal_СоздатьЭлемент(ПараметрыТеста);
    ReportPortal_ПолучитьЭлемент(ПараметрыТеста);
    ReportPortal_ПолучитьЛогиЭлемента(ПараметрыТеста);
    ReportPortal_ИзменитьЭлемент(ПараметрыТеста);
    ReportPortal_ЗавершитьЭлемент(ПараметрыТеста);
    ReportPortal_ЗавершитьЗапуск(ПараметрыТеста);
    ReportPortal_УдалитьЭлемент(ПараметрыТеста);
    ReportPortal_ПолучитьОтчетЗапуска(ПараметрыТеста);
    ReportPortal_УдалитьЗапуск(ПараметрыТеста);
    ReportPortal_ПолучитьСтруктуруЗапуска(ПараметрыТеста);
    ReportPortal_ПолучитьСтруктуруЭлемента(ПараметрыТеста);
    ReportPortal_ПолучитьСтруктуруЗавершенияЭлемента(ПараметрыТеста);
    ReportPortal_ПолучитьСтруктуруЗавершенияЗапуска(ПараметрыТеста);

КонецПроцедуры

Процедура RPortal_ЗаписьЛогов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_TempToken", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_URL"      , ПараметрыТеста);

    ReportPortal_СоздатьЗапуск(ПараметрыТеста);
    ReportPortal_СоздатьЭлемент(ПараметрыТеста);

    ReportPortal_ЗаписатьЛог(ПараметрыТеста);
    ReportPortal_ПолучитьСтруктуруЛога(ПараметрыТеста);
    ReportPortal_ПолучитьЛог(ПараметрыТеста);
    ReportPortal_УдалитьЛог(ПараметрыТеста);

    ReportPortal_ЗавершитьЭлемент(ПараметрыТеста);
    ReportPortal_ЗавершитьЗапуск(ПараметрыТеста);

КонецПроцедуры

Процедура RPortal_УправлениеПроектами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_TempToken", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_URL"      , ПараметрыТеста);

    ReportPortal_СоздатьПроект(ПараметрыТеста);
    ReportPortal_ПолучитьПроект(ПараметрыТеста);
    ReportPortal_ПолучитьПроекты(ПараметрыТеста);
    ReportPortal_ДобавитьПользователейВПроект(ПараметрыТеста);
    ReportPortal_ИсключитьПользователейИзПроекта(ПараметрыТеста);
    ReportPortal_УдалитьПроект(ПараметрыТеста);

КонецПроцедуры

Процедура RPortal_УправлениеПользователями() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_TempToken", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("RPortal_URL"      , ПараметрыТеста);

    ReportPortal_СоздатьПользователя(ПараметрыТеста);
    ReportPortal_ПолучитьТекущегоПользователя(ПараметрыТеста);
    ReportPortal_ПолучитьПользователя(ПараметрыТеста);
    ReportPortal_ПолучитьПользователей(ПараметрыТеста);
    ReportPortal_ПолучитьПроектыПользователя(ПараметрыТеста);
    ReportPortal_ИзменитьПользователя(ПараметрыТеста);
    ReportPortal_УдалитьПользователя(ПараметрыТеста);
    ReportPortal_ПолучитьСтруктуруПользователя(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // ReportPortal

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область ReportPortal

Процедура ReportPortal_ПолучитьВременныйТокен(ПараметрыФункции)

    URL    = ПараметрыФункции["RPortal_URL"];
    Логин  = ПараметрыФункции["RPortal_Login"];
    Пароль = ПараметрыФункции["RPortal_Password"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьВременныйТокен", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьВременныйТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_ПолучитьПостоянныйТокен(ПараметрыФункции)

    URL            = ПараметрыФункции["RPortal_URL"];
    Токен          = ПараметрыФункции["RPortal_TempToken"];
    IDПользователя = ПараметрыФункции["RPortal_UserID"];
    ИмяКлюча       = "test_key_2";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("user", IDПользователя);
    Опции.Вставить("name", ИмяКлюча);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьПостоянныйТокен", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьПостоянныйТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_УдалитьПостоянныйТокен(ПараметрыФункции)

    URL            = ПараметрыФункции["RPortal_URL"];
    Токен          = ПараметрыФункции["RPortal_TestApiKey"];
    IDПользователя = ПараметрыФункции["RPortal_UserID"];
    IDКлюча        = ПараметрыФункции["RPortal_TestKeyID"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("user", IDПользователя);
    Опции.Вставить("id", IDКлюча);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "УдалитьПостоянныйТокен", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "УдалитьПостоянныйТокен");

КонецПроцедуры

Процедура ReportPortal_ПолучитьТокеныПользователя(ПараметрыФункции)

    URL            = ПараметрыФункции["RPortal_URL"];
    Токен          = ПараметрыФункции["RPortal_TempToken"];
    IDПользователя = ПараметрыФункции["RPortal_UserID"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("user", IDПользователя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьТокеныПользователя", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьТокеныПользователя");

КонецПроцедуры

Процедура ReportPortal_СоздатьЗапуск(ПараметрыФункции)

    URL    = ПараметрыФункции["RPortal_URL"];
    Токен  = ПараметрыФункции["RPortal_TempToken"];
    Проект = "Test";

    ДатаНачала = Дата("20260101100000");

    СтруктураЗапуска = Новый Структура;
    СтруктураЗапуска.Вставить("name"       , "Test");
    СтруктураЗапуска.Вставить("startTime"  , ДатаНачала);
    СтруктураЗапуска.Вставить("description", "Test launch");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("params", СтруктураЗапуска);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "СоздатьЗапуск", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "СоздатьЗапуск", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_ЗавершитьЗапуск(ПараметрыФункции)

    URL       = ПараметрыФункции["RPortal_URL"];
    Токен     = ПараметрыФункции["RPortal_TempToken"];
    IDЗапуска = ПараметрыФункции["RPortal_TestLaunch"];
    Проект    = "Test";

    ДатаЗавершения      = Дата("20260101200000");
    Опции = Новый Структура;
    Опции.Вставить("end", ДатаЗавершения);
    Опции.Вставить("status", "passed");
    Опции.Вставить("descr", "Updated launch description");

    СтруктураЗавершения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЗавершенияЗапуска", Опции);

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("uuid", IDЗапуска);
    Опции.Вставить("params", СтруктураЗавершения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ЗавершитьЗапуск", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ЗавершитьЗапуск");

КонецПроцедуры

Процедура ReportPortal_СоздатьЭлемент(ПараметрыФункции)

    URL       = ПараметрыФункции["RPortal_URL"];
    Токен     = ПараметрыФункции["RPortal_TempToken"];
    IDЗапуска = ПараметрыФункции["RPortal_TestLaunch"];
    Проект    = "Test";

    ДатаНачала = Дата("20260101100000");

    СтруктураЭлемента = Новый Структура;
    СтруктураЭлемента.Вставить("name"       , "Test");
    СтруктураЭлемента.Вставить("startTime"  , ДатаНачала);
    СтруктураЭлемента.Вставить("type"       , "test");
    СтруктураЭлемента.Вставить("description", "Test launch");
    СтруктураЭлемента.Вставить("launchUuid" , IDЗапуска);

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("params", СтруктураЭлемента);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "СоздатьЭлемент", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "СоздатьЭлемент", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_ЗавершитьЭлемент(ПараметрыФункции)

    URL        = ПараметрыФункции["RPortal_URL"];
    Токен      = ПараметрыФункции["RPortal_TempToken"];
    IDЭлемента = ПараметрыФункции["RPortal_TestItem"];
    Проект     = "Test";

    ДатаЗавершения = Дата("20260101200000");

    СтруктураЗавершения = Новый Структура;
    СтруктураЗавершения.Вставить("endTime", ДатаЗавершения);
    СтруктураЗавершения.Вставить("status" , "passed");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("uuid", IDЭлемента);
    Опции.Вставить("params", СтруктураЗавершения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ЗавершитьЭлемент", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ЗавершитьЭлемент");

КонецПроцедуры

Процедура ReportPortal_ПолучитьСтруктуруЗапуска(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЗапуска", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруЗапуска");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЗапуска", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруЗапуска", "Пустая");

КонецПроцедуры

Процедура ReportPortal_ПолучитьСтруктуруЭлемента(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЭлемента", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруЭлемента");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЭлемента", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруЭлемента", "Пустая");

КонецПроцедуры

Процедура ReportPortal_ПолучитьСтруктуруЗавершенияЭлемента(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЗавершенияЭлемента", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруЗавершенияЭлемента");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЗавершенияЭлемента", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруЗавершенияЭлемента", "Пустая");

КонецПроцедуры

Процедура ReportPortal_ПолучитьСтруктуруЗавершенияЗапуска(ПараметрыФункции)

    Время    = Дата("20260101100000");
    Статус   = "passed";
    Описание = "Some test";
    Атрибуты = "key1:value1, key2:value2";

    Опции = Новый Структура;
    Опции.Вставить("end", Время);
    Опции.Вставить("status", Статус);
    Опции.Вставить("descr", Описание);
    Опции.Вставить("attr", Атрибуты);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЗавершенияЗапуска", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруЗавершенияЗапуска");

КонецПроцедуры

Процедура ReportPortal_ЗаписатьЛог(ПараметрыФункции)

    URL        = ПараметрыФункции["RPortal_URL"];
    Токен      = ПараметрыФункции["RPortal_TempToken"];
    IDЗапуска  = ПараметрыФункции["RPortal_TestLaunch"];
    IDЭлемента = ПараметрыФункции["RPortal_TestItem"];
    Проект     = "Test";
    Время      = Дата("20260101100010");
    Текст      = "Some log 1";

    Опции = Новый Структура;
    Опции.Вставить("launch", IDЗапуска);
    Опции.Вставить("id", IDЭлемента);
    Опции.Вставить("time", Время);
    Опции.Вставить("text", Текст);

    СтруктураЛога = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЛога", Опции);
    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("params", СтруктураЛога);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ЗаписатьЛог", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ЗаписатьЛог", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_ПолучитьСтруктуруЛога(ПараметрыФункции)

    URL        = ПараметрыФункции["RPortal_URL"];
    Токен      = ПараметрыФункции["RPortal_TempToken"];
    IDЗапуска  = ПараметрыФункции["RPortal_TestLaunch"];
    IDЭлемента = ПараметрыФункции["RPortal_TestItem"];
    Проект     = "Test";
    Время      = Дата("20260101100010");
    Текст      = "Some log";

    Опции = Новый Структура;
    Опции.Вставить("launch", IDЗапуска);
    Опции.Вставить("id", IDЭлемента);
    Опции.Вставить("time", Время);
    Опции.Вставить("text", Текст);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруЛога", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруЛога");

КонецПроцедуры

Процедура ReportPortal_ПолучитьЛог(ПараметрыФункции)

    URL      = ПараметрыФункции["RPortal_URL"];
    Токен    = ПараметрыФункции["RPortal_TempToken"];
    UUIDЛога = ПараметрыФункции["RPortal_TestLog"];
    Проект   = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("uuid", UUIDЛога);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьЛог", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьЛог", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_УдалитьЛог(ПараметрыФункции)

    URL    = ПараметрыФункции["RPortal_URL"];
    Токен  = ПараметрыФункции["RPortal_TempToken"];
    IDЛога = ПараметрыФункции["RPortal_TestLogId"];
    Проект = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("id", IDЛога);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "УдалитьЛог", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "УдалитьЛог");

КонецПроцедуры

Процедура ReportPortal_СоздатьПроект(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];
    Имя   = "testproject";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("name", Имя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "СоздатьПроект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "СоздатьПроект", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_УдалитьПроект(ПараметрыФункции)

    URL       = ПараметрыФункции["RPortal_URL"];
    Токен     = ПараметрыФункции["RPortal_TempToken"];
    IDПроекта = ПараметрыФункции["RPortal_TestProject"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("id", IDПроекта);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "УдалитьПроект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "УдалитьПроект");

КонецПроцедуры

Процедура ReportPortal_ПолучитьПроект(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];
    Имя   = "TestProject";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("name", Имя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьПроект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьПроект");

КонецПроцедуры

Процедура ReportPortal_ПолучитьПроекты(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьПроекты", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьПроекты");

КонецПроцедуры

Процедура ReportPortal_ДобавитьПользователейВПроект(ПараметрыФункции)

    URL        = ПараметрыФункции["RPortal_URL"];
    Токен      = ПараметрыФункции["RPortal_TempToken"];
    ИмяПроекта = "TestProject";

    СписокПользователей = Новый Соответствие;
    СписокПользователей.Вставить("default", "MEMBER");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", ИмяПроекта);
    Опции.Вставить("users", СписокПользователей);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ДобавитьПользователейВПроект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ДобавитьПользователейВПроект");

КонецПроцедуры

Процедура ReportPortal_ИсключитьПользователейИзПроекта(ПараметрыФункции)

    URL        = ПараметрыФункции["RPortal_URL"];
    Токен      = ПараметрыФункции["RPortal_TempToken"];
    ИмяПроекта = "TestProject";

    МассивПользователей = Новый Массив;
    МассивПользователей.Добавить("default");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", ИмяПроекта);
    Опции.Вставить("users", МассивПользователей);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ИсключитьПользователейИзПроекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ИсключитьПользователейИзПроекта");

КонецПроцедуры

Процедура ReportPortal_ПолучитьЗапуск(ПараметрыФункции)

    URL         = ПараметрыФункции["RPortal_URL"];
    Токен       = ПараметрыФункции["RPortal_TempToken"];
    UUIDЗапуска = ПараметрыФункции["RPortal_TestLaunch"];
    Проект      = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("uuid", UUIDЗапуска);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьЗапуск", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьЗапуск", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_ПолучитьЭлементыЗапуска(ПараметрыФункции)

    URL       = ПараметрыФункции["RPortal_URL"];
    Токен     = ПараметрыФункции["RPortal_TempToken"];
    IDЗапуска = ПараметрыФункции["RPortal_TestLaunchId"];
    Проект    = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("id", IDЗапуска);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьЭлементыЗапуска", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьЭлементыЗапуска");

КонецПроцедуры

Процедура ReportPortal_ПолучитьЭлемент(ПараметрыФункции)

    URL          = ПараметрыФункции["RPortal_URL"];
    Токен        = ПараметрыФункции["RPortal_TempToken"];
    UUIDЭлемента = ПараметрыФункции["RPortal_TestItem"];
    Проект       = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("uuid", UUIDЭлемента);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьЭлемент", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьЭлемент", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_ПолучитьЛогиЭлемента(ПараметрыФункции)

    URL        = ПараметрыФункции["RPortal_URL"];
    Токен      = ПараметрыФункции["RPortal_TempToken"];
    IDЭлемента = ПараметрыФункции["RPortal_TestItemId"];
    Проект     = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("item", IDЭлемента);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьЛогиЭлемента", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьЛогиЭлемента");

КонецПроцедуры

Процедура ReportPortal_ИзменитьЗапуск(ПараметрыФункции)

    URL       = ПараметрыФункции["RPortal_URL"];
    Токен     = ПараметрыФункции["RPortal_TempToken"];
    IDЗапуска = ПараметрыФункции["RPortal_TestLaunchId"];
    Проект    = "Test";

    СтруктураЗапуска = Новый Структура;
    СтруктураЗапуска.Вставить("description", "New description");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("id", IDЗапуска);
    Опции.Вставить("params", СтруктураЗапуска);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ИзменитьЗапуск", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ИзменитьЗапуск");

КонецПроцедуры

Процедура ReportPortal_ИзменитьЭлемент(ПараметрыФункции)

    URL        = ПараметрыФункции["RPortal_URL"];
    Токен      = ПараметрыФункции["RPortal_TempToken"];
    IDЭлемента = ПараметрыФункции["RPortal_TestItemId"];
    Проект     = "Test";

    СтруктураЗапуска = Новый Структура;
    СтруктураЗапуска.Вставить("description", "New description");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("id", IDЭлемента);
    Опции.Вставить("params", СтруктураЗапуска);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ИзменитьЭлемент", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ИзменитьЭлемент");

КонецПроцедуры

Процедура ReportPortal_УдалитьЗапуск(ПараметрыФункции)

    URL       = ПараметрыФункции["RPortal_URL"];
    Токен     = ПараметрыФункции["RPortal_TempToken"];
    IDЗапуска = ПараметрыФункции["RPortal_TestLaunchId"];
    Проект    = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("id", IDЗапуска);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "УдалитьЗапуск", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "УдалитьЗапуск");

КонецПроцедуры

Процедура ReportPortal_УдалитьЭлемент(ПараметрыФункции)

    URL        = ПараметрыФункции["RPortal_URL"];
    Токен      = ПараметрыФункции["RPortal_TempToken"];
    IDЭлемента = ПараметрыФункции["RPortal_TestItemId"];
    Проект     = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("id", IDЭлемента);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "УдалитьЭлемент", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "УдалитьЭлемент");

КонецПроцедуры

Процедура ReportPortal_ПолучитьОтчетЗапуска(ПараметрыФункции)

    URL       = ПараметрыФункции["RPortal_URL"];
    Токен     = ПараметрыФункции["RPortal_TempToken"];
    IDЗапуска = ПараметрыФункции["RPortal_TestLaunchId"];
    Проект    = "Test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("proj", Проект);
    Опции.Вставить("id", IDЗапуска);
    Опции.Вставить("format", "html");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьОтчетЗапуска", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьОтчетЗапуска");

КонецПроцедуры

Процедура ReportPortal_СоздатьПользователя(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];
    Имя   = "testproject";

    СтруктураПользователя = Новый Структура;
    СтруктураПользователя.Вставить("active"        , Истина);
    СтруктураПользователя.Вставить("login"         , "test");
    СтруктураПользователя.Вставить("password"      , "G00d_Pass");
    СтруктураПользователя.Вставить("fullName"      , "Test User");
    СтруктураПользователя.Вставить("email"         , "test@example.com");
    СтруктураПользователя.Вставить("accountRole"   , "USER");
    СтруктураПользователя.Вставить("projectRole"   , "MEMBER");
    СтруктураПользователя.Вставить("defaultProject", "test");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("params", СтруктураПользователя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "СоздатьПользователя", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "СоздатьПользователя", , ПараметрыФункции);

КонецПроцедуры

Процедура ReportPortal_УдалитьПользователя(ПараметрыФункции)

    URL            = ПараметрыФункции["RPortal_URL"];
    Токен          = ПараметрыФункции["RPortal_TempToken"];
    IDПользователя = ПараметрыФункции["RPortal_TestUser"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("id", IDПользователя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "УдалитьПользователя", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "УдалитьПользователя");

КонецПроцедуры

Процедура ReportPortal_ПолучитьСтруктуруПользователя(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруПользователя", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруПользователя");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьСтруктуруПользователя", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьСтруктуруПользователя", "Пустая");

КонецПроцедуры

Процедура ReportPortal_ИзменитьПользователя(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];
    Логин = "test";

    СтруктураПользователя = Новый Структура;
    СтруктураПользователя.Вставить("fullName", "Updated Test User");
    СтруктураПользователя.Вставить("email"   , "updated@example.com");

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("login", Логин);
    Опции.Вставить("params", СтруктураПользователя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ИзменитьПользователя", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ИзменитьПользователя");

КонецПроцедуры

Процедура ReportPortal_ПолучитьТекущегоПользователя(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьТекущегоПользователя", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьТекущегоПользователя");

КонецПроцедуры

Процедура ReportPortal_ПолучитьПользователя(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];
    Логин = "test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("login", Логин);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьПользователя", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьПользователя");

КонецПроцедуры

Процедура ReportPortal_ПолучитьПользователей(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьПользователей", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьПользователей");

КонецПроцедуры

Процедура ReportPortal_ПолучитьПроектыПользователя(ПараметрыФункции)

    URL   = ПараметрыФункции["RPortal_URL"];
    Токен = ПараметрыФункции["RPortal_TempToken"];
    Логин = "test";

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("token", Токен);
    Опции.Вставить("login", Логин);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("rportal", "ПолучитьПроектыПользователя", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "ReportPortal", "ПолучитьПроектыПользователя");

КонецПроцедуры

#КонецОбласти // ReportPortal

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure RPortal_Authorization() Export
    RPortal_Авторизация();
EndProcedure

Procedure RPortal_TestManagement() Export
    RPortal_УправлениеТестами();
EndProcedure

Procedure RPortal_LogRecording() Export
    RPortal_ЗаписьЛогов();
EndProcedure

Procedure RPortal_ProjectManagement() Export
    RPortal_УправлениеПроектами();
EndProcedure

Procedure RPortal_UserManagement() Export
    RPortal_УправлениеПользователями();
EndProcedure

#EndRegion
