// OneScript: ./OInt/tests/Modules/OPItc_GoogleDrive.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

#Использовать "../../tools/main"
#Использовать "../../tools/http"
#Использовать "../../api"
#Использовать asserts
#Использовать "internal"

// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_СписокТестовКлиентСервер.СформироватьТестыЯксCLI("GoogleDrive");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("GoogleDrive");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область GoogleDrive

Процедура ГД_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ClientSecret", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Code"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Refresh"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_ServiceData" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Access_Token"       , ПараметрыТеста);

    GoogleDrive_СформироватьСсылкуПолученияКода(ПараметрыТеста);
    GoogleDrive_ПолучитьТокенПоКоду(ПараметрыТеста);
    GoogleDrive_ОбновитьТокен(ПараметрыТеста);
    GoogleDrive_ПолучитьТокенServiceАккаунта(ПараметрыТеста);

КонецПроцедуры

Процедура ГД_ПолучитьСписокКаталогов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);

    GoogleDrive_ПолучитьСписокКаталогов(ПараметрыТеста);
    GoogleDrive_ПолучитьИнформациюОбОбъекте(ПараметрыТеста);

КонецПроцедуры

Процедура ГД_ЗагрузитьУдалитьФайл() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GD_Catalog"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture2"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Big"         , ПараметрыТеста);

    ПараметрыТеста.Вставить("МассивУдаляемых", Новый Массив);

    GoogleDrive_ЗагрузитьФайл(ПараметрыТеста);
    GoogleDrive_СкопироватьОбъект(ПараметрыТеста);
    GoogleDrive_СкачатьФайл(ПараметрыТеста);
    GoogleDrive_ОбновитьФайл(ПараметрыТеста);
    GoogleDrive_ПолучитьСписокФайлов(ПараметрыТеста);
    GoogleDrive_УдалитьОбъект(ПараметрыТеста);
    GoogleDrive_ПолучитьОписаниеФайла(ПараметрыТеста);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ГД_СоздатьУдалитьКомментарий() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GD_Catalog"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"     , ПараметрыТеста);

    ПараметрыТеста.Вставить("МассивУдаляемых", Новый Массив);

    GoogleDrive_ЗагрузитьФайл(ПараметрыТеста);

    GoogleDrive_СоздатьКомментарий(ПараметрыТеста);
    GoogleDrive_ПолучитьКомментарий(ПараметрыТеста);
    GoogleDrive_ПолучитьСписокКомментариев(ПараметрыТеста);
    GoogleDrive_УдалитьКомментарий(ПараметрыТеста);

    GoogleDrive_УдалитьОбъект(ПараметрыТеста);

КонецПроцедуры

Процедура ГД_СоздатьКаталог() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Google_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GD_Catalog"  , ПараметрыТеста);

    GoogleDrive_СоздатьПапку(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // GoogleDrive

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область GoogleDrive

Процедура GoogleDrive_СформироватьСсылкуПолученияКода(ПараметрыФункции)

    ClientID  = ПараметрыФункции["Google_ClientID"];
    Опции = Новый Структура;
    Опции.Вставить("id", ClientID);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "СформироватьСсылкуПолученияКода", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "СформироватьСсылкуПолученияКода");

КонецПроцедуры

Процедура GoogleDrive_ПолучитьТокенПоКоду(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    Code         = ПараметрыФункции["Google_Code"];

    Опции = Новый Структура;
    Опции.Вставить("id", ClientID);
    Опции.Вставить("secret", ClientSecret);
    Опции.Вставить("code", Code);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьТокенПоКоду", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ПолучитьТокенПоКоду");

КонецПроцедуры

Процедура GoogleDrive_ОбновитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["Google_ClientID"];
    ClientSecret = ПараметрыФункции["Google_ClientSecret"];
    RefreshToken = ПараметрыФункции["Google_Refresh"];

    Опции = Новый Структура;
    Опции.Вставить("id", ClientID);
    Опции.Вставить("secret", ClientSecret);
    Опции.Вставить("refresh", RefreshToken);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ОбновитьТокен", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ОбновитьТокен");

КонецПроцедуры

Процедура GoogleDrive_ПолучитьТокенServiceАккаунта(ПараметрыФункции)

    Данные = ПараметрыФункции["Google_ServiceData"]; // URL, двоичные данные, файл или коллекция

    Токен  = ПараметрыФункции["Access_Token"];  // SKIP
    Данные = OPI_ЗапросыHTTP                    // SKIP
        .НовыйЗапрос()                          // SKIP
        .Инициализировать(Данные)               // SKIP
        .ДобавитьBearerАвторизацию(Токен)       // SKIP
        .ОбработатьЗапрос("GET")                // SKIP
        .ВернутьОтветКакДвоичныеДанные();       // SKIP

    ОбластиДействия = Новый Массив;
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/calendar");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/drive");
    ОбластиДействия.Добавить("https://www.googleapis.com/auth/spreadsheets");

    Опции = Новый Структура;
    Опции.Вставить("auth", Данные);
    Опции.Вставить("scope", ОбластиДействия);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьТокенServiceАккаунта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ПолучитьТокенServiceАккаунта");

КонецПроцедуры

Процедура GoogleDrive_ПолучитьСписокКаталогов(ПараметрыФункции)

    Имя   = "Тестовая папка";
    Токен = ПараметрыФункции["Google_Token"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("query", Имя);
    Опции.Вставить("depth", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьСписокКаталогов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ПолучитьСписокКаталогов", , ПараметрыФункции);

КонецПроцедуры

Процедура GoogleDrive_ПолучитьИнформациюОбОбъекте(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_Catalog"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьИнформациюОбОбъекте", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ПолучитьИнформациюОбОбъекте");

КонецПроцедуры

Процедура GoogleDrive_ЗагрузитьФайл(ПараметрыФункции)

    Токен    = ПараметрыФункции["Google_Token"];
    Каталог  = ПараметрыФункции["GD_Catalog"];
    Картинка = ПараметрыФункции["Picture"];      // URL, Двоичные данные или Путь к файлу

    Пустая   = Ложь;
    Опции = Новый Структура;
    Опции.Вставить("empty", Пустая);

    Описание = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьОписаниеФайла", Опции);

    Описание.Вставить("Родитель", Каталог);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("file", Картинка);
    Опции.Вставить("props", Описание);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ЗагрузитьФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ЗагрузитьФайл", , ПараметрыФункции, Описание);

    Если Не OPI_Инструменты.ЭтоOneScript() И ПараметрыФункции.Свойство("Big")  Тогда

        БольшойФайл = ПараметрыФункции["Big"];
        Описание.Вставить("Имя", "big.rar");

        Опции = Новый Структура;
        Опции.Вставить("token", Токен);
        Опции.Вставить("file", БольшойФайл);
        Опции.Вставить("props", Описание);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ЗагрузитьФайл", Опции);

        OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ЗагрузитьФайл", "Большой", ПараметрыФункции, Описание);

        Опции = Новый Структура;
        Опции.Вставить("token", Токен);
        Опции.Вставить("object", Результат);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "СкачатьФайл", Опции);

        OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ЗагрузитьФайл", "Проверка", ПараметрыФункции, Описание);

    КонецЕсли;

КонецПроцедуры

Процедура GoogleDrive_СкопироватьОбъект(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];
    НовоеИмя      = "Скопированный файл.jpeg";
    НовыйРодитель = "root";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);
    Опции.Вставить("title", НовоеИмя);
    Опции.Вставить("catalog", НовыйРодитель);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "СкопироватьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "СкопироватьОбъект", , ПараметрыФункции, НовоеИмя);

КонецПроцедуры

Процедура GoogleDrive_СкачатьФайл(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "СкачатьФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "СкачатьФайл", , ПараметрыФункции);

КонецПроцедуры

Процедура GoogleDrive_ОбновитьФайл(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    НовоеИмя      = "Обновленный файл.jpg";
    Идентификатор = ПараметрыФункции["GD_File"];
    Файл          = ПараметрыФункции["Picture2"]; // URL, Двоичные данные или Путь к файлу

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);
    Опции.Вставить("file", Файл);
    Опции.Вставить("title", НовоеИмя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ОбновитьФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ОбновитьФайл", , НовоеИмя);

КонецПроцедуры

Процедура GoogleDrive_ПолучитьСписокФайлов(ПараметрыФункции)

    Токен       = ПараметрыФункции["Google_Token"];
    Каталог     = "root";
    ИмяСодержит = "data";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("query", ИмяСодержит);
    Опции.Вставить("catalog", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьСписокФайлов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ПолучитьСписокФайлов");

КонецПроцедуры

Процедура GoogleDrive_УдалитьОбъект(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "УдалитьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "УдалитьОбъект");

    Для Каждого Удаляемый Из ПараметрыФункции["МассивУдаляемых"] Цикл

        Результат = OPI_GoogleDrive.УдалитьОбъект(Токен, Удаляемый);

        OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "УдалитьОбъект", "Дополнительный");

        OPI_Инструменты.Пауза(2);

    КонецЦикла;

КонецПроцедуры

Процедура GoogleDrive_ПолучитьОписаниеФайла(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьОписаниеФайла", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ПолучитьОписаниеФайла");

КонецПроцедуры

Процедура GoogleDrive_СоздатьКомментарий(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];
    Комментарий   = "Текст комментария";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);
    Опции.Вставить("text", Комментарий);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "СоздатьКомментарий", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "СоздатьКомментарий", , ПараметрыФункции, Комментарий);

КонецПроцедуры

Процедура GoogleDrive_ПолучитьКомментарий(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];
    ИДКомментария = ПараметрыФункции["GD_Comment"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);
    Опции.Вставить("comment", ИДКомментария);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьКомментарий", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ПолучитьКомментарий");

КонецПроцедуры

Процедура GoogleDrive_ПолучитьСписокКомментариев(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "ПолучитьСписокКомментариев", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "ПолучитьСписокКомментариев");

КонецПроцедуры

Процедура GoogleDrive_УдалитьКомментарий(ПараметрыФункции)

    Токен         = ПараметрыФункции["Google_Token"];
    Идентификатор = ПараметрыФункции["GD_File"];
    ИДКомментария = ПараметрыФункции["GD_Comment"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("object", Идентификатор);
    Опции.Вставить("comment", ИДКомментария);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "УдалитьКомментарий", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "УдалитьКомментарий");

КонецПроцедуры

Процедура GoogleDrive_СоздатьПапку(ПараметрыФункции)

    Токен   = ПараметрыФункции["Google_Token"];
    Каталог = ПараметрыФункции["GD_Catalog"];
    Имя     = "Тестовая папка";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("title", Имя);
    Опции.Вставить("catalog", Каталог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "СоздатьПапку", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "СоздатьПапку");

    ИДКаталога = Результат["id"];
    OPI_GoogleDrive.УдалитьОбъект(Токен, ИДКаталога);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("title", Имя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("gdrive", "СоздатьПапку", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "GoogleDrive", "СоздатьПапку", "Корень");

    ИДКаталога = Результат["id"];
    OPI_GoogleDrive.УдалитьОбъект(Токен, ИДКаталога);

КонецПроцедуры

#КонецОбласти // GoogleDrive

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure GD_Authorization() Export
    ГД_Авторизация();
EndProcedure

Procedure GD_GetCatalogList() Export
    ГД_ПолучитьСписокКаталогов();
EndProcedure

Procedure GD_UploadDeleteFile() Export
    ГД_ЗагрузитьУдалитьФайл();
EndProcedure

Procedure GD_CreateDeleteComment() Export
    ГД_СоздатьУдалитьКомментарий();
EndProcedure

Procedure GD_CreateCatalog() Export
    ГД_СоздатьКаталог();
EndProcedure

#EndRegion
