// OneScript: ./OInt/tests/Modules/OPItc_LDAP.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

#Использовать "../../tools/main"
#Использовать "../../tools/http"
#Использовать "../../api"
#Использовать "../../formats"
#Использовать asserts
#Использовать "internal"

// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯксCLI("LDAP");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("LDAP");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область LDAP

Процедура LDAP_ОсновныеМетоды() Экспорт

    ПараметрыТеста = OPI_ПолучениеДанныхТестов.ПолучитьТестовыеДанные();
    LDAP_СформироватьПараметрыСоединения(ПараметрыТеста);
    LDAP_ОткрытьСоединение(ПараметрыТеста);
    LDAP_ПолучитьКонфигурациюСоединения(ПараметрыТеста);
    LDAP_ЗакрытьСоединение(ПараметрыТеста);
    LDAP_ЭтоКоннектор(ПараметрыТеста);
    LDAP_ПолучитьНастройкиTls(ПараметрыТеста);
    LDAP_ПолучитьНастройкиЛогирования(ПараметрыТеста);
    LDAP_ПолучитьЛог(ПараметрыТеста);

КонецПроцедуры

Процедура LDAP_РаботаСКаталогом() Экспорт

    ПараметрыТеста = OPI_ПолучениеДанныхТестов.ПолучитьТестовыеДанные();
    LDAP_ВыполнитьПоиск(ПараметрыТеста);
    LDAP_Добавить(ПараметрыТеста);
    LDAP_Изменить(ПараметрыТеста);
    LDAP_Сравнить(ПараметрыТеста);
    LDAP_Удалить(ПараметрыТеста);

КонецПроцедуры

Процедура LDAP_РасширеннаяПроверка() Экспорт

    OPI_ПолучениеДанныхТестов.УстановитьПризнакТестаCLI(Истина);

    Если OPI_ПолучениеДанныхТестов.ЭтоТестCLI() Тогда
        Сообщить("CLI SKIP");
        Возврат;
    КонецЕсли;

    ПараметрыТеста = OPI_ПолучениеДанныхТестов.ПолучитьТестовыеДанные();
    LDAP_Расширенная_ВыполнитьПоискБезПодключения(ПараметрыТеста);
    LDAP_Расширенная_ПовторноеПодключение(ПараметрыТеста);
    LDAP_Расширенная_ПолучитьЛогПриПодключении(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // LDAP

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область LDAP

Процедура LDAP_СформироватьПараметрыСоединения(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "СформироватьПараметрыСоединения");

КонецПроцедуры

Процедура LDAP_ОткрытьСоединение(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Результат           = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ОткрытьСоединение");

КонецПроцедуры

Процедура LDAP_ЗакрытьСоединение(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);
    Результат           = OPI_LDAP.ЗакрытьСоединение(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ЗакрытьСоединение");

КонецПроцедуры

Процедура LDAP_ЭтоКоннектор(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);
    Результат           = OPI_LDAP.ЭтоКоннектор(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ЭтоКоннектор");

КонецПроцедуры

Процедура LDAP_ПолучитьКонфигурациюСоединения(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);
    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "ПолучитьКонфигурациюСоединения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ПолучитьКонфигурациюСоединения");

КонецПроцедуры

Процедура LDAP_ПолучитьНастройкиTls(ПараметрыФункции)

    Опции = Новый Структура;
    Опции.Вставить("trust", Ложь);
    Опции.Вставить("cert", "");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "ПолучитьНастройкиTls", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ПолучитьНастройкиTls");

КонецПроцедуры

Процедура LDAP_ПолучитьНастройкиЛогирования(ПараметрыФункции)

    Результат = OPI_LDAP.ПолучитьНастройкиЛогирования(Истина, 100, ПолучитьИмяВременногоФайла());

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ПолучитьНастройкиЛогирования");

    Результат = OPI_LDAP.ПолучитьНастройкиЛогирования(Ложь, , ПолучитьИмяВременногоФайла());

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ПолучитьНастройкиЛогирования", "Файл");

    Результат = OPI_LDAP.ПолучитьНастройкиЛогирования(Истина);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ПолучитьНастройкиЛогирования", "Память");

КонецПроцедуры

Процедура LDAP_ПолучитьЛог(ПараметрыФункции)

    ФайлЛога             = ПолучитьИмяВременногоФайла("txt");
    НастройкиЛогирования = OPI_LDAP.ПолучитьНастройкиЛогирования(Истина, 100, ФайлЛога);

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения, , НастройкиЛогирования);

    Если Не OPI_LDAP.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение OPI_Инструменты.JSONСтрокой(Соединение);
    КонецЕсли;

    База      = "dc=example,dc=org";
    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("base", База);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "ВыполнитьПоиск", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ВыполнитьПоиск", "Select"); // SKIP

    Результат = OPI_LDAP.ПолучитьЛог(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ПолучитьЛог", , ФайлЛога);

    Результат = OPI_LDAP.ПолучитьЛог(Соединение, Истина);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ПолучитьЛог", "КакСтрока", ФайлЛога);

КонецПроцедуры

Процедура LDAP_ВыполнитьПоиск(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);
    База                = "dc=example,dc=org";
    Фильтр              = "(objectClass=*)";

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("base", База);
    Опции.Вставить("фильтр", Фильтр);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "ВыполнитьПоиск", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ВыполнитьПоиск");

    Опции = Новый Структура;
    Опции.Вставить("conn", ПараметрыСоединения);
    Опции.Вставить("base", База);
    Опции.Вставить("фильтр", Фильтр);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "ВыполнитьПоиск", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "ВыполнитьПоиск", "Без соединения");

КонецПроцедуры

Процедура LDAP_Добавить(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);
    DN                  = "cn=OPI Test User,dc=example,dc=org";

    OPI_LDAP.Удалить(Соединение, DN); // SKIP

    КлассыОбъекта = Новый Массив;
    КлассыОбъекта.Добавить("top");
    КлассыОбъекта.Добавить("person");
    КлассыОбъекта.Добавить("organizationalPerson");
    КлассыОбъекта.Добавить("inetOrgPerson");

    ИменаCN = Новый Массив;
    ИменаCN.Добавить("OPI Test User");

    Фамилии = Новый Массив;
    Фамилии.Добавить("User");

    Идентификаторы = Новый Массив;
    Идентификаторы.Добавить("opitest");

    Атрибуты = Новый Структура;
    Атрибуты.Вставить("objectClass", КлассыОбъекта);
    Атрибуты.Вставить("cn"         , ИменаCN);
    Атрибуты.Вставить("sn"         , Фамилии);
    Атрибуты.Вставить("uid"        , Идентификаторы);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("dn", DN);
    Опции.Вставить("attrs", Атрибуты);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "Добавить", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "Добавить");

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("base", DN);
    Опции.Вставить("фильтр", "(objectClass=*)");
    Опции.Вставить("scope", "base");

    РезультатПоиска = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "ВыполнитьПоиск", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(РезультатПоиска, "LDAP", "Добавить", "Проверка");

КонецПроцедуры

Процедура LDAP_Изменить(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);
    DN                  = "cn=OPI Test User,dc=example,dc=org";

    ЗначенияПочты = Новый Массив;
    ЗначенияПочты.Добавить("test@example.org");

    Изменение = Новый Структура;
    Изменение.Вставить("operation", "replace");
    Изменение.Вставить("attribute", "mail");
    Изменение.Вставить("values"   , ЗначенияПочты);

    Изменения = Новый Массив;
    Изменения.Добавить(Изменение);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("dn", DN);
    Опции.Вставить("changes", Изменения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "Изменить", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "Изменить");

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("base", DN);
    Опции.Вставить("фильтр", "(objectClass=*)");
    Опции.Вставить("scope", "base");

    РезультатПоиска = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "ВыполнитьПоиск", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(РезультатПоиска, "LDAP", "Изменить", "Проверка");

КонецПроцедуры

Процедура LDAP_Удалить(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);
    DN                  = "cn=OPI Test User,dc=example,dc=org";

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("dn", DN);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "Удалить", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "Удалить");

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("base", "dc=example,dc=org");
    Опции.Вставить("фильтр", "(uid=opitest)");

    РезультатПоиска = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "ВыполнитьПоиск", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(РезультатПоиска, "LDAP", "Удалить", "Проверка");

КонецПроцедуры

Процедура LDAP_Сравнить(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения);
    DN                  = "cn=OPI Test User,dc=example,dc=org";
    Атрибут             = "mail";
    Значение            = "test@example.org";

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("dn", DN);
    Опции.Вставить("attr", Атрибут);
    Опции.Вставить("value", Значение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "Сравнить", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "Сравнить");

КонецПроцедуры

#Область РасширеннаяПроверка

Процедура LDAP_Расширенная_ВыполнитьПоискБезПодключения(ПараметрыФункции)

    Коннектор = OPI_Компоненты.ПолучитьКомпоненту("LDAP");
    Параметры = OPI_Компоненты.СериализоватьJanx(Новый Структура("base,filter", "dc=example,dc=com", "(objectClass=*)"));
    Результат = OPI_Компоненты.ДесериализоватьJanx(Коннектор.Search(Параметры));

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "Расширенная_ВыполнитьПоискБезПодключения");

КонецПроцедуры

Процедура LDAP_Расширенная_ПовторноеПодключение(ПараметрыФункции)

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Коннектор         = OPI_Компоненты.ПолучитьКомпоненту("LDAP");
    ПервоеПодключение = OPI_Компоненты.ДесериализоватьJanx(Коннектор.Connect(URL, BindDN, Пароль, Таймаут));

    Если Не ПервоеПодключение["result"] Тогда
        ВызватьИсключение OPI_Инструменты.JSONСтрокой(ПервоеПодключение);
    КонецЕсли;

    Результат = OPI_Компоненты.ДесериализоватьJanx(Коннектор.Connect(URL, BindDN, Пароль, Таймаут));

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "Расширенная_ПовторноеПодключение");

КонецПроцедуры

Процедура LDAP_Расширенная_ПолучитьЛогПриПодключении(ПараметрыФункции)

    ФайлЛога             = ПолучитьИмяВременногоФайла("txt");
    НастройкиЛогирования = OPI_LDAP.ПолучитьНастройкиЛогирования(Истина, 100, ФайлЛога);

    URL     = ПараметрыФункции["LDAP_URL"];
    BindDN  = "cn=admin,dc=example,dc=org";
    Пароль  = ПараметрыФункции["LDAP_Password"];
    Таймаут = 30;

    Опции = Новый Структура;
    Опции.Вставить("url", URL);
    Опции.Вставить("bind", BindDN);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("tout", Таймаут);

    ПараметрыСоединения = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ldap", "СформироватьПараметрыСоединения", Опции);
    Соединение          = OPI_LDAP.ОткрытьСоединение(ПараметрыСоединения, , НастройкиЛогирования);

    Если Не OPI_LDAP.ЭтоКоннектор(Соединение) Тогда
        ВызватьИсключение OPI_Инструменты.JSONСтрокой(Соединение);
    КонецЕсли;

    OPI_LDAP.ВыполнитьПоиск(Соединение, "dc=example,dc=org");

    Результат = OPI_LDAP.ПолучитьЛог(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "LDAP", "Расширенная_ПолучитьЛогПриПодключении", , ФайлЛога);

КонецПроцедуры

#КонецОбласти // РасширеннаяПроверка

#КонецОбласти // LDAP

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции


#Region Alternate

Procedure LDAP_CommonMethods() Export
    LDAP_ОсновныеМетоды();
EndProcedure

Procedure LDAP_WorkWithDirectory() Export
    LDAP_РаботаСКаталогом();
EndProcedure

Procedure LDAP_AdvancedCheck() Export
    LDAP_РасширеннаяПроверка();
EndProcedure

#EndRegion
