// OneScript: ./OInt/tests/Modules/OPIt_Airtable.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

#Использовать oint
#Использовать asserts
#Использовать "internal"

#Область СлужебныйПрограммныйИнтерфейс

// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_СписокТестовКлиентСервер.СформироватьТестыЯкс("Airtable");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертс("Airtable");

КонецФункции

#Область ЗапускаемыеТесты

#Область Airtable

Процедура АТ_СоздатьБазу() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Token"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Workspace", ПараметрыТеста);

    Airtable_СоздатьБазу(ПараметрыТеста);
    Airtable_ПолучитьТаблицыБазы(ПараметрыТеста);
    Airtable_ПолучитьСписокБаз(ПараметрыТеста);

КонецПроцедуры

Процедура АТ_СоздатьТаблицу() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Base" , ПараметрыТеста);

    Airtable_ПолучитьПолеНомера(ПараметрыТеста);
    Airtable_ПолучитьПолеСтроковое(ПараметрыТеста);
    Airtable_ПолучитьПолеВложения(ПараметрыТеста);
    Airtable_ПолучитьПолеФлажка(ПараметрыТеста);
    Airtable_ПолучитьПолеДаты(ПараметрыТеста);
    Airtable_ПолучитьПолеТелефона(ПараметрыТеста);
    Airtable_ПолучитьПолеПочты(ПараметрыТеста);
    Airtable_ПолучитьПолеСсылки(ПараметрыТеста);
    Airtable_СоздатьТаблицу(ПараметрыТеста);
    Airtable_ИзменитьТаблицу(ПараметрыТеста);

КонецПроцедуры

Процедура АТ_СоздатьПоле() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Base" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Table", ПараметрыТеста);

    Airtable_СоздатьПоле(ПараметрыТеста);
    Airtable_ИзменитьПоле(ПараметрыТеста);

КонецПроцедуры

Процедура АТ_СоздатьУдалитьЗаписи() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Base" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Airtable_Table", ПараметрыТеста);

    Airtable_СоздатьЗаписи(ПараметрыТеста);
    Airtable_ПолучитьЗапись(ПараметрыТеста);
    Airtable_СоздатьКомментарий(ПараметрыТеста);
    Airtable_ИзменитьКомментарий(ПараметрыТеста);
    Airtable_ПолучитьКомментарии(ПараметрыТеста);
    Airtable_УдалитьКомментарий(ПараметрыТеста);
    Airtable_ПолучитьСписокЗаписей(ПараметрыТеста);
    Airtable_УдалитьЗаписи(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // Airtable

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область Airtable

Процедура Airtable_СоздатьБазу(ПараметрыФункции)

    Токен        = ПараметрыФункции["Airtable_Token"];
    Область      = ПараметрыФункции["Airtable_Workspace"];
    Наименование = "Тестовая база";

    МассивПолей = Новый Массив;
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеНомера("Номер"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеСтроковое("Строковое"));

    ИмяТаблицы = "Тестовая таблица";

    СоответствиеТаблиц = Новый Соответствие;
    СоответствиеТаблиц.Вставить(ИмяТаблицы, МассивПолей);

    Результат = OPI_Airtable.СоздатьБазу(Токен, Область, Наименование, СоответствиеТаблиц);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "СоздатьБазу", , ПараметрыФункции, ИмяТаблицы);

КонецПроцедуры

Процедура Airtable_ПолучитьТаблицыБазы(ПараметрыФункции)

    Токен = ПараметрыФункции["Airtable_Token"];
    База  = ПараметрыФункции["Airtable_Base"];

    Результат = OPI_Airtable.ПолучитьТаблицыБазы(Токен, База);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьТаблицыБазы");

КонецПроцедуры

Процедура Airtable_ПолучитьСписокБаз(ПараметрыФункции)

    Токен = ПараметрыФункции["Airtable_Token"];

    Результат = OPI_Airtable.ПолучитьСписокБаз(Токен);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьСписокБаз");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеНомера(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеНомера("Номер");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьПолеНомера");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеСтроковое(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеСтроковое("Строковое");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьПолеСтроковое");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеВложения(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеВложения("Вложение");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьПолеВложения");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеФлажка(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеФлажка("Флажок");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьПолеФлажка");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеДаты(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеДаты("Дата");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьПолеДаты");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеТелефона(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеТелефона("Телефон");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьПолеТелефона");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеПочты(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеПочты("Почта");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьПолеПочты");

КонецПроцедуры

Процедура Airtable_ПолучитьПолеСсылки(ПараметрыФункции)

    Результат = OPI_Airtable.ПолучитьПолеСсылки("Ссылка");

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьПолеСсылки");

КонецПроцедуры

Процедура Airtable_СоздатьТаблицу(ПараметрыФункции)

    Токен = ПараметрыФункции["Airtable_Token"];
    База  = ПараметрыФункции["Airtable_Base"];

    МассивПолей = Новый Массив;
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеНомера("Номер"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеСтроковое("Строковое"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеВложения("Вложение"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеФлажка("Флажок"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеДаты("Дата"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеТелефона("Телефон"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеПочты("Почта"));
    МассивПолей.Добавить(OPI_Airtable.ПолучитьПолеСсылки("Ссылка"));

    Наименование = "Тестовая таблица 2";
    Описание     = "Новая таблица";

    Результат = OPI_Airtable.СоздатьТаблицу(Токен, База, Наименование, МассивПолей, Описание);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "СоздатьТаблицу", , ПараметрыФункции, Наименование, Описание);

КонецПроцедуры

Процедура Airtable_ИзменитьТаблицу(ПараметрыФункции)

    Токен        = ПараметрыФункции["Airtable_Token"];
    База         = ПараметрыФункции["Airtable_Base"];
    Таблица      = ПараметрыФункции["Airtable_Table"];
    Наименование = "Тестовая таблица 2 (изм.)";
    Описание     = "Новая таблица (изм.)";

    Результат = OPI_Airtable.ИзменитьТаблицу(Токен, База, Таблица, Наименование, Описание);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ИзменитьТаблицу", , Наименование, Описание);

КонецПроцедуры

Процедура Airtable_СоздатьПоле(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Имя     = Строка(Новый УникальныйИдентификатор);

    Поле      = OPI_Airtable.ПолучитьПолеНомера(Имя);
    Результат = OPI_Airtable.СоздатьПоле(Токен, База, Таблица, Поле);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "СоздатьПоле", , ПараметрыФункции, Имя);

КонецПроцедуры

Процедура Airtable_ИзменитьПоле(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Поле    = ПараметрыФункции["Airtable_Field"];

    Имя      = Строка(Новый УникальныйИдентификатор) + "(изм.)";
    Описание = "Новое описание";

    Результат = OPI_Airtable.ИзменитьПоле(Токен, База, Таблица, Поле, Имя, Описание);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ИзменитьПоле", , Имя, Описание);

КонецПроцедуры

Процедура Airtable_СоздатьЗаписи(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];

    Номер     = 10;
    Строковое = "Привет";

    ОписаниеСтроки1 = Новый Структура("Номер,Строковое", Номер, Строковое);
    ОписаниеСтроки2 = Новый Структура("Номер,Строковое", Номер, Строковое);

    МассивОписаний = Новый Массив;
    МассивОписаний.Добавить(ОписаниеСтроки1);
    МассивОписаний.Добавить(ОписаниеСтроки2);

    Результат = OPI_Airtable.СоздатьЗаписи(Токен, База, Таблица, МассивОписаний);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "СоздатьЗаписи", , ПараметрыФункции);

    МассивУдаляемых = Новый Массив;

    Для Каждого Запись Из Результат["records"] Цикл

        ТекущаяЗапись = Запись["id"];
        МассивУдаляемых.Добавить(ТекущаяЗапись);

    КонецЦикла;

    OPI_Airtable.УдалитьЗаписи(Токен, База, Таблица, МассивУдаляемых);

    // Одиночное

    Результат = OPI_Airtable.СоздатьЗаписи(Токен, База, Таблица, ОписаниеСтроки1);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "СоздатьЗаписи", "Одиночная", ПараметрыФункции, Номер, Строковое);

КонецПроцедуры

Процедура Airtable_ПолучитьЗапись(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Запись  = ПараметрыФункции["Airtable_Record"];

    Результат = OPI_Airtable.ПолучитьЗапись(Токен, База, Таблица, Запись);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьЗапись", , Запись);

КонецПроцедуры

Процедура Airtable_СоздатьКомментарий(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Запись  = ПараметрыФункции["Airtable_Record"];
    Текст   = "Тестовый комментарий";

    Результат = OPI_Airtable.СоздатьКомментарий(Токен, База, Таблица, Запись, Текст);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "СоздатьКомментарий", , ПараметрыФункции, Текст);

КонецПроцедуры

Процедура Airtable_ИзменитьКомментарий(ПараметрыФункции)

    Токен       = ПараметрыФункции["Airtable_Token"];
    База        = ПараметрыФункции["Airtable_Base"];
    Таблица     = ПараметрыФункции["Airtable_Table"];
    Запись      = ПараметрыФункции["Airtable_Record"];
    Комментарий = ПараметрыФункции["Airtable_Comment"];

    Текст     = "Тестовый комментарий (изм.)";
    Результат = OPI_Airtable.ИзменитьКомментарий(Токен, База, Таблица, Запись, Комментарий, Текст);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ИзменитьКомментарий", , Текст);

КонецПроцедуры

Процедура Airtable_ПолучитьКомментарии(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Запись  = ПараметрыФункции["Airtable_Record"];

    Результат = OPI_Airtable.ПолучитьКомментарии(Токен, База, Таблица, Запись);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьКомментарии");

КонецПроцедуры

Процедура Airtable_УдалитьКомментарий(ПараметрыФункции)

    Токен       = ПараметрыФункции["Airtable_Token"];
    База        = ПараметрыФункции["Airtable_Base"];
    Таблица     = ПараметрыФункции["Airtable_Table"];
    Запись      = ПараметрыФункции["Airtable_Record"];
    Комментарий = ПараметрыФункции["Airtable_Comment"];

    Результат = OPI_Airtable.УдалитьКомментарий(Токен, База, Таблица, Запись, Комментарий);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "УдалитьКомментарий", , Комментарий);

КонецПроцедуры

Процедура Airtable_ПолучитьСписокЗаписей(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];

    Результат = OPI_Airtable.ПолучитьСписокЗаписей(Токен, База, Таблица);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "ПолучитьСписокЗаписей");

КонецПроцедуры

Процедура Airtable_УдалитьЗаписи(ПараметрыФункции)

    Токен   = ПараметрыФункции["Airtable_Token"];
    База    = ПараметрыФункции["Airtable_Base"];
    Таблица = ПараметрыФункции["Airtable_Table"];
    Запись  = ПараметрыФункции["Airtable_Record"];

    Результат = OPI_Airtable.УдалитьЗаписи(Токен, База, Таблица, Запись);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "Airtable", "УдалитьЗаписи");

КонецПроцедуры

#КонецОбласти // Airtable

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure AT_CreateDatabase() Export
    АТ_СоздатьБазу();
EndProcedure

Procedure AT_CreateTable() Export
    АТ_СоздатьТаблицу();
EndProcedure

Procedure AT_CreateField() Export
    АТ_СоздатьПоле();
EndProcedure

Procedure AT_CreateDeleteRecords() Export
    АТ_СоздатьУдалитьЗаписи();
EndProcedure

#EndRegion