// OneScript: ./OInt/tests/Modules/OPItc_YandexDisk.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

#Использовать "../../tools/main"
#Использовать "../../tools/http"
#Использовать "../../api"
#Использовать asserts
#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯксCLI("YandexDisk");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("YandexDisk");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область YandexDisk

Процедура ЯДиск_Авторизация() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_ClientID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_ClientSecret", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_RefreshToken", ПараметрыТеста);

    YandexDisk_ПолучитьКодПодтверждения(ПараметрыТеста);
    YandexDisk_ПреобразоватьКодВТокен(ПараметрыТеста);
    YandexDisk_ОбновитьТокен(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_ПолучитьИнформациюОДиске() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);

    YandexDisk_ПолучитьИнформациюОДиске(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_СоздатьПапку() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);

    YandexDisk_СоздатьПапку(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_ЗагрузитьПоАдресуПолучитьОбъект() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    YandexDisk_ЗагрузитьФайлПоURL(ПараметрыТеста);
    YandexDisk_ПолучитьОбъект(ПараметрыТеста);
    YandexDisk_УдалитьОбъект(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_ЗагрузитьУдалитьФайл() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Audio"           , ПараметрыТеста);

    YandexDisk_ЗагрузитьФайлЧастями(ПараметрыТеста);
    YandexDisk_ЗагрузитьФайл(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_СоздатьКопиюОбъекта() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    Токен = ПараметрыТеста["YandexDisk_Token"];
    URL   = ПараметрыТеста["Picture"];

    ПутьОригинала = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, ПутьОригинала, URL);
    OPI_Инструменты.Пауза(35);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("YandexDisk_OriginalFilePath", ПутьОригинала);
    ПараметрыТеста.Вставить("YandexDisk_OriginalFilePath", ПутьОригинала);

    YandexDisk_СоздатьКопиюОбъекта(ПараметрыТеста);

    ПутьКопии = ПараметрыТеста["YandexDisk_CopyFilePath"];

    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьОригинала, Ложь);
    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьКопии    , Ложь);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ЯДиск_ПолучитьСсылкуНаСкачивание() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    Токен = ПараметрыТеста["YandexDisk_Token"];
    URL   = ПараметрыТеста["Picture"];

    Путь = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, Путь, URL);
    OPI_Инструменты.Пауза(35);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("YandexDisk_PathForLink", Путь);
    ПараметрыТеста.Вставить("YandexDisk_PathForLink", Путь);

    YandexDisk_ПолучитьСсылкуДляСкачивания(ПараметрыТеста);
    YandexDisk_СкачатьФайл(ПараметрыТеста);

    OPI_YandexDisk.УдалитьОбъект(Токен, Путь, Ложь);

КонецПроцедуры

Процедура ЯДиск_ПолучитьСписокФайлов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);

    YandexDisk_ПолучитьСписокФайлов(ПараметрыТеста);

КонецПроцедуры

Процедура ЯДиск_ПереместитьОбъект() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    Токен = ПараметрыТеста["YandexDisk_Token"];
    URL   = ПараметрыТеста["Picture"];

    ПутьОригинала = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, ПутьОригинала, URL);
    OPI_Инструменты.Пауза(35);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("YandexDisk_OriginalFilePath", ПутьОригинала);
    ПараметрыТеста.Вставить("YandexDisk_OriginalFilePath", ПутьОригинала);

    YandexDisk_ПереместитьОбъект(ПараметрыТеста);

    ПутьНового = ПараметрыТеста["YandexDisk_NewFilePath"];

    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьОригинала, Ложь);
    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьНового   , Ложь);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ЯДиск_ДействияПубличныхОбъектов() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"         , ПараметрыТеста);

    Токен = ПараметрыТеста["YandexDisk_Token"];
    URL   = ПараметрыТеста["Picture"];

    ПутьОригинала = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    OPI_YandexDisk.ЗагрузитьФайлПоURL(Токен, ПутьОригинала, URL);
    OPI_Инструменты.Пауза(35);

    OPI_ПолучениеДанныхТестов.ЗаписатьПараметр("YandexDisk_OriginalFilePath", ПутьОригинала);
    ПараметрыТеста.Вставить("YandexDisk_OriginalFilePath", ПутьОригинала);

    YandexDisk_ОпубликоватьОбъект(ПараметрыТеста);
    YandexDisk_ПолучитьСсылкуСкачиванияПубличногоОбъекта(ПараметрыТеста);
    YandexDisk_ПолучитьПубличныйОбъект(ПараметрыТеста);
    YandexDisk_СохранитьПубличныйОбъектНаДиск(ПараметрыТеста);
    YandexDisk_ОтменитьПубликациюОбъекта(ПараметрыТеста);

    OPI_YandexDisk.УдалитьОбъект(Токен, ПутьОригинала, Ложь);

    OPI_Инструменты.Пауза(5);

КонецПроцедуры

Процедура ЯДиск_ПолучитьСписокОпубликованных() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("YandexDisk_Token", ПараметрыТеста);

    YandexDisk_ПолучитьСписокОпубликованныхОбъектов(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // YandexDisk

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область YandexDisk

Процедура YandexDisk_ПолучитьКодПодтверждения(ПараметрыФункции)

    ClientID = ПараметрыФункции["YandexDisk_ClientID"];

    Опции = Новый Структура;
    Опции.Вставить("id", ClientID);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПолучитьКодПодтверждения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПолучитьКодПодтверждения");

КонецПроцедуры

Процедура YandexDisk_ПреобразоватьКодВТокен(ПараметрыФункции)

    ClientID      = ПараметрыФункции["YandexDisk_ClientID"];
    ClientSecret  = ПараметрыФункции["YandexDisk_ClientSecret"];
    КодУстройства = "12345678";

    Опции = Новый Структура;
    Опции.Вставить("id", ClientID);
    Опции.Вставить("secret", ClientSecret);
    Опции.Вставить("device", КодУстройства);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПреобразоватьКодВТокен", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПреобразоватьКодВТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура YandexDisk_ОбновитьТокен(ПараметрыФункции)

    ClientID     = ПараметрыФункции["YandexDisk_ClientID"];
    ClientSecret = ПараметрыФункции["YandexDisk_ClientSecret"];
    RefreshToken = ПараметрыФункции["YandexDisk_RefreshToken"];

    Опции = Новый Структура;
    Опции.Вставить("id", ClientID);
    Опции.Вставить("secret", ClientSecret);
    Опции.Вставить("refresh", RefreshToken);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ОбновитьТокен", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ОбновитьТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура YandexDisk_ПолучитьИнформациюОДиске(ПараметрыФункции)

    Токен     = ПараметрыФункции["YandexDisk_Token"];
    Опции = Новый Структура;
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПолучитьИнформациюОДиске", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПолучитьИнформациюОДиске");

КонецПроцедуры

Процедура YandexDisk_СоздатьПапку(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = "/" + Строка(Новый УникальныйИдентификатор);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "СоздатьПапку", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "СоздатьПапку", , Токен, Путь);

    OPI_YandexDisk.УдалитьОбъект(Токен, Путь, Ложь);

КонецПроцедуры

Процедура YandexDisk_ЗагрузитьФайлПоURL(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Адрес = ПараметрыФункции["Picture"];
    Путь  = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);
    Опции.Вставить("url", Адрес);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ЗагрузитьФайлПоURL", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ЗагрузитьФайлПоURL", , ПараметрыФункции, Путь);

КонецПроцедуры

Процедура YandexDisk_ПолучитьОбъект(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_FileByURLPath"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПолучитьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПолучитьОбъект", , Путь);

КонецПроцедуры

Процедура YandexDisk_УдалитьОбъект(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_FileByURLPath"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);
    Опции.Вставить("can", Ложь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "УдалитьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "УдалитьОбъект");

КонецПроцедуры

Процедура YandexDisk_ЗагрузитьФайл(ПараметрыФункции)

    Путь1 = "/" + Строка(Новый УникальныйИдентификатор) + ".png";
    Путь2 = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    Токен    = ПараметрыФункции["YandexDisk_Token"];
    Картинка = ПараметрыФункции["Picture"]; // URL

    ИВФ = ПолучитьИмяВременногоФайла("png"); // Путь
    КопироватьФайл(Картинка, ИВФ);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь1);
    Опции.Вставить("file", Картинка);
    Опции.Вставить("rewrite", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ЗагрузитьФайл", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ЗагрузитьФайл", "URL"); // SKIP

    OPI_YandexDisk.УдалитьОбъект(Токен, Путь1, Ложь); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь2);
    Опции.Вставить("file", ИВФ);
    Опции.Вставить("rewrite", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ЗагрузитьФайл", Опции);

    // END

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ЗагрузитьФайл");

    OPI_YandexDisk.УдалитьОбъект(Токен, Путь2, Ложь); // SKIP

КонецПроцедуры

Процедура YandexDisk_СоздатьКопиюОбъекта(ПараметрыФункции)

    Токен    = ПараметрыФункции["YandexDisk_Token"];
    Оригинал = ПараметрыФункции["YandexDisk_OriginalFilePath"];
    Путь     = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("from", Оригинал);
    Опции.Вставить("to", Путь);
    Опции.Вставить("rewrite", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "СоздатьКопиюОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "СоздатьКопиюОбъекта", , ПараметрыФункции, Путь);

КонецПроцедуры

Процедура YandexDisk_ПолучитьСсылкуДляСкачивания(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_PathForLink"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПолучитьСсылкуДляСкачивания", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПолучитьСсылкуДляСкачивания");

КонецПроцедуры

Процедура YandexDisk_СкачатьФайл(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_PathForLink"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "СкачатьФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "СкачатьФайл");

КонецПроцедуры

Процедура YandexDisk_ПолучитьСписокФайлов(ПараметрыФункции)

    Токен            = ПараметрыФункции["YandexDisk_Token"];
    Количество       = 2;
    СмещениеОтНачала = 1;
    ОтборПоТипу      = "image";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("amount", Количество);
    Опции.Вставить("offset", СмещениеОтНачала);
    Опции.Вставить("type", ОтборПоТипу);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПолучитьСписокФайлов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПолучитьСписокФайлов", , Количество, СмещениеОтНачала);

КонецПроцедуры

Процедура YandexDisk_ПереместитьОбъект(ПараметрыФункции)

    Токен    = ПараметрыФункции["YandexDisk_Token"];
    Оригинал = ПараметрыФункции["YandexDisk_OriginalFilePath"];
    Путь     = "/" + Строка(Новый УникальныйИдентификатор) + ".png";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("from", Оригинал);
    Опции.Вставить("to", Путь);
    Опции.Вставить("rewrite", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПереместитьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПереместитьОбъект", , ПараметрыФункции, Путь);

КонецПроцедуры

Процедура YandexDisk_ПолучитьСписокОпубликованныхОбъектов(ПараметрыФункции)

    Токен            = ПараметрыФункции["YandexDisk_Token"];
    Количество       = 2;
    СмещениеОтНачала = 1;

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("amount", Количество);
    Опции.Вставить("offset", СмещениеОтНачала);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПолучитьСписокОпубликованныхОбъектов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПолучитьСписокОпубликованныхОбъектов", , Количество, СмещениеОтНачала);

КонецПроцедуры

Процедура YandexDisk_ОпубликоватьОбъект(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_OriginalFilePath"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ОпубликоватьОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ОпубликоватьОбъект", , ПараметрыФункции, Путь);

КонецПроцедуры

Процедура YandexDisk_ПолучитьСсылкуСкачиванияПубличногоОбъекта(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    URL   = ПараметрыФункции["YandexDisk_PublicURL"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("url", URL);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПолучитьСсылкуСкачиванияПубличногоОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПолучитьСсылкуСкачиванияПубличногоОбъекта");

КонецПроцедуры

Процедура YandexDisk_ПолучитьПубличныйОбъект(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    URL   = ПараметрыФункции["YandexDisk_PublicURL"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("url", URL);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ПолучитьПубличныйОбъект", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ПолучитьПубличныйОбъект");

КонецПроцедуры

Процедура YandexDisk_СохранитьПубличныйОбъектНаДиск(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    URL   = ПараметрыФункции["YandexDisk_PublicURL"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("url", URL);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "СохранитьПубличныйОбъектНаДиск", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "СохранитьПубличныйОбъектНаДиск");

КонецПроцедуры

Процедура YandexDisk_ОтменитьПубликациюОбъекта(ПараметрыФункции)

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Путь  = ПараметрыФункции["YandexDisk_OriginalFilePath"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ОтменитьПубликациюОбъекта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ОтменитьПубликациюОбъекта", , Путь);

КонецПроцедуры

Процедура YandexDisk_ЗагрузитьФайлЧастями(ПараметрыФункции)

    Путь = "/song.mp3";

    Токен = ПараметрыФункции["YandexDisk_Token"];
    Файл  = ПараметрыФункции["Audio"]; // URL, Двоичные или Путь к файлу

    РазмерЧасти = 1048576; // 1 MB

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);
    Опции.Вставить("file", Файл);
    Опции.Вставить("psize", РазмерЧасти);
    Опции.Вставить("rewrite", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "ЗагрузитьФайлЧастями", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ЗагрузитьФайлЧастями", , Файл);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "СкачатьФайл", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ЗагрузитьФайлЧастями", "Скачивание", Файл);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("path", Путь);
    Опции.Вставить("can", Ложь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("yadisk", "УдалитьОбъект", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "YandexDisk", "ЗагрузитьФайлЧастями", "Удаление");

КонецПроцедуры

#КонецОбласти // YandexDisk

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure YDisk_Authorization() Export
    ЯДиск_Авторизация();
EndProcedure

Procedure YDisk_GetDiskInfo() Export
    ЯДиск_ПолучитьИнформациюОДиске();
EndProcedure

Procedure YDisk_CreateFolder() Export
    ЯДиск_СоздатьПапку();
EndProcedure

Procedure YDisk_UploadByUrlAndGetObject() Export
    ЯДиск_ЗагрузитьПоАдресуПолучитьОбъект();
EndProcedure

Procedure YDisk_UploadDeleteFile() Export
    ЯДиск_ЗагрузитьУдалитьФайл();
EndProcedure

Procedure YDisk_CreateObjectCopy() Export
    ЯДиск_СоздатьКопиюОбъекта();
EndProcedure

Procedure YDisk_GetDownloadLink() Export
    ЯДиск_ПолучитьСсылкуНаСкачивание();
EndProcedure

Procedure YDisk_GetFileList() Export
    ЯДиск_ПолучитьСписокФайлов();
EndProcedure

Procedure YDisk_MoveObject() Export
    ЯДиск_ПереместитьОбъект();
EndProcedure

Procedure YDisk_PublicObjectActions() Export
    ЯДиск_ДействияПубличныхОбъектов();
EndProcedure

Procedure YDisk_GetPublishedList() Export
    ЯДиск_ПолучитьСписокОпубликованных();
EndProcedure

#EndRegion
