// OneScript: ./OInt/tests/Modules/OPItc_FTP.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

#Использовать "../../tools/main"
#Использовать "../../tools/http"
#Использовать "../../api"
#Использовать asserts
#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯксCLI("FTP");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("FTP");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область FTP

Процедура FT_РаботаСДиректориями() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровFTP();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        FTP_ОчиститьДиректорию(ПараметрыТеста);
        FTP_СоздатьНовуюДиректорию(ПараметрыТеста);
        FTP_ПолучитьТекущийКаталог(ПараметрыТеста);
        FTP_ИзменитьТекущийКаталог(ПараметрыТеста);
        FTP_ПолучитьСписокОбъектов(ПараметрыТеста);
        FTP_УдалитьДиректорию(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура FT_РаботаСФайлами() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровFTP();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        FTP_ЗагрузитьФайл(ПараметрыТеста);
        FTP_СохранитьФайл(ПараметрыТеста);
        FTP_ПолучитьДанныеФайла(ПараметрыТеста);
        FTP_УдалитьФайл(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

Процедура FT_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровFTP();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        FTP_ОткрытьСоединение(ПараметрыТеста);
        FTP_ПолучитьПриветственноеСообщение(ПараметрыТеста);
        FTP_ПолучитьСписокРасширенийПротокола(ПараметрыТеста);
        FTP_ПолучитьКонфигурациюСоединения(ПараметрыТеста);
        FTP_ЗакрытьСоединение(ПараметрыТеста);
        FTP_ЭтоКоннектор(ПараметрыТеста);
        FTP_ПолучитьНастройкиСоединения(ПараметрыТеста);
        FTP_ПолучитьНастройкиПрокси(ПараметрыТеста);
        FTP_ПолучитьНастройкиTLS(ПараметрыТеста);
        FTP_ПолучитьРазмерОбъекта(ПараметрыТеста);
        FTP_ИзменитьПуть(ПараметрыТеста);
        FTP_ВыполнитьНестандартнуюКоманду(ПараметрыТеста);
        FTP_ВыполнитьПроизвольнуюКоманду(ПараметрыТеста);
        FTP_Пинг(ПараметрыТеста);

    КонецЦикла;

КонецПроцедуры

#КонецОбласти // FTP

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область FTP

Процедура FTP_ОткрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Результат = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ОткрытьСоединение", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьПриветственноеСообщение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьПриветственноеСообщение", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьПриветственноеСообщение", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьКонфигурациюСоединения(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Опции = Новый Структура;
    Опции.Вставить("set", НастройкиFTP);
    Опции.Вставить("proxy", НастройкиПрокси);
    Опции.Вставить("tls", НастройкиTLS);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьКонфигурациюСоединения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьКонфигурациюСоединения", Постфикс, ПараметрыФункции);

    Опции = Новый Структура;
    Опции.Вставить("conn", Результат);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьПриветственноеСообщение", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "FTP", "ПолучитьКонфигурациюСоединения", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура FTP_ЗакрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    OPI_ПолучениеДанныхТестов.Обработать(Соединение, "FTP", "ЗакрытьСоединение", "Открытие, " + Постфикс);  // SKIP

    Результат = OPI_FTP.ЗакрытьСоединение(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ЗакрытьСоединение", Постфикс);

КонецПроцедуры

Процедура FTP_ЭтоКоннектор(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    OPI_ПолучениеДанныхТестов.Обработать(Соединение, "FTP", "ЭтоКоннектор", "Открытие, " + Постфикс);  // SKIP

    Результат = OPI_FTP.ЭтоКоннектор(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ЭтоКоннектор", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьНастройкиСоединения(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьНастройкиСоединения", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьНастройкиПрокси(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

    АдресПрокси  = ПараметрыФункции["Proxy_IP"];
    ПортПрокси   = ПараметрыФункции["Proxy_Port"];
    ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
    ПарольПрокси = ПараметрыФункции["Proxy_Password"];

    Опции = Новый Структура;
    Опции.Вставить("addr", АдресПрокси);
    Опции.Вставить("port", ПортПрокси);
    Опции.Вставить("type", ТипПрокси);
    Опции.Вставить("login", ЛогинПрокси);
    Опции.Вставить("pass", ПарольПрокси);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьНастройкиПрокси", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьНастройкиTLS(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Опции = Новый Структура;
    Опции.Вставить("trust", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьНастройкиTLS", Постфикс);

КонецПроцедуры

Процедура FTP_СоздатьНовуюДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        Удаление = OPI_FTP.УдалитьДиректорию(Соединение, "new_dir");                // SKIP
        OPI_ПолучениеДанныхТестов.Обработать(Удаление, "FTP", "СоздатьНовуюДиректорию", "Удаление, " + Постфикс);  // SKIP

        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "new_dir");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "СоздатьНовуюДиректорию", Опции);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "СоздатьНовуюДиректорию", Постфикс, Истина);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "new_dir/another_one");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "СоздатьНовуюДиректорию", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "СоздатьНовуюДиректорию", "Вложенная, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "second_dir/another_one");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "СоздатьНовуюДиректорию", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "СоздатьНовуюДиректорию", "Двойная, " + Постфикс);

    OPI_Инструменты.Пауза(5);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "new_dir");
    Опции.Вставить("rcv", Истина);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "FTP", "СоздатьНовуюДиректорию", "Проверка 1, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "");
    Опции.Вставить("rcv", Истина);

    Проверка = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Проверка, "FTP", "СоздатьНовуюДиректорию", "Проверка 2, " + Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьСписокОбъектов(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "");
        Опции.Вставить("rcv", Истина);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокОбъектов", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьСписокОбъектов", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "Dir1/Dir3/Git-2.50.0-64-bit.exe");
    Опции.Вставить("rcv", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьСписокОбъектов", "Файл, " + Постфикс);

КонецПроцедуры

Процедура FTP_ЗагрузитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    КартинкаПуть = "C:\pic.png";

    Картинка = ПараметрыФункции["Picture"];       // SKIP
    ИВФ      = ПолучитьИмяВременногоФайла("png"); // SKIP
    КопироватьФайл(Картинка, ИВФ);                // SKIP
    Картинка = ИВФ;                               // SKIP

    КартинкаДД = Новый ДвоичныеДанные(Картинка);

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);
    Опции.Вставить("rtout", 1000);
    Опции.Вставить("wtout", 1000);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("file", Картинка);
        Опции.Вставить("path", "new_dir/pic_from_disk.png");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ЗагрузитьФайл", Опции);
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("file", КартинкаДД);
        Опции.Вставить("path", "pic_from_binary.png");

        Результат2 = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ЗагрузитьФайл", Опции);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ЗагрузитьФайл", Постфикс               , КартинкаДД.Размер());
    OPI_ПолучениеДанныхТестов.Обработать(Результат2, "FTP", "ЗагрузитьФайл", "Двоичные, " + Постфикс, КартинкаДД.Размер());

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "new_dir/pic_from_disk.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьРазмерОбъекта", Опции);
    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "pic_from_binary.png");

    Результат2 = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьРазмерОбъекта", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ЗагрузитьФайл", "Размер 1, " + Постфикс, КартинкаДД.Размер());
    OPI_ПолучениеДанныхТестов.Обработать(Результат2, "FTP", "ЗагрузитьФайл", "Размер 2, " + Постфикс, КартинкаДД.Размер());

    Для Н = 1 По 5 Цикл

        Результат  = OPI_FTP.ЗагрузитьФайл(Соединение, Картинка, "new_dir/pic_from_disk.png");
        Результат2 = OPI_FTP.ЗагрузитьФайл(Соединение, КартинкаДД, "pic_from_binary.png");

        Если Не Результат["result"] Тогда
            OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ЗагрузитьФайл", "Множественный, " + Постфикс, КартинкаДД.Размер());
        КонецЕсли;

        Если Не Результат2["result"] Тогда
            OPI_ПолучениеДанныхТестов.Обработать(Результат2, "FTP", "ЗагрузитьФайл", "Множественный, двоичные, " + Постфикс, КартинкаДД.Размер());
        КонецЕсли;

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура FTP_УдалитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "pic_from_binary.png");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "УдалитьФайл", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "УдалитьФайл", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "pic_from_binary.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "УдалитьФайл", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "УдалитьФайл", "Несуществующий, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "");
    Опции.Вставить("rcv", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "УдалитьФайл", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура FTP_УдалитьДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "new_dir/another_one");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "УдалитьДиректорию", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "УдалитьДиректорию", Постфикс);

КонецПроцедуры

Процедура FTP_ОчиститьДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", ".");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ОчиститьДиректорию", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ОчиститьДиректорию", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", ".");
    Опции.Вставить("rcv", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ОчиститьДиректорию", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьРазмерОбъекта(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "new_dir/pic_from_disk.png");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьРазмерОбъекта", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ПолучитьРазмерОбъекта", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "new_dir/another.bin");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьРазмерОбъекта", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ПолучитьРазмерОбъекта", "Несуществующий, " + Постфикс);

КонецПроцедуры

Процедура FTP_ИзменитьПуть(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("old", "new_dir/pic_from_disk.png");
        Опции.Вставить("new", "new_dir/pic_copy.png");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ИзменитьПуть", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ИзменитьПуть", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "new_dir/pic_copy.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьРазмерОбъекта", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ИзменитьПуть", "Проверка, новый, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "new_dir/pic_from_binary.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьРазмерОбъекта", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ИзменитьПуть", "Проверка, старый, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("old", "new_dir");
    Опции.Вставить("new", "brand_new_dir");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ИзменитьПуть", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ИзменитьПуть", "Каталог, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", ".");
    Опции.Вставить("rcv", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ИзменитьПуть", "Список, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("old", "brand_new_dir");
    Опции.Вставить("new", "new_dir");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ИзменитьПуть", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ИзменитьПуть", "Каталог, обратно, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("old", "new_dir/pic_copy.png");
    Опции.Вставить("new", "new_dir/pic_from_disk.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ИзменитьПуть", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ИзменитьПуть", "Обратно, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", ".");
    Опции.Вставить("rcv", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "FTP", "ИзменитьПуть", "Список, обратно, " + Постфикс);

КонецПроцедуры

Процедура FTP_СохранитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        Путь     = "new_dir/pic_from_disk.png";
        ИмяФайла = ПолучитьИмяВременногоФайла("bin");

        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", Путь);
        Опции.Вставить("file", ИмяФайла);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "СохранитьФайл", Опции);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "СохранитьФайл", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", Путь);

    Размер = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьРазмерОбъекта", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Размер, "FTP", "СохранитьФайл", "Размер, " + Постфикс);

    ФайлОбъект = Новый Файл(ИмяФайла);

    РазмерФайла      = ФайлОбъект.Размер();
    РазмерРезультата = Результат["bytes"];
    РазмерПроверки   = Размер["bytes"];

    OPI_ПолучениеДанныхТестов.Обработать(РазмерФайла, "FTP", "СохранитьФайл", "Размер файла, " + Постфикс, РазмерРезультата, РазмерПроверки);

    Путь = "new_dir/pic_from_disk.png";

    Для Н = 1 По 5 Цикл

        Результат = OPI_FTP.СохранитьФайл(Соединение, Путь, ИмяФайла);

        Если Не Результат["result"] Тогда
            OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "СохранитьФайл", "Множественный, " + Постфикс);
        КонецЕсли;

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(ИмяФайла, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура FTP_ПолучитьДанныеФайла(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        Путь      = "new_dir/pic_from_disk.png";
        Результат = OPI_FTP.ПолучитьДанныеФайла(Соединение, Путь);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьДанныеФайла", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", Путь);

    Размер = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьРазмерОбъекта", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Размер, "FTP", "ПолучитьДанныеФайла", "Размер, " + Постфикс);

    РазмерФайла    = Результат.Размер();
    РазмерПроверки = Размер["bytes"];

    OPI_ПолучениеДанныхТестов.Обработать(РазмерФайла, "FTP", "ПолучитьДанныеФайла", "Размер файла, " + Постфикс, РазмерПроверки);

    Путь = "new_dir/pic_from_disk.png";

    Для Н = 1 По 5 Цикл

        Результат = OPI_FTP.ПолучитьДанныеФайла(Соединение, Путь);

        Если Не ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
            OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьДанныеФайла", "Множественный, " + Постфикс);
        КонецЕсли;

    КонецЦикла;

КонецПроцедуры

Процедура FTP_Пинг(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "Пинг", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "Пинг", Постфикс);

КонецПроцедуры

Процедура FTP_ВыполнитьНестандартнуюКоманду(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        ТекстКоманды = "UMASK";
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("cmd", ТекстКоманды);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ВыполнитьНестандартнуюКоманду", Опции);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ВыполнитьНестандартнуюКоманду", Постфикс);

КонецПроцедуры

Процедура FTP_ВыполнитьПроизвольнуюКоманду(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда

        ТекстКоманды = "PWD";
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("cmd", ТекстКоманды);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ВыполнитьПроизвольнуюКоманду", Опции);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ВыполнитьПроизвольнуюКоманду", Постфикс);

КонецПроцедуры

Процедура FTP_ПолучитьТекущийКаталог(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьТекущийКаталог", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьТекущийКаталог", Постфикс, ПараметрыФункции);

КонецПроцедуры

Процедура FTP_ИзменитьТекущийКаталог(ПараметрыФункции)

    Если OPI_ПолучениеДанныхТестов.ЭтоТестCLI() Тогда Возврат; КонецЕсли; // SKIP

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Путь      = "new_dir";
        Результат = OPI_FTP.ИзменитьТекущийКаталог(Соединение, Путь);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ИзменитьТекущийКаталог", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьТекущийКаталог", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ИзменитьТекущийКаталог", "Проверка, " + Постфикс, Путь);

    Путь      = ПараметрыФункции["FTP_RootPath"];
    Результат = OPI_FTP.ИзменитьТекущийКаталог(Соединение, Путь);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ИзменитьТекущийКаталог", "Обратно, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьТекущийКаталог", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ИзменитьТекущийКаталог", "Проверка, обратно, " + Постфикс, Путь);

КонецПроцедуры

Процедура FTP_ПолучитьСписокРасширенийПротокола(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["FTP_IP"];
    Порт   = ПараметрыФункции["FTP_Port"];
    Логин  = ПараметрыФункции["FTP_User"];
    Пароль = ПараметрыФункции["FTP_Password"];

    ИспользоватьПрокси = Истина;
    FTPS               = Истина;

    НастройкиПрокси = Неопределено;
    НастройкиTLS    = Неопределено; // FTPS

    ИспользоватьПрокси = ПараметрыФункции["Proxy"]; // SKIP
    FTPS               = ПараметрыФункции["TLS"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("login", Логин);
    Опции.Вставить("pass", Пароль);

    НастройкиFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиСоединения", Опции);

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Если FTPS Тогда
        Опции = Новый Структура;
        Опции.Вставить("trust", Истина);

        НастройкиTLS = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьНастройкиTLS", Опции);
    КонецЕсли;

    Соединение = OPI_FTP.ОткрытьСоединение(НастройкиFTP, НастройкиПрокси, НастройкиTLS);

    Если OPI_FTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ftp", "ПолучитьСписокРасширенийПротокола", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "FTP", "ПолучитьСписокРасширенийПротокола", Постфикс);

КонецПроцедуры

#КонецОбласти // FTP

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure FT_DirecotryManagement() Export
    FT_РаботаСДиректориями();
EndProcedure

Procedure FT_FileOperations() Export
    FT_РаботаСФайлами();
EndProcedure

Procedure FT_CommonMethods() Export
    FT_ОсновныеМетоды();
EndProcedure

#EndRegion
