// OneScript: ./OInt/api/lua/Modules/OPI_Lua.os
// Lib: Lua
// CLI: lua
// Keywords: lua

// DocsCategory: Other
// DocsNameRU: Lua
// DocsNameEN: Lua

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:UsingSynchronousCalls-off

//@skip-check method-too-many-params
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content

// #Использовать "../../../tools/main"

#Если Не ВебКлиент Тогда // !OPI

#Область ПрограммныйИнтерфейс

#Область Основные

// Создать VM !NOCLI
// Инициализирует LuaVM указанной версии
//
// Примечание:
// Ошибка при создании VM вызовет исключение
//
// Параметры:
//  Версия      - Строка                     - Версия VM: Lua54, LuaJIT                                - ver
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Произвольный - Объект компоненты
Функция СоздатьVM(Знач Версия, Знач Логирование = Неопределено) Экспорт

    Если ЭтоVM(Версия) Тогда
        Возврат Версия;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Версия);

    Если Версия <> "Lua54" И Версия <> "LuaJIT" Тогда

        ВызватьИсключение "Unsupported Lua version. Required: Lua54, LuaJIT";

    КонецЕсли;

    Компонента = OPI_Компоненты.ПолучитьКомпоненту(Версия);

    Если Логирование = Неопределено Тогда

        СтрокаНастроек = "";

    Иначе

        ТекстОшибки    = "Некорректные настройки логирования";
        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Логирование, ТекстОшибки);
        СтрокаНастроек = OPI_Компоненты.СериализоватьJanx(Логирование);

    КонецЕсли;

    Если ЗначениеЗаполнено(СтрокаНастроек) Тогда

        РезультатЛога = Компонента.SetLogger(СтрокаНастроек);
        РезультатЛога = OPI_Компоненты.ДесериализоватьJanx(РезультатЛога);

        Если Не РезультатЛога["result"] Тогда
            ВызватьИсключение РезультатЛога["error"];
        КонецЕсли;

    КонецЕсли;

    Возврат Компонента;

КонецФункции

// Перезапустить !NOCLI
// Перезапускает Lua VM
// 
// Параметры:
//  Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция Перезапустить(Знач Lua) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;
    
	Результат = Компонента.Reset();
	
	Возврат РезультатИзJanx(Результат);

КонецФункции

// Вызвать функцию !NOCLI
// Вызывает функцию Lua с переданными параметрами
//
// Примечание:
// В качестве параметров функции допускаются любые JSON-совместимые типы и ДвоичныеДанные
// Функция должна быть предварительно определена в контексте при помощи одного из методов выполнения кода
//
// Параметры:
//  Lua        - Произвольный           - Компонента Lua или версия Lua для запуска - lua
//  ИмяФункции - Строка                 - Имя функции или путь вида module.func     - func
//  Параметры  - Массив Из Произвольный - Параметры функции                         - params
//
// Возвращаемое значение:
//  Произвольный - Результат вызова
Функция ВызватьФункцию(Знач Lua, Знач ИмяФункции, Знач Параметры = Неопределено) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(ИмяФункции);

    Если Параметры = Неопределено Тогда
        Параметры = Новый Массив;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьМассив(Параметры);

    АргументыДД = OPI_Компоненты.СериализоватьJanx(Параметры);
    РезультатДД = Компонента.CallFunction(ИмяФункции, АргументыДД);

    Возврат РезультатИзJanx(РезультатДД);

КонецФункции

// Это VM !NOCLI
// Проверяет, что значение является объектом внешней компоненты Lua
//
// Параметры:
//  Значение - Произвольный - Значение для проверки - value
//
// Возвращаемое значение:
//  Булево -  Это коннектор
Функция ЭтоVM(Знач Значение) Экспорт

    ТипСтрокой = Строка(ТипЗнч(Значение));

    Возврат ТипСтрокой = "AddIn.OPI_LuaJIT.Main"
        Или ТипСтрокой = "AddIn.OPI_Lua54.Main"

КонецФункции

// Получить настройки логирования !NOCLI
// Получает структуру настроек для запуска логирования при старте сервера
//
// Параметры:
//  ЗаписьВПамять   - Булево - Запись лога в память для дальнейшего получения из объекта компоненты - memory
//  МаксимумСобытий - Число  - Максимальное число событий, хранящееся в память                      - count
//  ПутьКФайлу      - Строка - Путь к файлу для сохранения полного лога, если необходимо            - path
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Структура настроек
Функция ПолучитьНастройкиЛогирования(Знач ЗаписьВПамять = Истина
    , Знач МаксимумСобытий = 300
    , Знач ПутьКФайлу = "") Экспорт

    //@skip-check constructor-function-return-section
    Возврат OPI_Компоненты.ПолучитьНастройкиЛогирования(ЗаписьВПамять, МаксимумСобытий, ПутьКФайлу);

КонецФункции

// Получить лог !NOCLI
// Получает данные лога (при включенном логировании в память)
//
// Параметры:
//  ОбъектКомпоненты - Произвольный - Объект компоненты VM                                       - vm
//  КакСтрока        - Булево       - Истина > возвращает лог одной строкой, Ложь > как массив   - str
//  ЧислоСобытий     - Число        - Число последних событий для получения. 0 > без ограничений - count
//
// Возвращаемое значение:
//  Строка, Соответствие Из КлючИЗначение - Лог как строка или соответствие с полным результатом выполнения
Функция ПолучитьЛог(Знач ОбъектКомпоненты, Знач КакСтрока = Ложь, Знач ЧислоСобытий = 100) Экспорт

    Возврат OPI_Компоненты.ПолучитьЛог(ОбъектКомпоненты
        , КакСтрока
        , ЧислоСобытий);

КонецФункции

#КонецОбласти

#Область РаботаСоСкриптами

// Выполнить код из строки !NOCLI
// Выполняет Lua скрипт из переданной строки
//
// Примечание:
// Ошибка при выполнении Lua кода вызовет исключение
//
// Параметры:
//  Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Код - Строка       - Код строкой                               - code
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения кода
Функция ВыполнитьКодИзСтроки(Знач Lua, Знач Код) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Код);

    РезультатДД = Компонента.ExecuteString(Код);

    Возврат РезультатИзJanx(РезультатДД);

КонецФункции

// Выполнить код из файла !NOCLI
// Выполняет Lua скрипт на диске
//
// Примечание:
// Ошибка при выполнении Lua кода вызовет исключение
//
// Параметры:
//  Lua  - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Путь - Строка       - Путь к файлу скрипта                      - path
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения кода
Функция ВыполнитьКодИзФайла(Знач Lua, Знач Путь) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Путь);

    ФайлСкрипта = Новый Файл(Путь);

    Если Не ФайлСкрипта.Существует() Тогда
        ВызватьИсключение "File not found";
    КонецЕсли;

    РезультатДД = Компонента.ExecuteFile(ФайлСкрипта.ПолноеИмя);

    Возврат РезультатИзJanx(РезультатДД);

КонецФункции

// Вызвать функцию скрипта
// Выполняет Lua код из строки или файла и вызывает указанную функцию
//
// Примечание:
// Аналогично раздельному вызову `ВыполнитьКодИзСтроки`, `ДобавитьПакетИзСтроки`/`ДобавитьПакетИзФайла`,
// `УстановитьГлобальнуюПеременную` и `ВызватьФункцию`
//
// Параметры:
//  Lua        - Произвольный                  - Компонента Lua или версия Lua для запуска                  - lua
//  Скрипт     - Строка                        - Код Lua или путь к файлу                                     - script
//  ИмяФункции - Строка                        - Имя функции или путь вида module.func                        - func
//  Параметры  - Соответствие Из КлючИЗначение - Параметры функции, если необходимо                           - params
//  Пакеты     - Соответствие Из КлючИЗначение - Пакеты: ключ > имя, значение > код или путь к файлу          - packages
//  Переменные - Соответствие Из КлючИЗначение - Глобальные переменные модуля, если необходимо                - globals
//
// Возвращаемое значение:
//  Произвольный - Результат вызова
Функция ВызватьФункциюСкрипта(Знач Lua
    , Знач Скрипт
    , Знач ИмяФункции
    , Знач Параметры = Неопределено
    , Знач Пакеты = Неопределено
    , Знач Переменные = Неопределено) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Скрипт, Истина);
    ВыполнитьКодИзСтроки(Компонента, Скрипт);

	Если Пакеты <> Неопределено Тогда
    	ПодключитьПакеты(Компонента, Пакеты);
    КонецЕсли;

    Если Переменные <> Неопределено Тогда

        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Переменные);

        Для Каждого КлючЗначение Из Переменные Цикл
            УстановитьГлобальнуюПеременную(Компонента, КлючЗначение.Ключ, КлючЗначение.Значение);
        КонецЦикла;

    КонецЕсли;

    Результат = ВызватьФункцию(Компонента, ИмяФункции, Параметры);

    Возврат Результат;

КонецФункции

#КонецОбласти

#Область РаботаСБайткодом

// Скомпилировать код из строки
// Преобразует исходный код в байт-код Lua
//
// Примечание:
// Ошибка при компиляции кода вызовет исключение
//
// Параметры:
//     Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Код    - Строка       - Программный код для компиляции            - code
//
// Возвращаемое значение:
//  ДвоичныеДанные - Результат компиляции
Функция СкомпилироватьКодИзСтроки(Знач Lua, Знач Код) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Код);

    Результат = Компонента.CompileToBytecode(Код);

    Если ТипЗнч(Результат) = Тип("Строка") Тогда
        ВызватьИсключение Результат;
    КонецЕсли;

    Возврат Результат;

КонецФункции

// Скомпилировать код из файла
// Преобразует файл исходного кода в байт-код Lua
//
// Примечание:
// Ошибка при компиляции кода вызовет исключение
//
// Параметры:
//     Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Путь   - Строка       - Путь к файлу скрипта                      - path
//
// Возвращаемое значение:
//  ДвоичныеДанные - Результат компиляции
Функция СкомпилироватьКодИзФайла(Знач Lua, Знач Путь) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Путь);

    ФайлСкрипта = Новый Файл(Путь);

    Если Не ФайлСкрипта.Существует() Тогда
        ВызватьИсключение "File not found";
    КонецЕсли;

    Результат = Компонента.CompileFileToBytecode(Путь);

    Если ТипЗнч(Результат) = Тип("Строка") Тогда
        ВызватьИсключение Результат;
    КонецЕсли;

    Возврат Результат;

КонецФункции

// Выполнить байт код !NOCLI
// Выполняет ранее скомпилированный код
//
// Параметры:
//  Lua     - Произвольный   - Компонента Lua или версия Lua для запуска - lua
//  БайтКод - ДвоичныеДанные - Байт код для выполнения                   - code
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ВыполнитьБайтКод(Знач Lua, Знач БайтКод) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(БайтКод, Истина);
    Результат = Компонента.ExecuteBytecode(БайтКод);

    Возврат РезультатИзJanx(Результат);

КонецФункции

// Выполнить байт код файла !NOCLI
// Выполняет байт код из указанного файла
//
// Параметры:
//  Lua  - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Путь - Строка       - Путь к файлу с байт кодом                 - path
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ВыполнитьБайтКодФайла(Знач Lua, Знач Путь) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    ФайлСкрипта = Новый Файл(Путь);

    Если Не ФайлСкрипта.Существует() Тогда
        ВызватьИсключение "File not found";
    КонецЕсли;

    Результат = Компонента.ExecuteBytecodeFile(Путь);

    Возврат РезультатИзJanx(Результат);

КонецФункции

// Вызвать функцию байт кода
// Выполняет байт-код и вызывает указанную функцию
//
// Примечание:
// Аналогично раздельному вызову `ВыполнитьБайтКод`, `ДобавитьПакетИзСтроки`/`ДобавитьПакетИзФайла`,
// `УстановитьГлобальнуюПеременную` и `ВызватьФункцию`
//
// Параметры:
//  Lua        - Произвольный                  - Компонента Lua или версия Lua для запуска           - lua
//  БайтКод    - Строка, ДвоичныеДанные        - Байт код или путь к файлу                           - code
//  ИмяФункции - Строка                        - Имя функции или путь вида module.func               - func
//  Параметры  - Соответствие Из КлючИЗначение - Параметры функции, если необходимо                  - params
//  Пакеты     - Соответствие Из КлючИЗначение - Пакеты: ключ > имя, значение > код или путь к файлу - packages
//  Переменные - Соответствие Из КлючИЗначение - Глобальные переменные модуля, если необходимо       - globals
//
// Возвращаемое значение:
//  Произвольный - Результат вызова
Функция ВызватьФункциюБайтКода(Знач Lua
    , Знач БайтКод
    , Знач ИмяФункции
    , Знач Параметры = Неопределено
    , Знач Пакеты = Неопределено
    , Знач Переменные = Неопределено) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьДвоичныеДанные(БайтКод, Истина);
    ВыполнитьБайтКод(Компонента, БайтКод);

	Если Пакеты <> Неопределено Тогда
    	ПодключитьПакеты(Компонента, Пакеты);
    КонецЕсли;

    Если Переменные <> Неопределено Тогда

        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Переменные);

        Для Каждого КлючЗначение Из Переменные Цикл
            УстановитьГлобальнуюПеременную(Компонента, КлючЗначение.Ключ, КлючЗначение.Значение);
        КонецЦикла;

    КонецЕсли;

    Результат = ВызватьФункцию(Компонента, ИмяФункции, Параметры);

    Возврат Результат;

КонецФункции

#КонецОбласти

#Область ГлобальныеПеременные

// Установить глобальную переменную !NOCLI
// Устанавливает значение глобальной переменной в контексте
//
// Параметры:
//  Lua      - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Имя      - Строка       - Имя переменной                            - name
//  Значение - Произвольный - Значение переменной                       - value
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат выполнения
Функция УстановитьГлобальнуюПеременную(Знач Lua, Знач Имя, Знач Значение) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Имя);

    Данные     = Новый Структура("data", Значение);
    ДанныеJanx = OPI_Компоненты.СериализоватьJanx(Данные);

    Результат = Компонента.SetGlobal(Имя, ДанныеJanx);

    Данные = РезультатИзJanx(Результат);

    Возврат Данные;

КонецФункции

// Получить глобальную переменную !NOCLI
// Получает значение глобальной переменной контекста
//
// Параметры:
//  Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Имя - Строка       - Имя переменной                            - name
//
// Возвращаемое значение:
//  Произвольный - Значение переменной
Функция ПолучитьГлобальнуюПеременную(Знач Lua, Знач Имя) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Имя);

    Результат = Компонента.GetGlobal(Имя);

    Данные = РезультатИзJanx(Результат);

    Возврат Данные;

КонецФункции

#КонецОбласти

#Область УправлениеПакетами

// Добавить пакет из строки !NOCLI
// Добавляет код из строки как пакет с указанным именем
//
// Параметры:
//  Lua       - Произвольный - Компонента Lua или версия Lua для запуска                  - lua
//  ИмяПакета - Строка       - Имя пакета, по которому он будет доступен после добавления - name
//  Код       - Строка       - Программный код пакета                                     - code
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат добавления
Функция ДобавитьПакетИзСтроки(Знач Lua, Знач ИмяПакета, Знач Код) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;
    
    OPI_ПреобразованиеТипов.ПолучитьСтроку(ИмяПакета);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(Код);
    
	Результат = Компонента.AddPackage(ИмяПакета, Код);

    Возврат РезультатИзJanx(Результат);

КонецФункции

// Добавить пакет из файла !NOCLI
// Добавляет код из файла как пакет с указанным именем
//
// Параметры:
//  Lua       - Произвольный - Компонента Lua или версия Lua для запуска                  - lua
//  ИмяПакета - Строка       - Имя пакета, по которому он будет доступен после добавления - name
//  Путь      - Строка       - Путь к файлу кода                                          - filepath
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат добавления
Функция ДобавитьПакетИзФайла(Знач Lua, Знач ИмяПакета, Знач Путь) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;
    
    OPI_ПреобразованиеТипов.ПолучитьСтроку(Путь);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(ИмяПакета);

    ФайлСкрипта = Новый Файл(Путь);

    Если Не ФайлСкрипта.Существует() Тогда
        ВызватьИсключение "File not found";
    КонецЕсли;
    
	Результат = Компонента.LoadPackageFromFile(ИмяПакета, Путь);
	
	Возврат РезультатИзJanx(Результат);

КонецФункции

// Получить список пакетов !NOCLI
// Получает список добавленных в окружение пакетов
// 
// Параметры:
//  Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//
// Возвращаемое значение:
//  Массив Из Строка - Результат выполнения
Функция ПолучитьСписокПакетов(Знач Lua) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;
    
	Результат = Компонента.GetPackages();
	
	Возврат РезультатИзJanx(Результат);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПодключитьПакеты(Знач Компонента, Знач Пакеты)

    OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Пакеты);

    Для Каждого Пакет Из Пакеты Цикл

        ИмяПакета = Пакет.Ключ;
        Источник  = Пакет.Значение;

        OPI_ПреобразованиеТипов.ПолучитьСтроку(ИмяПакета);
        OPI_ПреобразованиеТипов.ПолучитьСтроку(Источник);

        ФайлПакета = Новый Файл(Источник);

        Если ФайлПакета.Существует() Тогда
            ДобавитьПакетИзФайла(Компонента, ИмяПакета, Источник);
        Иначе
            OPI_ПреобразованиеТипов.ПолучитьСтроку(Источник, Истина);
            ДобавитьПакетИзСтроки(Компонента, ИмяПакета, Источник);
        КонецЕсли;

        ВыполнитьКодИзСтроки(Компонента, СтрШаблон("%1 = require('%2')", ИмяПакета, ИмяПакета));

    КонецЦикла;

КонецПроцедуры

Функция РезультатИзJanx(Знач ДанныеJanx)

    Результат = OPI_Компоненты.ДесериализоватьJanx(ДанныеJanx);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    КонецЕсли;

    Возврат Результат["data"];

КонецФункции

#КонецОбласти

#КонецЕсли // !OPI

