// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

Перем СоответствиеКомандМодулей;
Перем Версия;
Перем КэшированиеИндексов;
Перем ТекущийКаталог;
Перем КаталогПакетов;
Перем КаталогПриложения;

Процедура ПриСозданииОбъекта()
    
    ТекущийКаталог = ТекущийСценарий().Каталог;
    ИнициализироватьОсновныеСписки();  
    
КонецПроцедуры

Процедура ИнициализироватьОсновныеСписки() Экспорт
    
    ФайлДанных = ОбъединитьПути(ТекущийКаталог, "index", "lib.json");  
    Данные     = ПрочитатьJSONФайл(ФайлДанных);
    
    КэшированиеИндексов       = Новый Соответствие();
    СоответствиеКомандМодулей = Данные["modules"];
    Версия                    = Данные["version"];
    
КонецПроцедуры

Функция ПолучитьВерсию() Экспорт
    Возврат Версия;
КонецФункции

Функция ПолучитьСоответствиеКомандМодулей() Экспорт
    Возврат СоответствиеКомандМодулей;
КонецФункции

Функция ПолучитьИнформациюИндекса(Знач Команда) Экспорт
    
    ИнформацияИндекса = КэшированиеИндексов.Получить(Команда);
    
    Если ИнформацияИндекса = Неопределено Тогда
        
        Попытка
            
            ПутьИндекса       = ОбъединитьПути(ТекущийКаталог, "index", Команда + ".json");
            ИнформацияИндекса = ПрочитатьJSONФайл(ПутьИндекса);        
            
            КэшированиеИндексов.Вставить(Команда, ИнформацияИндекса);
            
        Исключение
            ВызватьИсключение СтрШаблон("Некорректное имя команды: %1", Команда)
        КонецПопытки;
        
    КонецЕсли;
    
    Возврат ИнформацияИндекса;
    
КонецФункции

Функция ПолучитьИнформациюОМетоде(Знач Команда, Знач Метод) Экспорт
    
    ИнформацияМетода = Неопределено;
    ТекущийИндекс    = ПолучитьИнформациюИндекса(Команда);
    МетодПоиска      = вРег(Метод);
    
    Для Каждого МетодИндекса Из ТекущийИндекс["methods"] Цикл
        Если МетодИндекса["id"] = МетодПоиска Тогда
            ИнформацияМетода = МетодИндекса;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    
    Возврат ИнформацияМетода;
    
КонецФункции

Функция ПолучитьПолныйСостав() Экспорт
    
    Для Каждого Команда Из СоответствиеКомандМодулей Цикл
        ПолучитьИнформациюИндекса(Команда.Ключ);
    КонецЦикла;
    
    Возврат КэшированиеИндексов;
    
КонецФункции

Функция СформироватьСтрокуВызоваМетода(Знач ПереданныеПараметры
    , Знач Команда
    , Знач Метод
    , Знач Динамически = Истина
    , Знач Интерактивно = Ложь) Экспорт
    
    Если КаталогПакетов = Неопределено Тогда
        ОпределитьКаталогПакетов();
    КонецЕсли;
    
    Модуль = СоответствиеКомандМодулей.Получить(Команда);
    
    Если Не ЗначениеЗаполнено(Модуль) Тогда
        Возврат Новый Структура("Ошибка,Результат", Истина, "Команда");
    КонецЕсли;
    
    ДанныеКоманды = ПолучитьИнформациюИндекса(Команда);
    ДанныеМетода  = ПолучитьИнформациюОМетоде(Команда, Метод);
    
    Если ДанныеМетода = Неопределено Тогда
        Возврат Новый Структура("Ошибка,Результат", Истина, "Метод");
    КонецЕсли;
    
    Если ДанныеМетода["nocli"] = Истина И Не Интерактивно Тогда
        Возврат Новый Структура("Ошибка,Результат", Истина, "NOCLI");    
    КонецЕсли;
    
    МассивСтрок      = Новый Массив;
    МассивВызова     = Новый Массив;
    ТекстВыполнения  = "";
    
    ПараметрыМетода  = ДанныеМетода["params"];
    ШаблонПеременной = "%1 = ""%2"";";
    ШаблонУП         = "OPI_Инструменты.ЗаменитьУправляющиеПоследовательности(%1);";
    
    Если Динамически Тогда

        ШаблонВызова = "Ответ = Attached_%1.%2(%3)";
        СтрокаИнициализации = СформироватьСтрокуИнициализацииМодуля(ДанныеКоманды, Модуль);
        МассивСтрок.Добавить(СтрокаИнициализации);

    Иначе
        ШаблонВызова = "Ответ = %1.%2(%3)";
    КонецЕсли;
      
    Для Каждого НеобходимыйПараметр Из ПараметрыМетода Цикл
        
        ЗначениеПараметра = Неопределено;
        ИмяПараметра      = НеобходимыйПараметр["name"];
        ИмяПараметраСокр  = НеобходимыйПараметр["short"];

        МассивВариантовПоиска = Новый Массив;
        МассивВариантовПоиска.Добавить(ИмяПараметра);
        МассивВариантовПоиска.Добавить(ИмяПараметраСокр);
        МассивВариантовПоиска.Добавить(СтрЗаменить(ИмяПараметра, "--", ""));
        МассивВариантовПоиска.Добавить(СтрЗаменить(ИмяПараметраСокр, "-", ""));

        Для Каждого ВариантПоиска Из МассивВариантовПоиска Цикл

            ЗначениеПараметра = ПереданныеПараметры.Получить(ВариантПоиска);

            Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
                Прервать;
            КонецЕсли;
            
        КонецЦикла;
        
        Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
            
            ИмяПараметра      = СтрШаблон("Параметр%1", СтрЗаменить(ИмяПараметра, "--", "_"));
            ОбернутоеЗначение = СтрЗаменить(ЗначениеПараметра, """", """""");
            
            МассивСтрок.Добавить(СтрШаблон(ШаблонПеременной, ИмяПараметра, ОбернутоеЗначение));
            
            Если ТребуетсяОбработкаУправляющихПоследовательностей(ИмяПараметра, ЗначениеПараметра) Тогда
                МассивСтрок.Добавить(СтрШаблон(ШаблонУП, ИмяПараметра));
            КонецЕсли;
            
            МассивВызова.Добавить(ИмяПараметра);
            
        Иначе
            МассивВызова.Добавить("");
        КонецЕсли;
        
    КонецЦикла;
    
    СтрокаВызова = СтрШаблон(ШаблонВызова, Модуль, Метод, СтрСоединить(МассивВызова, ","));
    МассивСтрок.Добавить(СтрокаВызова);
    
    ТекстВыполнения = СтрСоединить(МассивСтрок, Символы.ПС);
    
    СтруктураВозврата = Новый Структура("Ошибка,Результат", Ложь, ТекстВыполнения);
    
    Возврат СтруктураВозврата;
    
КонецФункции

Процедура ДополнитьКэшСостава(Знач Библиотека, Знач ТаблицаПараметров, Команда = "") Экспорт
    
    Команда           = ?(ЗначениеЗаполнено(Команда), Команда, Библиотека);
    
    КэшированиеИндексов.Вставить(Команда, ТаблицаПараметров);
    СоответствиеКомандМодулей.Вставить(Команда, Библиотека);
    
КонецПроцедуры

Процедура УстановитьКаталоги(Знач ПутьПакетов, ПутьПриложения) Экспорт
    КаталогПакетов    = ПутьПакетов;
    КаталогПриложения = ПутьПриложения;
КонецПроцедуры

Процедура ОпределитьКаталогПакетов()
    
    ТекущийКаталог = ТекущийСценарий().Каталог;
    ТекущийКаталог = СтрЗаменить(ТекущийКаталог, "\", "/");
    
    ЧастиПути      = СтрРазделить(ТекущийКаталог, "/");
    ЧастиПути.Удалить(ЧастиПути.ВГраница());
    ЧастиПути.Удалить(ЧастиПути.ВГраница());

    КаталогПриложения = СтрСоединить(ЧастиПути, "/");

    ЧастиПути.Удалить(ЧастиПути.ВГраница());
    
    КаталогПакетов = СтрСоединить(ЧастиПути, "/");
    
КонецПроцедуры

Функция ТребуетсяОбработкаУправляющихПоследовательностей(Знач ИмяПараметра, Знач ЗначениеПараметра)
    
    Если Не ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда
        Возврат Ложь;
    КонецЕсли;
    
    ФайлПараметра         = Новый Файл(ЗначениеПараметра);
    ЗначениеПараметраСокр = СокрЛП(ЗначениеПараметра);
    
    Возврат Не СтрНачинаетсяС(ЗначениеПараметраСокр, "{")
    И Не СтрНачинаетсяС(ЗначениеПараметраСокр, "[") 
    И Не ФайлПараметра.Существует() 
    И Не ИмяПараметра = "Параметр_out";
    
КонецФункции

Функция СформироватьСтрокуИнициализацииМодуля(Знач ДанныеКоманды, Знач Модуль)
    
    КорневойКаталог = ?(ДанныеКоманды["cli_tool"]
        , КаталогПриложения
        , СтрШаблон("%1/%2", КаталогПакетов, "oint"));
        
    ШаблонЗагрузки = "Attached_%1 = ЗагрузитьСценарий(""%2/%3"", Контекст);";

    ПутьЗагрузки = СтрШаблон(ШаблонЗагрузки
        , Модуль
        , КорневойКаталог
        , ДанныеКоманды["path"]);

    ШаблонКонтекста = "Контекст.Вставить(""%1"", %2);";
    МассивВызова    = Новый Массив;

    МассивВызова.Добавить("Контекст = Новый Структура;");    
    МассивВызова.Добавить(СтрШаблон(ШаблонКонтекста, Модуль, "Неопределено"));
    МассивВызова.Добавить(ПутьЗагрузки);
    
    Если ДанныеКоманды["self_depend"] Тогда
        
        МассивВызова.Добавить(СтрШаблон(ШаблонКонтекста, Модуль, СтрШаблон("Attached_%1", Модуль)));
        МассивВызова.Добавить(ПутьЗагрузки);
        
    КонецЕсли;
    
    ТекстВыполнения = СтрСоединить(МассивВызова, Символы.ПС);

    Возврат ТекстВыполнения;
    
КонецФункции

Функция ПрочитатьJSONФайл(Знач Путь)
    
    ЧтениеJSON = Новый ЧтениеJSON();
    ЧтениеJSON.ОткрытьФайл(Путь);
    Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
    ЧтениеJSON.Закрыть();
    
    Возврат Данные;
    
КонецФункции
#Region Alternate

Procedure InitializeCommonLists() Export
    ИнициализироватьОсновныеСписки();
EndProcedure

Function GetVersion() Export
    Return ПолучитьВерсию();
EndFunction

Function GetCommandModuleMapping() Export
    Return ПолучитьСоответствиеКомандМодулей();
EndFunction

Function GetIndexData(Val Command) Export
    Return ПолучитьИнформациюИндекса(Command);
EndFunction

Function GetMethodData(Val Command, Val Method) Export
    Return ПолучитьИнформациюОМетоде(Command, Method);
EndFunction

Function GetFullComposition() Export
    Return ПолучитьПолныйСостав();
EndFunction

Function FormMethodCallString(Val PassedParameters, Val Command, Val Method, Val Dynamically = True, Val Interactive = False) Export
    Return СформироватьСтрокуВызоваМетода(PassedParameters, Command, Method, Dynamically, Interactive);
EndFunction

Procedure CompleteCompositionCache(Val Library, Val ParametersTable, Command = "") Export
    ДополнитьКэшСостава(Library, ParametersTable, Command);
EndProcedure

Procedure SetDirectories(Val PackagesPath, ApplicationPath) Export
    УстановитьКаталоги(PackagesPath, ApplicationPath);
EndProcedure

#EndRegion