// OneScript: ./OInt/api/lua/Modules/OPI_Lua.os
// Lib: Lua
// CLI: lua
// Keywords: lua

// DocsCategory: Other
// DocsNameRU: Lua
// DocsNameEN: Lua

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:UsingSynchronousCalls-off

//@skip-check method-too-many-params
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content

#Использовать "../../../tools/main"


#Область ПрограммныйИнтерфейс

#Область Основные

// Создать VM !NOCLI
// Инициализирует LuaVM указанной версии
//
// Примечание:
// Ошибка при создании VM вызовет исключение
//
// Параметры:
//  Версия      - Строка                     - Версия VM: Lua54, LuaJIT                                - ver
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Произвольный - Объект компоненты
Функция СоздатьVM(Знач Версия, Знач Логирование = Неопределено) Экспорт

    Если ЭтоVM(Версия) Тогда
        Возврат Версия;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Версия);

    Если Версия <> "Lua54" И Версия <> "LuaJIT" Тогда

        ВызватьИсключение "Unsupported Lua version. Required: Lua54, LuaJIT";

    КонецЕсли;

    Компонента = OPI_Компоненты.ПолучитьКомпоненту(Версия);

    Если Логирование = Неопределено Тогда

        СтрокаНастроек = "";

    Иначе

        ТекстОшибки    = "Некорректные настройки логирования";
        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Логирование, ТекстОшибки);
        СтрокаНастроек = OPI_Компоненты.СериализоватьJanx(Логирование);

    КонецЕсли;

    Если ЗначениеЗаполнено(СтрокаНастроек) Тогда

        РезультатЛога = Компонента.SetLogger(СтрокаНастроек);
        РезультатЛога = OPI_Компоненты.ДесериализоватьJanx(РезультатЛога);

        Если Не РезультатЛога["result"] Тогда
            ВызватьИсключение РезультатЛога["error"];
        КонецЕсли;

    КонецЕсли;

    Возврат Компонента;

КонецФункции

// Это VM !NOCLI
// Проверяет, что значение является объектом внешней компоненты Lua
//
// Параметры:
//  Значение - Произвольный - Значение для проверки - value
//
// Возвращаемое значение:
//  Булево -  Это коннектор
Функция ЭтоVM(Знач Значение) Экспорт

    ТипСтрокой = Строка(ТипЗнч(Значение));

    Возврат ТипСтрокой = "AddIn.OPI_LuaJIT.Main"
        Или ТипСтрокой = "AddIn.OPI_Lua54.Main"

КонецФункции

// Получить настройки логирования !NOCLI
// Получает структуру настроек для запуска логирования при старте сервера
//
// Параметры:
//  ЗаписьВПамять   - Булево - Запись лога в память для дальнейшего получения из объекта компоненты - memory
//  МаксимумСобытий - Число  - Максимальное число событий, хранящееся в память                      - count
//  ПутьКФайлу      - Строка - Путь к файлу для сохранения полного лога, если необходимо            - path
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Структура настроек
Функция ПолучитьНастройкиЛогирования(Знач ЗаписьВПамять = Истина
    , Знач МаксимумСобытий = 300
    , Знач ПутьКФайлу = "") Экспорт

    //@skip-check constructor-function-return-section
    Возврат OPI_Компоненты.ПолучитьНастройкиЛогирования(ЗаписьВПамять, МаксимумСобытий, ПутьКФайлу);

КонецФункции

// Получить лог !NOCLI
// Получает данные лога (при включенном логировании в память)
//
// Параметры:
//  ОбъектКомпоненты - Произвольный - Объект компоненты VM                                       - vm
//  КакСтрока        - Булево       - Истина > возвращает лог одной строкой, Ложь > как массив   - str
//  ЧислоСобытий     - Число        - Число последних событий для получения. 0 > без ограничений - count
//
// Возвращаемое значение:
//  Строка, Соответствие Из КлючИЗначение - Лог как строка или соответствие с полным результатом выполнения
Функция ПолучитьЛог(Знач ОбъектКомпоненты, Знач КакСтрока = Ложь, Знач ЧислоСобытий = 100) Экспорт

    Возврат OPI_Компоненты.ПолучитьЛог(ОбъектКомпоненты
        , КакСтрока
        , ЧислоСобытий);

КонецФункции

#КонецОбласти

#Область РаботаСоСкриптами

// Выполнить код из строки
// Выполняет Lua скрипт из переданной строки
//
// Примечание:
// Ошибка при выполнении Lua кода вызовет исключение
//
// Параметры:
//  Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Код - Строка       - Код строкой                               - code
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения кода
Функция ВыполнитьКодИзСтроки(Знач Lua, Знач Код) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Код);

    РезультатДД = Компонента.ExecuteString(Код);

    Возврат РезультатИзJanx(РезультатДД);

КонецФункции

// Выполнить код из файла
// Выполняет Lua скрипт на диске
//
// Примечание:
// Ошибка при выполнении Lua кода вызовет исключение
//
// Параметры:
//  Lua  - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Путь - Строка       - Путь к файлу скрипта                      - path
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения кода
Функция ВыполнитьКодИзФайла(Знач Lua, Знач Путь) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Путь);

    ФайлСкрипта = Новый Файл(Путь);

    Если Не ФайлСкрипта.Существует() Тогда
        ВызватьИсключение "File not found";
    КонецЕсли;

    РезультатДД = Компонента.ExecuteFile(ФайлСкрипта.ПолноеИмя);

    Возврат РезультатИзJanx(РезультатДД);

КонецФункции

// Вызвать функцию
// Вызывает функцию Lua с переданными параметрами
//
// Примечание:
// В качестве параметров функции допускаются любые JSON-совместимые типы и ДвоичныеДанные
// Функция должна быть предварительно определена в контексте при помощи одного из методов выполнения кода
//
// Параметры:
//  Lua        - Произвольный           - Компонента Lua или версия Lua для запуска - lua
//  ИмяФункции - Строка                 - Имя функции или путь вида module.func     - func
//  Параметры  - Массив Из Произвольный - Параметры функции                         - params
//
// Возвращаемое значение:
//  Произвольный - Результат вызова
Функция ВызватьФункцию(Знач Lua, Знач ИмяФункции, Знач Параметры = Неопределено) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(ИмяФункции);

    Если Параметры = Неопределено Тогда
        Параметры = Новый Массив;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьМассив(Параметры);

    АргументыДД = OPI_Компоненты.СериализоватьJanx(Параметры);
    РезультатДД = Компонента.CallFunction(ИмяФункции, АргументыДД);

    Возврат РезультатИзJanx(РезультатДД);

КонецФункции

#КонецОбласти

#Область РаботаСБайткодом

// Скомпилировать код из строки
// Преобразует исходный код в байт-код Lua
//
// Примечание:
// Ошибка при компиляции кода вызовет исключение
//
// Параметры:
//     Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Код    - Строка       - Программный код для компиляции            - code
//
// Возвращаемое значение:
//  ДвоичныеДанные - Результат компиляции
Функция СкомпилироватьКодИзСтроки(Знач Lua, Знач Код) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Код);

    Результат = Компонента.CompileToBytecode(Код);

    Если ТипЗнч(Результат) = Тип("Строка") Тогда
        ВызватьИсключение Результат;
    КонецЕсли;

    Возврат Результат;

КонецФункции

// Скомпилировать код из файла
// Преобразует файл исходного кода в байт-код Lua
//
// Примечание:
// Ошибка при компиляции кода вызовет исключение
//
// Параметры:
//     Lua - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Путь   - Строка       - Путь к файлу скрипта                      - path
//
// Возвращаемое значение:
//  ДвоичныеДанные - Результат компиляции
Функция СкомпилироватьКодИзФайла(Знач Lua, Знач Путь) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Путь);

    ФайлСкрипта = Новый Файл(Путь);

    Если Не ФайлСкрипта.Существует() Тогда
        ВызватьИсключение "File not found";
    КонецЕсли;

    Результат = Компонента.CompileFileToBytecode(Путь);

    Если ТипЗнч(Результат) = Тип("Строка") Тогда
        ВызватьИсключение Результат;
    КонецЕсли;

    Возврат Результат;

КонецФункции

// Выполнить байт код !NOCLI
// Выполняет ранее скомпилированный код
//
// Параметры:
//  Lua     - Произвольный   - Компонента Lua или версия Lua для запуска - lua
//  БайтКод - ДвоичныеДанные - Байт код для выполнения                   - code
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ВыполнитьБайтКод(Знач Lua, Знач БайтКод) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    Результат = Компонента.ExecuteBytecode(БайтКод);

    Возврат РезультатИзJanx(Результат);

КонецФункции

// Выполнить байт код файла
// Выполняет байт код из указанного файла
//
// Параметры:
//  Lua  - Произвольный - Компонента Lua или версия Lua для запуска - lua
//  Путь - Строка       - Путь к файлу с байт кодом                 - path
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения
Функция ВыполнитьБайтКодФайла(Знач Lua, Знач Путь) Экспорт

    Компонента = СоздатьVM(Lua);

    Если Не ЭтоVM(Компонента) Тогда
        Возврат Компонента;
    КонецЕсли;

    ФайлСкрипта = Новый Файл(Путь);

    Если Не ФайлСкрипта.Существует() Тогда
        ВызватьИсключение "File not found";
    КонецЕсли;

    Результат = Компонента.ExecuteBytecodeFile(Путь);

    Возврат РезультатИзJanx(Результат);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция РезультатИзJanx(Знач ДанныеJanx)

    Результат = OPI_Компоненты.ДесериализоватьJanx(ДанныеJanx);

    Если Не Результат["result"] Тогда
        ВызватьИсключение Результат["error"];
    КонецЕсли;

    Возврат Результат["data"];

КонецФункции

#КонецОбласти



#Region Alternate

Function CreateVM(Val Version, Val Logging = Undefined) Export
    Return СоздатьVM(Version, Logging);
EndFunction

Function IsVM(Val Value) Export
    Return ЭтоVM(Value);
EndFunction

Function GetLoggingSettings(Val WriteToMemory = True, Val MaxEvents = 300, Val FilePath = "") Export
    Return ПолучитьНастройкиЛогирования(WriteToMemory, MaxEvents, FilePath);
EndFunction

Function GetLog(Val AddInObject, Val AsString = False, Val EventCount = 100) Export
    Return ПолучитьЛог(AddInObject, AsString, EventCount);
EndFunction

Function ExecuteCodeFromString(Val Lua, Val Code) Export
    Return ВыполнитьКодИзСтроки(Lua, Code);
EndFunction

Function ExecuteCodeFromFile(Val Lua, Val Path) Export
    Return ВыполнитьКодИзФайла(Lua, Path);
EndFunction

Function CallFunction(Val Lua, Val FunctionName, Val Parameters = Undefined) Export
    Return ВызватьФункцию(Lua, FunctionName, Parameters);
EndFunction

Function CompileCodeFromString(Val Lua, Val Code) Export
    Return СкомпилироватьКодИзСтроки(Lua, Code);
EndFunction

Function CompileCodeFromFile(Val Lua, Val Path) Export
    Return СкомпилироватьКодИзФайла(Lua, Path);
EndFunction

Function ExecuteBytecode(Val Lua, Val Bytecode) Export
    Return ВыполнитьБайтКод(Lua, Bytecode);
EndFunction

Function ExecuteBytecodeFromFile(Val Lua, Val Path) Export
    Return ВыполнитьБайтКодФайла(Lua, Path);
EndFunction

#EndRegion