Процедура ЗапуститьЭхоСервер() Экспорт

    Порт          = 9876;
    РазмерПула = 10;

    НастройкиЛога    = OPI_TCP.ПолучитьНастройкиЛогирования(Истина, 500, "D:\SERVER_LOG.txt");
    ОбъектСервера = OPI_TCP.ЗапуститьСервер(Порт, РазмерПула, НастройкиЛога);

    Если Не OPI_TCP.ЭтоОбъектСервера(ОбъектСервера) Тогда
        ВызватьИсключение ОбъектСервера["error"];
    КонецЕсли;

    Попытка

        ШаблонОтвета = "Receive ""%1"". Your IP: %2";

        Пока Константы.ПоддерживатьСервер.Получить() Цикл

            Результат = OPI_TCP.ПолучитьДанныеОчередногоСоединения(ОбъектСервера, 10000, 8192);

            Если Не Результат["result"] Тогда

                ТекстОшибки = Результат["error"];

                Если ТекстОшибки = "timeout" Тогда
                    Продолжить;
                Иначе
                    ВызватьИсключение ТекстОшибки;
                КонецЕсли;

            КонецЕсли;

            IDСоединения = Результат["connectionId"];
            Адрес        = Результат["address"];
            Сообщение    = ПолучитьСтрокуИзДвоичныхДанных(Результат["message"]);

            Ответ = СтрШаблон(ШаблонОтвета, Сообщение, Адрес);

            OPI_TCP.ОтправитьДанные(ОбъектСервера, IDСоединения, Ответ);

        КонецЦикла;

    Исключение
        OPI_TCP.ОстановитьСервер(ОбъектСервера);
        ВызватьИсключение ОписаниеОшибки();
    КонецПопытки;

    OPI_TCP.ОстановитьСервер(ОбъектСервера);

КонецПроцедуры
