// OneScript: ./OInt/tests/Modules/OPItc_GreenAPI.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

//#Использовать "../../tools/main"
//#Использовать "../../tools/http"
//#Использовать "../../api"
//#Использовать asserts
//#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯкс("GreenAPI");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертс("GreenAPI");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область GreenAPI

Процедура GAPI_Аккаунт() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_TestGroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);

    GreenAPI_АрхивироватьЧат(ПараметрыТеста);
    GreenAPI_РазархивироватьЧат(ПараметрыТеста);
    GreenAPI_СформироватьПараметрыДоступа(ПараметрыТеста);
    GreenAPI_ПолучитьНастройкиИнстанса(ПараметрыТеста);
    GreenAPI_ПолучитьИнформациюОбАккаунте(ПараметрыТеста);
    GreenAPI_ПолучитьСтруктуруНастроекИнстанса(ПараметрыТеста);
    GreenAPI_УстановитьНастройкиИнстанса(ПараметрыТеста);
    GreenAPI_ПолучитьСостояниеИнстанса(ПараметрыТеста);
    GreenAPI_УстановитьКартинкуПрофиля(ПараметрыТеста);
    // !DISABLED! GreenAPI_ПерезапуститьИнстанс(ПараметрыТеста);
    // !DISABLED! GreenAPI_ПолучитьКодАвторизации(ПараметрыТеста);
    // !DISABLED! GreenAPI_РазлогинитьИнстанс(ПараметрыТеста);
    // !DISABLED! GreenAPI_ПолучитьQR(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_УправлениеГруппами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"            , ПараметрыТеста);

    GreenAPI_СоздатьГруппу(ПараметрыТеста);
    GreenAPI_ПолучитьИнформациюОГруппе(ПараметрыТеста);
    GreenAPI_ИзменитьИмяГруппы(ПараметрыТеста);
    GreenAPI_УстановитьКартинкуГруппы(ПараметрыТеста);
    GreenAPI_ДобавитьУчастникаВГруппу(ПараметрыТеста);
    GreenAPI_ИсключитьУчастникаГруппы(ПараметрыТеста);
    GreenAPI_НазначитьПраваАдминистратора(ПараметрыТеста);
    GreenAPI_ОтозватьПраваАдминистратора(ПараметрыТеста);
    GreenAPI_ПокинутьГруппу(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_ОтправкаСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_TestGroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"             , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Video"               , ПараметрыТеста);

    GreenAPI_ОтправитьТекстовоеСообщение(ПараметрыТеста);
    GreenAPI_ОтправитьФайл(ПараметрыТеста);
    GreenAPI_ОтправитьФайлПоURL(ПараметрыТеста);
    GreenAPI_ОтправитьОпрос(ПараметрыТеста);
    GreenAPI_ОтправитьЛокацию(ПараметрыТеста);
    GreenAPI_ОтправитьКонтакт(ПараметрыТеста);
    GreenAPI_ПереслатьСообщения(ПараметрыТеста);
    GreenAPI_ПолучитьОписаниеЛокации(ПараметрыТеста);
    GreenAPI_ПолучитьОписаниеКонтакта(ПараметрыТеста);
    GreenAPI_ИзменитьТекстСообщения(ПараметрыТеста);
    GreenAPI_УдалитьСообщение(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_ПолучениеУведомлений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"           , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"         , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance"       , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"            , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"        , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_FileMessageID"    , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_TestGroupID"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_DownloadMessageID", ПараметрыТеста);

    GreenAPI_ПолучитьУведомление(ПараметрыТеста);
    GreenAPI_УстановитьОтметкуПрочтения(ПараметрыТеста);
    // !DISABLED! GreenAPI_СкачатьФайлСообщения(ПараметрыТеста);
    GreenAPI_УдалитьУведомлениеИзОчереди(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_ОчередьСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"  , ПараметрыТеста);

    GreenAPI_ПолучитьОчередьСообщений(ПараметрыТеста);
    GreenAPI_ОчиститьОчередьСообщений(ПараметрыТеста);

КонецПроцедуры

Процедура GAPI_ЖурналыСообщений() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_ApiURL"     , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MediaURL"   , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_IdInstance" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_Token"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_TestGroupID", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_AccountID"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("GreenAPI_MessageID"  , ПараметрыТеста);

    GreenAPI_ПолучитьИсториюЧата(ПараметрыТеста);
    GreenAPI_ПолучитьСообщение(ПараметрыТеста);
    GreenAPI_ПолучитьЖурналВходящихСообщений(ПараметрыТеста);
    GreenAPI_ПолучитьЖурналИсходящихСообщений(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // GreenAPI

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область GreenAPI

Процедура GreenAPI_СформироватьПараметрыДоступа(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "СформироватьПараметрыДоступа");

КонецПроцедуры

Процедура GreenAPI_ПолучитьНастройкиИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьНастройкиИнстанса", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьНастройкиИнстанса", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПолучитьИнформациюОбАккаунте(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьИнформациюОбАккаунте", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьИнформациюОбАккаунте");

КонецПроцедуры

Процедура GreenAPI_ПолучитьСтруктуруНастроекИнстанса(ПараметрыФункции)

    Опции = Новый Структура;

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьСтруктуруНастроекИнстанса", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьСтруктуруНастроекИнстанса");

    Опции = Новый Структура;
    Опции.Вставить("empty", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьСтруктуруНастроекИнстанса", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьСтруктуруНастроекИнстанса", "Пустая");

КонецПроцедуры

Процедура GreenAPI_УстановитьНастройкиИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);

    СтруктураНастроек = Новый Структура;
    СтруктураНастроек.Вставить("pollMessageWebhook"       , "yes");
    СтруктураНастроек.Вставить("incomingBlockWebhook"     , "no");
    СтруктураНастроек.Вставить("incomingCallWebhook"      , "no");
    СтруктураНастроек.Вставить("editedMessageWebhook"     , "yes");
    СтруктураНастроек.Вставить("deletedMessageWebhook"    , "yes");
    СтруктураНастроек.Вставить("outgoingAPIMessageWebhook", "yes");

    Опции = Новый Структура;
    Опции.Вставить("settings", СтруктураНастроек);
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "УстановитьНастройкиИнстанса", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "УстановитьНастройкиИнстанса");

КонецПроцедуры

Процедура GreenAPI_ПолучитьСостояниеИнстанса(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьСостояниеИнстанса", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьСостояниеИнстанса");

КонецПроцедуры

Процедура GreenAPI_ПерезапуститьИнстанс(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПерезапуститьИнстанс", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПерезапуститьИнстанс");

КонецПроцедуры

Процедура GreenAPI_ПолучитьQR(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьQR", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьQR");

КонецПроцедуры

Процедура GreenAPI_РазлогинитьИнстанс(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "РазлогинитьИнстанс", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "РазлогинитьИнстанс");

КонецПроцедуры

Процедура GreenAPI_ПолучитьКодАвторизации(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    НомерТелефона = 441234567890;

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("phone", НомерТелефона);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьКодАвторизации", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьКодАвторизации");

КонецПроцедуры

Процедура GreenAPI_УстановитьКартинкуПрофиля(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("picture", Картинка);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "УстановитьКартинкуПрофиля", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "УстановитьКартинкуПрофиля");

КонецПроцедуры

Процедура GreenAPI_СоздатьГруппу(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Имя = "New group";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("name", Имя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СоздатьГруппу", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "СоздатьГруппу", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПокинутьГруппу(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы = ПараметрыФункции["GreenAPI_GroupID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("group", IDГруппы);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПокинутьГруппу", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПокинутьГруппу");

КонецПроцедуры

Процедура GreenAPI_ПолучитьИнформациюОГруппе(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы = ПараметрыФункции["GreenAPI_GroupID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("group", IDГруппы);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьИнформациюОГруппе", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьИнформациюОГруппе");

КонецПроцедуры

Процедура GreenAPI_ИзменитьИмяГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы = ПараметрыФункции["GreenAPI_GroupID"];
    Имя      = "New name";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("group", IDГруппы);
    Опции.Вставить("name", Имя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ИзменитьИмяГруппы", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ИзменитьИмяГруппы");

КонецПроцедуры

Процедура GreenAPI_ДобавитьУчастникаВГруппу(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы       = ПараметрыФункции["GreenAPI_GroupID"];
    IDПользователя = "123123123@c.us";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("group", IDГруппы);
    Опции.Вставить("user", IDПользователя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ДобавитьУчастникаВГруппу", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ДобавитьУчастникаВГруппу");

КонецПроцедуры

Процедура GreenAPI_ИсключитьУчастникаГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы       = ПараметрыФункции["GreenAPI_GroupID"];
    IDПользователя = "123123123@c.us";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("group", IDГруппы);
    Опции.Вставить("user", IDПользователя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ИсключитьУчастникаГруппы", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ИсключитьУчастникаГруппы");

КонецПроцедуры

Процедура GreenAPI_НазначитьПраваАдминистратора(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы       = ПараметрыФункции["GreenAPI_GroupID"];
    IDПользователя = "123123123@c.us";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("group", IDГруппы);
    Опции.Вставить("user", IDПользователя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "НазначитьПраваАдминистратора", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "НазначитьПраваАдминистратора");

КонецПроцедуры

Процедура GreenAPI_ОтозватьПраваАдминистратора(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDГруппы       = ПараметрыФункции["GreenAPI_GroupID"];
    IDПользователя = "123123123@c.us";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("group", IDГруппы);
    Опции.Вставить("user", IDПользователя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтозватьПраваАдминистратора", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтозватьПраваАдминистратора");

КонецПроцедуры

Процедура GreenAPI_УстановитьКартинкуГруппы(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Картинка = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    IDГруппы = ПараметрыФункции["GreenAPI_GroupID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("group", IDГруппы);
    Опции.Вставить("picture", Картинка);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "УстановитьКартинкуГруппы", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "УстановитьКартинкуГруппы");

КонецПроцедуры

Процедура GreenAPI_ОтправитьТекстовоеСообщение(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];
    Текст  = "Новое сообщение";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("text", Текст);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьТекстовоеСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьТекстовоеСообщение", , ПараметрыФункции);

    IDСообщения = Результат["idMessage"];
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("text", Текст);
    Опции.Вставить("quoted", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьТекстовоеСообщение", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьТекстовоеСообщение", "Цитата");

КонецПроцедуры

Процедура GreenAPI_УдалитьСообщение(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_MessageID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("message", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "УдалитьСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "УдалитьСообщение");

КонецПроцедуры

Процедура GreenAPI_ИзменитьТекстСообщения(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_MessageID"];
    Текст       = "Новый текст сообщения";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("message", IDСообщения);
    Опции.Вставить("text", Текст);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ИзменитьТекстСообщения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ИзменитьТекстСообщения");

КонецПроцедуры

Процедура GreenAPI_ОтправитьФайл(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Файл     = ПараметрыФункции["Picture"]; // URL, Путь или Двоичные данные
    ИмяФайла = "photo.jpg";
    IDЧата   = ПараметрыФункции["GreenAPI_TestGroupID"];
    Описание = "Описание файла";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("file", Файл);
    Опции.Вставить("filename", ИмяФайла);
    Опции.Вставить("caption", Описание);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьФайл", , ПараметрыФункции);

    Файл     = ПараметрыФункции["Video"];
    ИмяФайла = "vid.mp4";

    IDСообщения = Результат["idMessage"];
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("file", Файл);
    Опции.Вставить("filename", ИмяФайла);
    Опции.Вставить("caption", Описание);
    Опции.Вставить("quoted", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьФайл", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьФайл", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ОтправитьФайлПоURL(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Файл     = ПараметрыФункции["Picture"];
    ИмяФайла = "photo.jpg";
    IDЧата   = ПараметрыФункции["GreenAPI_TestGroupID"];
    Описание = "Описание файла";

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("url", Файл);
    Опции.Вставить("filename", ИмяФайла);
    Опции.Вставить("caption", Описание);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьФайлПоURL", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьФайлПоURL", , ПараметрыФункции);

    Файл     = ПараметрыФункции["Video"];
    ИмяФайла = "vid.mp4";

    IDСообщения = Результат["idMessage"];
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("url", Файл);
    Опции.Вставить("filename", ИмяФайла);
    Опции.Вставить("caption", Описание);
    Опции.Вставить("quoted", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьФайлПоURL", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьФайлПоURL", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ОтправитьОпрос(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];
    Текст  = "Какой ваш любимый цвет?";

    Варианты = Новый Массив;
    Варианты.Добавить("Красный");
    Варианты.Добавить("Желтый");
    Варианты.Добавить("Зеленый");

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("text", Текст);
    Опции.Вставить("options", Варианты);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьОпрос", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьОпрос", , ПараметрыФункции);

    IDСообщения = Результат["idMessage"];
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("text", Текст);
    Опции.Вставить("options", Варианты);
    Опции.Вставить("multi", Истина);
    Опции.Вставить("quoted", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьОпрос", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьОпрос", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ПолучитьОписаниеЛокации(ПараметрыФункции)

    Широта   = 53.908522;
    Долгота  = 27.574821;
    Адрес    = "Площадь Победы, Минск";
    Название = "пл. Победы";

    Опции = Новый Структура;
    Опции.Вставить("lat", Широта);
    Опции.Вставить("long", Долгота);
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("name", Название);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьОписаниеЛокации", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьОписаниеЛокации");

КонецПроцедуры

Процедура GreenAPI_ОтправитьЛокацию(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    Широта   = 53.908522;
    Долгота  = 27.574821;
    Адрес    = "Площадь Победы, Минск";
    Название = "пл. Победы";

    Опции = Новый Структура;
    Опции.Вставить("lat", Широта);
    Опции.Вставить("long", Долгота);
    Опции.Вставить("addr", Адрес);
    Опции.Вставить("name", Название);

    Локация = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьОписаниеЛокации", Опции);

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("loc", Локация);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьЛокацию", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьЛокацию", , ПараметрыФункции);

    IDСообщения = Результат["idMessage"];
    Опции = Новый Структура;
    Опции.Вставить("lat", Широта);
    Опции.Вставить("long", Долгота);

    Локация = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьОписаниеЛокации", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("loc", Локация);
    Опции.Вставить("quoted", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьЛокацию", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьЛокацию", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ПолучитьОписаниеКонтакта(ПараметрыФункции)

    Телефон  = 79001234568;
    Имя      = "Артем";
    Фамилия  = "Евпаторийский";
    Отчество = "Петрович";
    Компания = "Велосипед";

    Опции = Новый Структура;
    Опции.Вставить("phone", Телефон);
    Опции.Вставить("name", Имя);
    Опции.Вставить("surname", Фамилия);
    Опции.Вставить("midname", Отчество);
    Опции.Вставить("company", Компания);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьОписаниеКонтакта", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьОписаниеКонтакта");

КонецПроцедуры

Процедура GreenAPI_ОтправитьКонтакт(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    Телефон  = 79001234568;
    Имя      = "Артем";
    Фамилия  = "Евпаторийский";
    Отчество = "Петрович";
    Компания = "Велосипед";

    Опции = Новый Структура;
    Опции.Вставить("phone", Телефон);
    Опции.Вставить("name", Имя);
    Опции.Вставить("surname", Фамилия);
    Опции.Вставить("midname", Отчество);
    Опции.Вставить("company", Компания);

    Контакт = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьОписаниеКонтакта", Опции);

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("contact", Контакт);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьКонтакт", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьКонтакт", , ПараметрыФункции);

    IDСообщения = Результат["idMessage"];
    Опции = Новый Структура;
    Опции.Вставить("phone", Телефон);
    Опции.Вставить("company", Компания);

    Контакт = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьОписаниеКонтакта", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("contact", Контакт);
    Опции.Вставить("quoted", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОтправитьКонтакт", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОтправитьКонтакт", "Цитата");

КонецПроцедуры

Процедура GreenAPI_ПереслатьСообщения(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Откуда = "11001234567@c.us";
    Откуда = ПараметрыФункции["GreenAPI_TestGroupID"]; // SKIP
    Куда   = ПараметрыФункции["GreenAPI_TestGroupID"];

    Сообщение = ПараметрыФункции["GreenAPI_MessageID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("from", Откуда);
    Опции.Вставить("to", Куда);
    Опции.Вставить("msgs", Сообщение);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПереслатьСообщения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПереслатьСообщения");

КонецПроцедуры

Процедура GreenAPI_ПолучитьУведомление(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьУведомление", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьУведомление", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_УдалитьУведомлениеИзОчереди(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDДоставки = ПараметрыФункции["GreenAPI_ReceiptID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("receipt", IDДоставки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "УдалитьУведомлениеИзОчереди", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "УдалитьУведомлениеИзОчереди");

КонецПроцедуры

Процедура GreenAPI_СкачатьФайлСообщения(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_FileMessageID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("message", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СкачатьФайлСообщения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "СкачатьФайлСообщения");

КонецПроцедуры

Процедура GreenAPI_УстановитьОтметкуПрочтения(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_FileMessageID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("message", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "УстановитьОтметкуПрочтения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "УстановитьОтметкуПрочтения");

КонецПроцедуры

Процедура GreenAPI_ПолучитьОчередьСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьОчередьСообщений", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьОчередьСообщений");

КонецПроцедуры

Процедура GreenAPI_ОчиститьОчередьСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ОчиститьОчередьСообщений", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ОчиститьОчередьСообщений");

КонецПроцедуры

Процедура GreenAPI_ПолучитьИсториюЧата(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьИсториюЧата", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьИсториюЧата", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПолучитьСообщение(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата      = ПараметрыФункции["GreenAPI_TestGroupID"];
    IDСообщения = ПараметрыФункции["GreenAPI_MessageID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);
    Опции.Вставить("msg", IDСообщения);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьСообщение", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПолучитьЖурналВходящихСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьЖурналВходящихСообщений", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьЖурналВходящихСообщений", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_ПолучитьЖурналИсходящихСообщений(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "ПолучитьЖурналИсходящихСообщений", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "ПолучитьЖурналИсходящихСообщений", , ПараметрыФункции);

КонецПроцедуры

Процедура GreenAPI_АрхивироватьЧат(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);

    OPI_GreenAPI.РазархивироватьЧат(ПараметрыДоступа, IDЧата); // SKIP

    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "АрхивироватьЧат", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "АрхивироватьЧат");

КонецПроцедуры

Процедура GreenAPI_РазархивироватьЧат(ПараметрыФункции)

    ApiUrl           = ПараметрыФункции["GreenAPI_ApiURL"];
    MediaUrl         = ПараметрыФункции["GreenAPI_MediaURL"];
    IdInstance       = ПараметрыФункции["GreenAPI_IdInstance"];
    ApiTokenInstance = ПараметрыФункции["GreenAPI_Token"];

    IDЧата = ПараметрыФункции["GreenAPI_TestGroupID"];

    Опции = Новый Структура;
    Опции.Вставить("api", ApiUrl);
    Опции.Вставить("media", MediaUrl);
    Опции.Вставить("id", IdInstance);
    Опции.Вставить("token", ApiTokenInstance);

    ПараметрыДоступа = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "СформироватьПараметрыДоступа", Опции);
    Опции = Новый Структура;
    Опции.Вставить("access", ПараметрыДоступа);
    Опции.Вставить("chat", IDЧата);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("greenapi", "РазархивироватьЧат", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "GreenAPI", "РазархивироватьЧат");

КонецПроцедуры

#КонецОбласти // GreenAPI

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure GAPI_Account() Export
    GAPI_Аккаунт();
EndProcedure

Procedure GAPI_GroupManagement() Export
    GAPI_УправлениеГруппами();
EndProcedure

Procedure GAPI_MessageSending() Export
    GAPI_ОтправкаСообщений();
EndProcedure

Procedure GAPI_NotificationsReceiving() Export
    GAPI_ПолучениеУведомлений();
EndProcedure

Procedure GAPI_MessageQueue() Export
    GAPI_ОчередьСообщений();
EndProcedure

Procedure GAPI_MessageLogs() Export
    GAPI_ЖурналыСообщений();
EndProcedure

#EndRegion
