// OneScript: ./OInt/tests/Modules/OPItc_SFTP.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

//#Использовать "../../tools/main"
//#Использовать "../../tools/http"
//#Использовать "../../api"
//#Использовать asserts
//#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯксCLI("SFTP");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("SFTP");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область SFTP

Процедура SF_ОсновныеМетоды() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровSSH();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        SFTP_ОткрытьСоединение(ПараметрыТеста);
        SFTP_ПолучитьКонфигурациюСоединения(ПараметрыТеста);
        SFTP_ЭтоКоннектор(ПараметрыТеста);
        SFTP_ЗакрытьСоединение(ПараметрыТеста);
        SFTP_ПолучитьНастройкиЛогинПароль(ПараметрыТеста);
        SFTP_ПолучитьНастройкиПриватныйКлюч(ПараметрыТеста);
        SFTP_ПолучитьНастройкиЧерезАгента(ПараметрыТеста);
        SFTP_ПолучитьНастройкиKI(ПараметрыТеста);
        SFTP_ПолучитьНастройкиПрокси(ПараметрыТеста);

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(МассивВариантов[0]["SSH_Key"], "Ошибка удаления файла после теста");

КонецПроцедуры

Процедура SF_РаботаСДиректориями() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровSSH();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        SFTP_ПолучитьТекущийКаталог(ПараметрыТеста);
        SFTP_ПолучитьСписокОбъектов(ПараметрыТеста);
        SFTP_СоздатьНовуюДиректорию(ПараметрыТеста);
        SFTP_УдалитьДиректорию(ПараметрыТеста);

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(МассивВариантов[0]["SSH_Key"], "Ошибка удаления файла после теста");

КонецПроцедуры

Процедура SF_РаботаСФайлами() Экспорт

    МассивВариантов = OPI_ПолучениеДанныхТестов.ПолучитьВариантыПараметровSSH();

    Для Каждого ПараметрыТеста Из МассивВариантов Цикл

        SFTP_ЗагрузитьФайл(ПараметрыТеста);
        SFTP_ПолучитьИнформациюОФайле(ПараметрыТеста);
        SFTP_ПолучитьДанныеФайла(ПараметрыТеста);
        SFTP_СохранитьФайл(ПараметрыТеста);
        SFTP_ИзменитьПуть(ПараметрыТеста);
        SFTP_УдалитьФайл(ПараметрыТеста);

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(МассивВариантов[0]["SSH_Key"], "Ошибка удаления файла после теста");

КонецПроцедуры

#КонецОбласти // SFTP

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область SFTP

Процедура SFTP_ОткрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Результат = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ОткрытьСоединение", Постфикс);

КонецПроцедуры

Процедура SFTP_СоздатьНовуюДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "new_dir");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "СоздатьНовуюДиректорию", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "СоздатьНовуюДиректорию", Постфикс);

КонецПроцедуры

Процедура SFTP_УдалитьДиректорию(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "new_dir");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "УдалитьДиректорию", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "УдалитьДиректорию", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьТекущийКаталог(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьТекущийКаталог", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьТекущийКаталог", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьСписокОбъектов(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "test_folder");
        Опции.Вставить("rcv", Истина);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьСписокОбъектов", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьСписокОбъектов", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "test_folder");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьСписокОбъектов", Постфикс + ", Без рекурсии");

КонецПроцедуры

Процедура SFTP_ЗагрузитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Картинка = "C:\pic.png";

    Картинка = ПараметрыФункции["Picture"];       // SKIP
    ИВФ      = ПолучитьИмяВременногоФайла("png"); // SKIP
    КопироватьФайл(Картинка, ИВФ);                // SKIP
    Картинка = ИВФ;                               // SKIP

    КартинкаДД = Новый ДвоичныеДанные(Картинка);

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда

        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("file", Картинка);
        Опции.Вставить("path", "pic_from_disk.png");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ЗагрузитьФайл", Опции);
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("file", КартинкаДД);
        Опции.Вставить("path", "files_folder/pic_from_binary.png");

        Результат2 = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ЗагрузитьФайл", Опции);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    ЗагруженныйФайл = Новый Файл(Картинка);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "ЗагрузитьФайл", Постфикс               , ЗагруженныйФайл.Размер());
    OPI_ПолучениеДанныхТестов.Обработать(Результат2, "SFTP", "ЗагрузитьФайл", "Двоичные, " + Постфикс, КартинкаДД.Размер());

    РазмерФайлаЛокальный   = ЗагруженныйФайл.Размер();
    РазмерФайлаЛокальныйДД = КартинкаДД.Размер();

    РазмерФайлаУдаленный   = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "pic_from_disk.png")["data"]["size"];
    РазмерФайлаУдаленныйДД = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, "files_folder/pic_from_binary.png")["data"]["size"];

    OPI_ПолучениеДанныхТестов.Обработать(РазмерФайлаЛокальный  , "SFTP", "СохранитьФайл", "Размер файла, " + Постфикс    , РазмерФайлаУдаленный);
    OPI_ПолучениеДанныхТестов.Обработать(РазмерФайлаЛокальныйДД, "SFTP", "СохранитьФайл", "Размер файла, ДД, " + Постфикс, РазмерФайлаУдаленныйДД);

    Для Н = 1 По 7 Цикл

        Результат  = OPI_SFTP.ЗагрузитьФайл(Соединение, Картинка, "pic_from_disk.png");
        Результат2 = OPI_SFTP.ЗагрузитьФайл(Соединение, КартинкаДД, "files_folder/pic_from_binary.png");

        Если Не Результат["result"] Тогда
            OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ЗагрузитьФайл", "Множественный, " + Постфикс, КартинкаДД.Размер());
        КонецЕсли;

        Если Не Результат2["result"] Тогда
            OPI_ПолучениеДанныхТестов.Обработать(Результат2, "SFTP", "ЗагрузитьФайл", "Множественный, двоичные, " + Постфикс, КартинкаДД.Размер());
        КонецЕсли;

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(ИВФ, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура SFTP_УдалитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "files_folder/pic_from_binary.png");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "УдалитьФайл", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "УдалитьФайл", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "files_folder/pic_from_binary.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "УдалитьФайл", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "УдалитьФайл", "Несуществующий, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "files_folder");
    Опции.Вставить("rcv", Истина);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьСписокОбъектов", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "УдалитьФайл", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура SFTP_ЭтоКоннектор(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);
    Результат  = OPI_SFTP.ЭтоКоннектор(Соединение);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ЭтоКоннектор", Постфикс);

    Результат = OPI_SFTP.ЭтоКоннектор("a");

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ЭтоКоннектор", "Ошибка, " + Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиЛогинПароль(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["SSH_Host"];
    Порт   = ПараметрыФункции["SSH_Port"];
    Логин  = ПараметрыФункции["SSH_User"];
    Пароль = ПараметрыФункции["SSH_Password"];

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("user", Логин);
    Опции.Вставить("pass", Пароль);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьНастройкиЛогинПароль", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиПриватныйКлюч(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост          = ПараметрыФункции["SSH_Host"];
    Порт          = ПараметрыФункции["SSH_Port"];
    Логин         = ПараметрыФункции["SSH_User"];
    ПриватныйКлюч = "./ssh_key";
    ПубличныйКлюч = "./ssh_key.pub";

    ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
    ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("user", Логин);
    Опции.Вставить("key", ПриватныйКлюч);
    Опции.Вставить("pub", ПубличныйКлюч);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПриватныйКлюч", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьНастройкиПриватныйКлюч", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиЧерезАгента(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост      = ПараметрыФункции["SSH_Host"];
    Порт      = ПараметрыФункции["SSH_Port"];
    Логин     = ПараметрыФункции["SSH_User"];
    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("user", Логин);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЧерезАгента", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьНастройкиЧерезАгента", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиKI(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост   = ПараметрыФункции["SSH_Host"];
    Порт   = ПараметрыФункции["SSH_Port"];
    Логин  = ПараметрыФункции["SSH_User"];
    Пароль = ПараметрыФункции["SSH_Password"];

    МассивОтветов = Новый Массив;
    МассивОтветов.Добавить("yes");
    МассивОтветов.Добавить(Пароль);

    Опции = Новый Структура;
    Опции.Вставить("host", Хост);
    Опции.Вставить("port", Порт);
    Опции.Вставить("user", Логин);
    Опции.Вставить("prompts", МассивОтветов);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиKI", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьНастройкиKI", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьНастройкиПрокси(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

    АдресПрокси  = ПараметрыФункции["Proxy_IP"];
    ПортПрокси   = ПараметрыФункции["Proxy_Port"];
    ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
    ПарольПрокси = ПараметрыФункции["Proxy_Password"];

    Опции = Новый Структура;
    Опции.Вставить("addr", АдресПрокси);
    Опции.Вставить("port", ПортПрокси);
    Опции.Вставить("type", ТипПрокси);
    Опции.Вставить("login", ЛогинПрокси);
    Опции.Вставить("pass", ПарольПрокси);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьНастройкиПрокси", Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьКонфигурациюСоединения(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Опции = Новый Структура;
    Опции.Вставить("set", НастройкиSFTP);
    Опции.Вставить("proxy", НастройкиПрокси);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьКонфигурациюСоединения", Опции);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьКонфигурациюСоединения", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Результат);
    Опции.Вставить("comm", "whoami");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("ssh", "ВыполнитьКоманду", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьКонфигурациюСоединения", "Проверка, " + Постфикс);

КонецПроцедуры

Процедура SFTP_ЗакрытьСоединение(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Результат = OPI_SFTP.ЗакрытьСоединение(Соединение);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ЗакрытьСоединение", Постфикс);

КонецПроцедуры

Процедура SFTP_СохранитьФайл(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда

        Путь     = "pic_from_disk.png";
        ИмяФайла = ПолучитьИмяВременногоФайла("bin");

        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", Путь);
        Опции.Вставить("file", ИмяФайла);

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "СохранитьФайл", Опции);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "СохранитьФайл", Постфикс);

    ЗагруженныйФайл      = Новый Файл(ИмяФайла);
    РазмерФайлаЛокальный = ЗагруженныйФайл.Размер();
    РазмерФайлаУдаленный = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, Путь)["data"]["size"];

    OPI_ПолучениеДанныхТестов.Обработать(РазмерФайлаЛокальный, "SFTP", "СохранитьФайл", "Размер файла, " + Постфикс, РазмерФайлаУдаленный);

    Путь = "files_folder/pic_from_binary.png";

    Для Н = 1 По 20 Цикл

        Результат = OPI_SFTP.СохранитьФайл(Соединение, Путь, ИмяФайла);

        Если Не Результат["result"] Тогда
            OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "СохранитьФайл", "Множественный, " + Постфикс);
        КонецЕсли;

    КонецЦикла;

    OPI_Инструменты.УдалитьФайлВПопытке(ИмяФайла, "Не удалось удалить временный файл после теста!");

КонецПроцедуры

Процедура SFTP_ПолучитьДанныеФайла(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда

        Путь      = "pic_from_disk.png";
        Результат = OPI_SFTP.ПолучитьДанныеФайла(Соединение, Путь);

    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьДанныеФайла", Постфикс);

    РазмерФайлаЛокальный = Результат.Размер();
    РазмерФайлаУдаленный = OPI_SFTP.ПолучитьИнформациюОФайле(Соединение, Путь)["data"]["size"];

    OPI_ПолучениеДанныхТестов.Обработать(РазмерФайлаЛокальный, "SFTP", "ПолучитьДанныеФайла", "Размер файла, " + Постфикс, РазмерФайлаУдаленный);

    Путь = "files_folder/pic_from_binary.png";

    Для Н = 1 По 20 Цикл

        Результат = OPI_SFTP.ПолучитьДанныеФайла(Соединение, Путь);

        Если Не ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
            OPI_ПолучениеДанныхТестов.Обработать(Результат, "SFTP", "ПолучитьДанныеФайла", "Множественный, " + Постфикс);
        КонецЕсли;

    КонецЦикла;

КонецПроцедуры

Процедура SFTP_ИзменитьПуть(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("old", "pic_from_disk.png");
        Опции.Вставить("new", "files_folder/pic_from_disk.png");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ИзменитьПуть", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "ИзменитьПуть", Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "pic_from_disk.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьИнформациюОФайле", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "ИзменитьПуть", "Проверка, Старый, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "files_folder/pic_from_disk.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьИнформациюОФайле", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "ИзменитьПуть", "Проверка, Новый, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("old", "files_folder/pic_from_disk.png");
    Опции.Вставить("new", "pic_from_disk.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ИзменитьПуть", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "ИзменитьПуть", "Обратно, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "files_folder/pic_from_disk.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьИнформациюОФайле", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "ИзменитьПуть", "Проверка, Старый, Обратно, " + Постфикс);

    Опции = Новый Структура;
    Опции.Вставить("conn", Соединение);
    Опции.Вставить("path", "pic_from_disk.png");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьИнформациюОФайле", Опции);

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "ИзменитьПуть", "Проверка, Новый, Обратно, " + Постфикс);

КонецПроцедуры

Процедура SFTP_ПолучитьИнформациюОФайле(ПараметрыФункции)

    Постфикс = ПараметрыФункции["Postfix"]; // SKIP

    Хост = ПараметрыФункции["SSH_Host"];
    Порт = ПараметрыФункции["SSH_Port"];

    ИспользоватьПрокси = Истина;
    НастройкиПрокси    = Неопределено;
    ВидАвторизации     = "По логину и паролю";

    ИспользоватьПрокси = ПараметрыФункции["Proxy"];    // SKIP
    ВидАвторизации     = ПараметрыФункции["AuthType"]; // SKIP

    Если ВидАвторизации = "По логину и паролю" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        Опции = Новый Структура;
        Опции.Вставить("host", Хост);
        Опции.Вставить("port", Порт);
        Опции.Вставить("user", Логин);
        Опции.Вставить("pass", Пароль);

        НастройкиSFTP = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиЛогинПароль", Опции);

    ИначеЕсли ВидАвторизации = "По ключу" Тогда

        Логин         = ПараметрыФункции["SSH_User"];
        ПриватныйКлюч = "./ssh_key";
        ПубличныйКлюч = "./ssh_key.pub";

        ПриватныйКлюч = ПараметрыФункции["SSH_Key"];   // SKIP
        ПубличныйКлюч = ПараметрыФункции["SSH_Pub"];   // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиПриватныйКлюч(Хост, Порт, Логин, ПриватныйКлюч, ПубличныйКлюч);

    ИначеЕсли ВидАвторизации = "Keyboard interactive" Тогда

        Логин  = ПараметрыФункции["SSH_User"];
        Пароль = ПараметрыФункции["SSH_Password"];

        МассивОтветов = Новый Массив;
        МассивОтветов.Добавить(Пароль);

        Порт = ПараметрыФункции["SSH_PortKI"]; // SKIP

        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиKI(Хост, Порт, Логин, МассивОтветов);

    Иначе

        Логин         = ПараметрыФункции["SSH_User"];
        НастройкиSFTP = OPI_SFTP.ПолучитьНастройкиЧерезАгента(Хост, Порт, Логин);

    КонецЕсли;

    Если ИспользоватьПрокси Тогда

        ТипПрокси = ПараметрыФункции["Proxy_Type"]; // http, socks5, socks4

        АдресПрокси  = ПараметрыФункции["Proxy_IP"];
        ПортПрокси   = ПараметрыФункции["Proxy_Port"];
        ЛогинПрокси  = ПараметрыФункции["Proxy_User"];
        ПарольПрокси = ПараметрыФункции["Proxy_Password"];

        Опции = Новый Структура;
        Опции.Вставить("addr", АдресПрокси);
        Опции.Вставить("port", ПортПрокси);
        Опции.Вставить("type", ТипПрокси);
        Опции.Вставить("login", ЛогинПрокси);
        Опции.Вставить("pass", ПарольПрокси);

        НастройкиПрокси = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьНастройкиПрокси", Опции);

    КонецЕсли;

    Соединение = OPI_SFTP.ОткрытьСоединение(НастройкиSFTP, НастройкиПрокси);

    Если OPI_SFTP.ЭтоКоннектор(Соединение) Тогда
        Опции = Новый Структура;
        Опции.Вставить("conn", Соединение);
        Опции.Вставить("path", "files_folder/pic_from_binary.png");

        Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("sftp", "ПолучитьИнформациюОФайле", Опции);
    Иначе
        Результат = Соединение; // Ошибка соединения
    КонецЕсли;

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат , "SFTP", "ПолучитьИнформациюОФайле", Постфикс);

КонецПроцедуры

#КонецОбласти // SFTP

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#Region Alternate

Procedure SF_CommonMethods() Export
    SF_ОсновныеМетоды();
EndProcedure

Procedure SF_DirectoryManagement() Export
    SF_РаботаСДиректориями();
EndProcedure

Procedure SF_FileManagement() Export
    SF_РаботаСФайлами();
EndProcedure

#EndRegion
