Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetListOfBases";
    НоваяСтрока.МетодПоиска = "GETLISTOFBASES";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Database work";
    НоваяСтрока.ОписаниеМетода   = "Gets the list of available bases";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetListOfBases";
    НоваяСтрока.МетодПоиска = "GETLISTOFBASES";
    НоваяСтрока.Параметр    = "--offset";
    НоваяСтрока.Описание    = "Next page identifier of the base list from the previous request (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Database work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetDatabaseTables";
    НоваяСтрока.МетодПоиска = "GETDATABASETABLES";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Database work";
    НоваяСтрока.ОписаниеМетода   = "Gets the schema of base tables";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetDatabaseTables";
    НоваяСтрока.МетодПоиска = "GETDATABASETABLES";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Base identifier";
    НоваяСтрока.Область     = "Database work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateDatabase";
    НоваяСтрока.МетодПоиска = "CREATEDATABASE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Database work";
    НоваяСтрока.ОписаниеМетода   = "Creates a new database";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateDatabase";
    НоваяСтрока.МетодПоиска = "CREATEDATABASE";
    НоваяСтрока.Параметр    = "--ws";
    НоваяСтрока.Описание    = "Workspace identifier";
    НоваяСтрока.Область     = "Database work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateDatabase";
    НоваяСтрока.МетодПоиска = "CREATEDATABASE";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New base name";
    НоваяСтрока.Область     = "Database work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateDatabase";
    НоваяСтрока.МетодПоиска = "CREATEDATABASE";
    НоваяСтрока.Параметр    = "--Table description: Key > name, Value > array of fields";
    НоваяСтрока.Описание    = "tablesdata";
    НоваяСтрока.Область     = "Database work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateTable";
    НоваяСтрока.МетодПоиска = "CREATETABLE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Table management";
    НоваяСтрока.ОписаниеМетода   = "Creates a new table in the base
    |
    |    Структура JSON данных массива полей (параметр --fieldsdata):
    |    [
    |        {
    |          <Данные описание поля 1>
    |        },
    |        {
    |          <Данные описание поля 2>
    |        },
    |    ]
    |
    |Функции формирования описаний полей: ПолучитьПолеСтроковое, ПолучитьПолеНомера, ПолучитьПолеВложения, ПолучитьПолеФлажка, ПолучитьПолеДаты, ПолучитьПолеПочты, ПолучитьПолеТелефона, ПолучитьПолеСсылки
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateTable";
    НоваяСтрока.МетодПоиска = "CREATETABLE";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Base identifier";
    НоваяСтрока.Область     = "Table management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateTable";
    НоваяСтрока.МетодПоиска = "CREATETABLE";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New table name";
    НоваяСтрока.Область     = "Table management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateTable";
    НоваяСтрока.МетодПоиска = "CREATETABLE";
    НоваяСтрока.Параметр    = "--fieldsdata";
    НоваяСтрока.Описание    = "Array of field descriptions";
    НоваяСтрока.Область     = "Table management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateTable";
    НоваяСтрока.МетодПоиска = "CREATETABLE";
    НоваяСтрока.Параметр    = "--description";
    НоваяСтрока.Описание    = "Table description (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Table management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyTable";
    НоваяСтрока.МетодПоиска = "MODIFYTABLE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Table management";
    НоваяСтрока.ОписаниеМетода   = "Changes the name and    |   or description of the base";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyTable";
    НоваяСтрока.МетодПоиска = "MODIFYTABLE";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Base identifier";
    НоваяСтрока.Область     = "Table management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyTable";
    НоваяСтрока.МетодПоиска = "MODIFYTABLE";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Table management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyTable";
    НоваяСтрока.МетодПоиска = "MODIFYTABLE";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New name (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Table management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyTable";
    НоваяСтрока.МетодПоиска = "MODIFYTABLE";
    НоваяСтрока.Параметр    = "--description";
    НоваяСтрока.Описание    = "New description (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Table management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateField";
    НоваяСтрока.МетодПоиска = "CREATEFIELD";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Creates a new field in the table";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateField";
    НоваяСтрока.МетодПоиска = "CREATEFIELD";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Base identifier";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateField";
    НоваяСтрока.МетодПоиска = "CREATEFIELD";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateField";
    НоваяСтрока.МетодПоиска = "CREATEFIELD";
    НоваяСтрока.Параметр    = "--Description of the new field";
    НоваяСтрока.Описание    = "fielddata";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyField";
    НоваяСтрока.МетодПоиска = "MODIFYFIELD";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Changes the name and    |   or description of an existing table field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyField";
    НоваяСтрока.МетодПоиска = "MODIFYFIELD";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Base identifier Base";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyField";
    НоваяСтрока.МетодПоиска = "MODIFYFIELD";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyField";
    НоваяСтрока.МетодПоиска = "MODIFYFIELD";
    НоваяСтрока.Параметр    = "--field";
    НоваяСтрока.Описание    = "Field identifier";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyField";
    НоваяСтрока.МетодПоиска = "MODIFYFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New name (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "ModifyField";
    НоваяСтрока.МетодПоиска = "MODIFYFIELD";
    НоваяСтрока.Параметр    = "--description";
    НоваяСтрока.Описание    = "New description (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetStringField";
    НоваяСтрока.МетодПоиска = "GETSTRINGFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New field name";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Gets the description of a string field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetNumberField";
    НоваяСтрока.МетодПоиска = "GETNUMBERFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New field name";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Gets the description of a numeric field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetNumberField";
    НоваяСтрока.МетодПоиска = "GETNUMBERFIELD";
    НоваяСтрока.Параметр    = "--precision";
    НоваяСтрока.Описание    = "Number of decimal places (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Field work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetAttachmentField";
    НоваяСтрока.МетодПоиска = "GETATTACHMENTFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Field name";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Gets the description of a file field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetCheckboxField";
    НоваяСтрока.МетодПоиска = "GETCHECKBOXFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Field name";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Gets the description of a boolean field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetDateField";
    НоваяСтрока.МетодПоиска = "GETDATEFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Field name";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Gets the description of a date field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetEmailField";
    НоваяСтрока.МетодПоиска = "GETEMAILFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Field name";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Gets the description of an email field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetPhoneField";
    НоваяСтрока.МетодПоиска = "GETPHONEFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Field name";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Gets the description of a phone number field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetLinkField";
    НоваяСтрока.МетодПоиска = "GETLINKFIELD";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Field name";
    НоваяСтрока.Область     = "Field work";
    НоваяСтрока.ОписаниеМетода   = "Gets the description of a URL field";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetListOfRecords";
    НоваяСтрока.МетодПоиска = "GETLISTOFRECORDS";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Record management";
    НоваяСтрока.ОписаниеМетода   = "Gets the list of records of the selected table";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetListOfRecords";
    НоваяСтрока.МетодПоиска = "GETLISTOFRECORDS";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Database identifier";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetListOfRecords";
    НоваяСтрока.МетодПоиска = "GETLISTOFRECORDS";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetListOfRecords";
    НоваяСтрока.МетодПоиска = "GETLISTOFRECORDS";
    НоваяСтрока.Параметр    = "--offset";
    НоваяСтрока.Описание    = "Next page identifier of data from the previous request (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetRecord";
    НоваяСтрока.МетодПоиска = "GETRECORD";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Record management";
    НоваяСтрока.ОписаниеМетода   = "Gets row data of the table by identifier";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetRecord";
    НоваяСтрока.МетодПоиска = "GETRECORD";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Database identifier";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetRecord";
    НоваяСтрока.МетодПоиска = "GETRECORD";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetRecord";
    НоваяСтрока.МетодПоиска = "GETRECORD";
    НоваяСтрока.Параметр    = "--record";
    НоваяСтрока.Описание    = "Record identifier in the table";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreatePosts";
    НоваяСтрока.МетодПоиска = "CREATEPOSTS";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Record management";
    НоваяСтрока.ОписаниеМетода   = "Creates one or an array of records by description or an array of field value descriptions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreatePosts";
    НоваяСтрока.МетодПоиска = "CREATEPOSTS";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Database identifier";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreatePosts";
    НоваяСтрока.МетодПоиска = "CREATEPOSTS";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreatePosts";
    НоваяСтрока.МетодПоиска = "CREATEPOSTS";
    НоваяСтрока.Параметр    = "--data";
    НоваяСтрока.Описание    = "Set or array of sets of Key : Value pairs > Field : Indicator";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeletePosts";
    НоваяСтрока.МетодПоиска = "DELETEPOSTS";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Record management";
    НоваяСтрока.ОписаниеМетода   = "Deletes one or an array of records by identifiers";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeletePosts";
    НоваяСтрока.МетодПоиска = "DELETEPOSTS";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Database identifier";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeletePosts";
    НоваяСтрока.МетодПоиска = "DELETEPOSTS";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeletePosts";
    НоваяСтрока.МетодПоиска = "DELETEPOSTS";
    НоваяСтрока.Параметр    = "--records";
    НоваяСтрока.Описание    = "Identifier or array of record identifiers";
    НоваяСтрока.Область     = "Record management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetComments";
    НоваяСтрока.МетодПоиска = "GETCOMMENTS";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Comment management";
    НоваяСтрока.ОписаниеМетода   = "Gets the list of comments for a record in the table";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetComments";
    НоваяСтрока.МетодПоиска = "GETCOMMENTS";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Database identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetComments";
    НоваяСтрока.МетодПоиска = "GETCOMMENTS";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetComments";
    НоваяСтрока.МетодПоиска = "GETCOMMENTS";
    НоваяСтрока.Параметр    = "--record";
    НоваяСтрока.Описание    = "Record identifier in the table";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "GetComments";
    НоваяСтрока.МетодПоиска = "GETCOMMENTS";
    НоваяСтрока.Параметр    = "--offset";
    НоваяСтрока.Описание    = "Next page identifier of data from the previous request (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateComment";
    НоваяСтрока.МетодПоиска = "CREATECOMMENT";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Comment management";
    НоваяСтрока.ОписаниеМетода   = "Creates a comment for a record in the table";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateComment";
    НоваяСтрока.МетодПоиска = "CREATECOMMENT";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Database identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateComment";
    НоваяСтрока.МетодПоиска = "CREATECOMMENT";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateComment";
    НоваяСтрока.МетодПоиска = "CREATECOMMENT";
    НоваяСтрока.Параметр    = "--record";
    НоваяСтрока.Описание    = "Record identifier in the table";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "CreateComment";
    НоваяСтрока.МетодПоиска = "CREATECOMMENT";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Comment text";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "EditComment";
    НоваяСтрока.МетодПоиска = "EDITCOMMENT";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Comment management";
    НоваяСтрока.ОписаниеМетода   = "Changes the text of an existing comment";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "EditComment";
    НоваяСтрока.МетодПоиска = "EDITCOMMENT";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Database identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "EditComment";
    НоваяСтрока.МетодПоиска = "EDITCOMMENT";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "EditComment";
    НоваяСтрока.МетодПоиска = "EDITCOMMENT";
    НоваяСтрока.Параметр    = "--record";
    НоваяСтрока.Описание    = "Record identifier in the table";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "EditComment";
    НоваяСтрока.МетодПоиска = "EDITCOMMENT";
    НоваяСтрока.Параметр    = "--comment";
    НоваяСтрока.Описание    = "Comment identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "EditComment";
    НоваяСтрока.МетодПоиска = "EDITCOMMENT";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "New comment text";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeleteComment";
    НоваяСтрока.МетодПоиска = "DELETECOMMENT";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Token";
    НоваяСтрока.Область     = "Comment management";
    НоваяСтрока.ОписаниеМетода   = "Deletes a comment for a table record";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeleteComment";
    НоваяСтрока.МетодПоиска = "DELETECOMMENT";
    НоваяСтрока.Параметр    = "--base";
    НоваяСтрока.Описание    = "Database identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeleteComment";
    НоваяСтрока.МетодПоиска = "DELETECOMMENT";
    НоваяСтрока.Параметр    = "--table";
    НоваяСтрока.Описание    = "Table identifier";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeleteComment";
    НоваяСтрока.МетодПоиска = "DELETECOMMENT";
    НоваяСтрока.Параметр    = "--record";
    НоваяСтрока.Описание    = "Record identifier in the table";
    НоваяСтрока.Область     = "Comment management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "airtable";
    НоваяСтрока.Модуль      = "OPI_Airtable";
    НоваяСтрока.Метод       = "DeleteComment";
    НоваяСтрока.МетодПоиска = "DELETECOMMENT";
    НоваяСтрока.Параметр    = "--comment";
    НоваяСтрока.Описание    = "Comment identifier";
    НоваяСтрока.Область     = "Comment management";

    Возврат ТаблицаСостава;
КонецФункции

