Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetBotInformation";
    НоваяСтрока.МетодПоиска = "GETBOTINFORMATION";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Management and settings";
    НоваяСтрока.ОписаниеМетода   = "Gets basic information about the bot";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetWorkspaceList";
    НоваяСтрока.МетодПоиска = "GETWORKSPACELIST";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Management and settings";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of workspaces where the bot is connected";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetWorkspaceList";
    НоваяСтрока.МетодПоиска = "GETWORKSPACELIST";
    НоваяСтрока.Параметр    = "--cursor";
    НоваяСтрока.Описание    = "Pointer from the previous request, if the result rows > 100 (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Management and settings";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetUserList";
    НоваяСтрока.МетодПоиска = "GETUSERLIST";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Management and settings";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of users in the workspace";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetUserList";
    НоваяСтрока.МетодПоиска = "GETUSERLIST";
    НоваяСтрока.Параметр    = "--cursor";
    НоваяСтрока.Описание    = "Pointer from the previous request, if the result rows > 100 (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Management and settings";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendMessage";
    НоваяСтрока.МетодПоиска = "SENDMESSAGE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Message management";
    НоваяСтрока.ОписаниеМетода   = "Sends a message at a selected hour";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendMessage";
    НоваяСтрока.МетодПоиска = "SENDMESSAGE";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendMessage";
    НоваяСтрока.МетодПоиска = "SENDMESSAGE";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Message text (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendMessage";
    НоваяСтрока.МетодПоиска = "SENDMESSAGE";
    НоваяСтрока.Параметр    = "--date";
    НоваяСтрока.Описание    = "Sending date for delayed message (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendMessage";
    НоваяСтрока.МетодПоиска = "SENDMESSAGE";
    НоваяСтрока.Параметр    = "--blocks";
    НоваяСтрока.Описание    = "JSON array of block descriptions (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendEphemeralMessage";
    НоваяСтрока.МетодПоиска = "SENDEPHEMERALMESSAGE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Message management";
    НоваяСтрока.ОписаниеМетода   = "Sends a message that arrives in the channel but is visible 
    |    only to a specific user";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendEphemeralMessage";
    НоваяСтрока.МетодПоиска = "SENDEPHEMERALMESSAGE";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendEphemeralMessage";
    НоваяСтрока.МетодПоиска = "SENDEPHEMERALMESSAGE";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Message text (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendEphemeralMessage";
    НоваяСтрока.МетодПоиска = "SENDEPHEMERALMESSAGE";
    НоваяСтрока.Параметр    = "--user";
    НоваяСтрока.Описание    = "User ID (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendEphemeralMessage";
    НоваяСтрока.МетодПоиска = "SENDEPHEMERALMESSAGE";
    НоваяСтрока.Параметр    = "--blocks";
    НоваяСтрока.Описание    = "JSON array of block descriptions (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "EditMessage";
    НоваяСтрока.МетодПоиска = "EDITMESSAGE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Message management";
    НоваяСтрока.ОписаниеМетода   = "Edits the content of an existing message";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "EditMessage";
    НоваяСтрока.МетодПоиска = "EDITMESSAGE";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "EditMessage";
    НоваяСтрока.МетодПоиска = "EDITMESSAGE";
    НоваяСтрока.Параметр    = "--stamp";
    НоваяСтрока.Описание    = "Message timestamp";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "EditMessage";
    НоваяСтрока.МетодПоиска = "EDITMESSAGE";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "New message text (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "EditMessage";
    НоваяСтрока.МетодПоиска = "EDITMESSAGE";
    НоваяСтрока.Параметр    = "--blocks";
    НоваяСтрока.Описание    = "JSON array of block descriptions (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "DeleteMessage";
    НоваяСтрока.МетодПоиска = "DELETEMESSAGE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Message management";
    НоваяСтрока.ОписаниеМетода   = "Deletes a channel message by timestamp";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "DeleteMessage";
    НоваяСтрока.МетодПоиска = "DELETEMESSAGE";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "DeleteMessage";
    НоваяСтрока.МетодПоиска = "DELETEMESSAGE";
    НоваяСтрока.Параметр    = "--stamp";
    НоваяСтрока.Описание    = "Timestamp or message ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "DeleteMessage";
    НоваяСтрока.МетодПоиска = "DELETEMESSAGE";
    НоваяСтрока.Параметр    = "--issheduled";
    НоваяСтрока.Описание    = "Indicator of deleting a delayed message (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetDelayedMessageList";
    НоваяСтрока.МетодПоиска = "GETDELAYEDMESSAGELIST";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Message management";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of delayed channel messages";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetDelayedMessageList";
    НоваяСтрока.МетодПоиска = "GETDELAYEDMESSAGELIST";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetDelayedMessageList";
    НоваяСтрока.МетодПоиска = "GETDELAYEDMESSAGELIST";
    НоваяСтрока.Параметр    = "--cursor";
    НоваяСтрока.Описание    = "Pointer from the previous request, if the result rows > 100 (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetMessageLink";
    НоваяСтрока.МетодПоиска = "GETMESSAGELINK";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Message management";
    НоваяСтрока.ОписаниеМетода   = "Gets a permanent URL to the channel message";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetMessageLink";
    НоваяСтрока.МетодПоиска = "GETMESSAGELINK";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetMessageLink";
    НоваяСтрока.МетодПоиска = "GETMESSAGELINK";
    НоваяСтрока.Параметр    = "--stamp";
    НоваяСтрока.Описание    = "Timestamp or message ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetMessageReplyList";
    НоваяСтрока.МетодПоиска = "GETMESSAGEREPLYLIST";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Message management";
    НоваяСтрока.ОписаниеМетода   = "Gets an array of messages that are replies to the specified";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetMessageReplyList";
    НоваяСтрока.МетодПоиска = "GETMESSAGEREPLYLIST";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetMessageReplyList";
    НоваяСтрока.МетодПоиска = "GETMESSAGEREPLYLIST";
    НоваяСтрока.Параметр    = "--stamp";
    НоваяСтрока.Описание    = "Timestamp or message ID";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetMessageReplyList";
    НоваяСтрока.МетодПоиска = "GETMESSAGEREPLYLIST";
    НоваяСтрока.Параметр    = "--cursor";
    НоваяСтрока.Описание    = "Pointer from the previous request, if the result rows > 100 (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Message management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannelList";
    НоваяСтрока.МетодПоиска = "GETCHANNELLIST";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of available channels";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannelList";
    НоваяСтрока.МетодПоиска = "GETCHANNELLIST";
    НоваяСтрока.Параметр    = "--notarchived";
    НоваяСтрока.Описание    = "Indicator of excluding archived channels (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannelList";
    НоваяСтрока.МетодПоиска = "GETCHANNELLIST";
    НоваяСтрока.Параметр    = "--cursor";
    НоваяСтрока.Описание    = "Pointer from the previous request, if the result rows > 100 (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannelUserList";
    НоваяСтрока.МетодПоиска = "GETCHANNELUSERLIST";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of users in the specified channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannelUserList";
    НоваяСтрока.МетодПоиска = "GETCHANNELUSERLIST";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannelUserList";
    НоваяСтрока.МетодПоиска = "GETCHANNELUSERLIST";
    НоваяСтрока.Параметр    = "--cursor";
    НоваяСтрока.Описание    = "Pointer from the previous request, if the result rows > 100 (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "CreateChannel";
    НоваяСтрока.МетодПоиска = "CREATECHANNEL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Creates a new channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "CreateChannel";
    НоваяСтрока.МетодПоиска = "CREATECHANNEL";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Channel name";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "CreateChannel";
    НоваяСтрока.МетодПоиска = "CREATECHANNEL";
    НоваяСтрока.Параметр    = "--private";
    НоваяСтрока.Описание    = "Create channel as private (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "ArchiveChannel";
    НоваяСтрока.МетодПоиска = "ARCHIVECHANNEL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Archives an active channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "ArchiveChannel";
    НоваяСтрока.МетодПоиска = "ARCHIVECHANNEL";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannel";
    НоваяСтрока.МетодПоиска = "GETCHANNEL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Gets information about the channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannel";
    НоваяСтрока.МетодПоиска = "GETCHANNEL";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannelHistory";
    НоваяСтрока.МетодПоиска = "GETCHANNELHISTORY";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Gets information about channel events";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetChannelHistory";
    НоваяСтрока.МетодПоиска = "GETCHANNELHISTORY";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "InviteUsersToChannel";
    НоваяСтрока.МетодПоиска = "INVITEUSERSTOCHANNEL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Adds specified users to the channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "InviteUsersToChannel";
    НоваяСтрока.МетодПоиска = "INVITEUSERSTOCHANNEL";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "InviteUsersToChannel";
    НоваяСтрока.МетодПоиска = "INVITEUSERSTOCHANNEL";
    НоваяСтрока.Параметр    = "--users";
    НоваяСтрока.Описание    = "User ID Array";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "KickUserFromChannel";
    НоваяСтрока.МетодПоиска = "KICKUSERFROMCHANNEL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Removes specified user from channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "KickUserFromChannel";
    НоваяСтрока.МетодПоиска = "KICKUSERFROMCHANNEL";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "KickUserFromChannel";
    НоваяСтрока.МетодПоиска = "KICKUSERFROMCHANNEL";
    НоваяСтрока.Параметр    = "--user";
    НоваяСтрока.Описание    = "User ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "JoinChannel";
    НоваяСтрока.МетодПоиска = "JOINCHANNEL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Adds the current bot to the channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "JoinChannel";
    НоваяСтрока.МетодПоиска = "JOINCHANNEL";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "LeaveChannel";
    НоваяСтрока.МетодПоиска = "LEAVECHANNEL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Removes the current bot from the channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "LeaveChannel";
    НоваяСтрока.МетодПоиска = "LEAVECHANNEL";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SetChannelTopic";
    НоваяСтрока.МетодПоиска = "SETCHANNELTOPIC";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Sets the channel topic";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SetChannelTopic";
    НоваяСтрока.МетодПоиска = "SETCHANNELTOPIC";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SetChannelTopic";
    НоваяСтрока.МетодПоиска = "SETCHANNELTOPIC";
    НоваяСтрока.Параметр    = "--theme";
    НоваяСтрока.Описание    = "Channel topic";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SetChannelGoal";
    НоваяСтрока.МетодПоиска = "SETCHANNELGOAL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Sets the channel purpose (description)";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SetChannelGoal";
    НоваяСтрока.МетодПоиска = "SETCHANNELGOAL";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SetChannelGoal";
    НоваяСтрока.МетодПоиска = "SETCHANNELGOAL";
    НоваяСтрока.Параметр    = "--purpose";
    НоваяСтрока.Описание    = "Channel purpose";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "RenameChannel";
    НоваяСтрока.МетодПоиска = "RENAMECHANNEL";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Channel management";
    НоваяСтрока.ОписаниеМетода   = "Changes the name of the channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "RenameChannel";
    НоваяСтрока.МетодПоиска = "RENAMECHANNEL";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "RenameChannel";
    НоваяСтрока.МетодПоиска = "RENAMECHANNEL";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New channel name";
    НоваяСтрока.Область     = "Channel management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "OpenDialog";
    НоваяСтрока.МетодПоиска = "OPENDIALOG";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Dialog management";
    НоваяСтрока.ОписаниеМетода   = "Opens a new dialog with one or more users";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "OpenDialog";
    НоваяСтрока.МетодПоиска = "OPENDIALOG";
    НоваяСтрока.Параметр    = "--users";
    НоваяСтрока.Описание    = "User ID Array";
    НоваяСтрока.Область     = "Dialog management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "CloseDialog";
    НоваяСтрока.МетодПоиска = "CLOSEDIALOG";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Dialog management";
    НоваяСтрока.ОписаниеМетода   = "Closes an existing dialog";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "CloseDialog";
    НоваяСтрока.МетодПоиска = "CLOSEDIALOG";
    НоваяСтрока.Параметр    = "--conv";
    НоваяСтрока.Описание    = "Dialog ID";
    НоваяСтрока.Область     = "Dialog management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetFilesList";
    НоваяСтрока.МетодПоиска = "GETFILESLIST";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "File work";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of files of the bot or channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetFilesList";
    НоваяСтрока.МетодПоиска = "GETFILESLIST";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel for selection (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetFilesList";
    НоваяСтрока.МетодПоиска = "GETFILESLIST";
    НоваяСтрока.Параметр    = "--page";
    НоваяСтрока.Описание    = "Page number (необяз. по ум. - 1)";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "UploadFile";
    НоваяСтрока.МетодПоиска = "UPLOADFILE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "File work";
    НоваяСтрока.ОписаниеМетода   = "Uploads a file to Slack servers";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "UploadFile";
    НоваяСтрока.МетодПоиска = "UPLOADFILE";
    НоваяСтрока.Параметр    = "--file";
    НоваяСтрока.Описание    = "File for upload";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "UploadFile";
    НоваяСтрока.МетодПоиска = "UPLOADFILE";
    НоваяСтрока.Параметр    = "--filename";
    НоваяСтрока.Описание    = "File name with extension";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "UploadFile";
    НоваяСтрока.МетодПоиска = "UPLOADFILE";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "File name in Slack";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "UploadFile";
    НоваяСтрока.МетодПоиска = "UPLOADFILE";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel ID (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetFileData";
    НоваяСтрока.МетодПоиска = "GETFILEDATA";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "File work";
    НоваяСтрока.ОписаниеМетода   = "Gets information about the file";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetFileData";
    НоваяСтрока.МетодПоиска = "GETFILEDATA";
    НоваяСтрока.Параметр    = "--fileid";
    НоваяСтрока.Описание    = "File identifier";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "DeleteFile";
    НоваяСтрока.МетодПоиска = "DELETEFILE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "File work";
    НоваяСтрока.ОписаниеМетода   = "Deletes a file on Slack";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "DeleteFile";
    НоваяСтрока.МетодПоиска = "DELETEFILE";
    НоваяСтрока.Параметр    = "--fileid";
    НоваяСтрока.Описание    = "File identifier";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "MakeFilePublic";
    НоваяСтрока.МетодПоиска = "MAKEFILEPUBLIC";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "User token";
    НоваяСтрока.Область     = "File work";
    НоваяСтрока.ОписаниеМетода   = "Creates a public URL for the file. Requires user token";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "MakeFilePublic";
    НоваяСтрока.МетодПоиска = "MAKEFILEPUBLIC";
    НоваяСтрока.Параметр    = "--fileid";
    НоваяСтрока.Описание    = "File identifier";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "MakeFilePrivate";
    НоваяСтрока.МетодПоиска = "MAKEFILEPRIVATE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "User token";
    НоваяСтрока.Область     = "File work";
    НоваяСтрока.ОписаниеМетода   = "Removes the public URL from the file. Requires user token";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "MakeFilePrivate";
    НоваяСтрока.МетодПоиска = "MAKEFILEPRIVATE";
    НоваяСтрока.Параметр    = "--fileid";
    НоваяСтрока.Описание    = "File identifier";
    НоваяСтрока.Область     = "File work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetExternalFileList";
    НоваяСтрока.МетодПоиска = "GETEXTERNALFILELIST";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Deleted files management";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of external files of a user or channel";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetExternalFileList";
    НоваяСтрока.МетодПоиска = "GETEXTERNALFILELIST";
    НоваяСтрока.Параметр    = "--channel";
    НоваяСтрока.Описание    = "Channel for selection (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Deleted files management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetExternalFileList";
    НоваяСтрока.МетодПоиска = "GETEXTERNALFILELIST";
    НоваяСтрока.Параметр    = "--cursor";
    НоваяСтрока.Описание    = "Pointer from the previous request, if the result rows > 100 (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Deleted files management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetExternalFile";
    НоваяСтрока.МетодПоиска = "GETEXTERNALFILE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Deleted files management";
    НоваяСтрока.ОписаниеМетода   = "Gets information about the external file";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GetExternalFile";
    НоваяСтрока.МетодПоиска = "GETEXTERNALFILE";
    НоваяСтрока.Параметр    = "--fileid";
    НоваяСтрока.Описание    = "File identifier";
    НоваяСтрока.Область     = "Deleted files management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "AddExternalFile";
    НоваяСтрока.МетодПоиска = "ADDEXTERNALFILE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Deleted files management";
    НоваяСтрока.ОписаниеМетода   = "Adds a new external file";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "AddExternalFile";
    НоваяСтрока.МетодПоиска = "ADDEXTERNALFILE";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL to external file";
    НоваяСтрока.Область     = "Deleted files management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "AddExternalFile";
    НоваяСтрока.МетодПоиска = "ADDEXTERNALFILE";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "File title for Slack";
    НоваяСтрока.Область     = "Deleted files management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendExternalFile";
    НоваяСтрока.МетодПоиска = "SENDEXTERNALFILE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Deleted files management";
    НоваяСтрока.ОписаниеМетода   = "Sends an external file to a list of channels";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendExternalFile";
    НоваяСтрока.МетодПоиска = "SENDEXTERNALFILE";
    НоваяСтрока.Параметр    = "--fileid";
    НоваяСтрока.Описание    = "File identifier";
    НоваяСтрока.Область     = "Deleted files management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "SendExternalFile";
    НоваяСтрока.МетодПоиска = "SENDEXTERNALFILE";
    НоваяСтрока.Параметр    = "--channels";
    НоваяСтрока.Описание    = "Array of channels for sending";
    НоваяСтрока.Область     = "Deleted files management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "DeleteExternalFile";
    НоваяСтрока.МетодПоиска = "DELETEEXTERNALFILE";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Bot token";
    НоваяСтрока.Область     = "Deleted files management";
    НоваяСтрока.ОписаниеМетода   = "Deletes an external file from Slack";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "DeleteExternalFile";
    НоваяСтрока.МетодПоиска = "DELETEEXTERNALFILE";
    НоваяСтрока.Параметр    = "--fileid";
    НоваяСтрока.Описание    = "File identifier";
    НоваяСтрока.Область     = "Deleted files management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GenerateImageBlock";
    НоваяСтрока.МетодПоиска = "GENERATEIMAGEBLOCK";
    НоваяСтрока.Параметр    = "--picture";
    НоваяСтрока.Описание    = "Image URL";
    НоваяСтрока.Область     = "Block formation";
    НоваяСтрока.ОписаниеМетода   = "Generates a block with an image to add to the message block array";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "slack";
    НоваяСтрока.Модуль      = "OPI_Slack";
    НоваяСтрока.Метод       = "GenerateImageBlock";
    НоваяСтрока.МетодПоиска = "GENERATEIMAGEBLOCK";
    НоваяСтрока.Параметр    = "--alt";
    НоваяСтрока.Описание    = "Alternate text of the image (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Block formation";

    Возврат ТаблицаСостава;
КонецФункции

