Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateTokenRetrievalLink";
    НоваяСтрока.МетодПоиска = "CREATETOKENRETRIEVALLINK";
    НоваяСтрока.Параметр    = "--app";
    НоваяСтрока.Описание    = "app_id from application settings";
    НоваяСтрока.Область     = "Token retrieval";
    НоваяСтрока.ОписаниеМетода   = "Getting a link for interactive token retrieval (access_token), which is necessary
    |    for further actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePost";
    НоваяСтрока.МетодПоиска = "CREATEPOST";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Post text";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Creates a post with images
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePost";
    НоваяСтрока.МетодПоиска = "CREATEPOST";
    НоваяСтрока.Параметр    = "--pictures";
    НоваяСтрока.Описание    = "Array of images";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePost";
    НоваяСтрока.МетодПоиска = "CREATEPOST";
    НоваяСтрока.Параметр    = "--ad";
    НоваяСтрока.Описание    = "Sign ""This is an ad"" (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePost";
    НоваяСтрока.МетодПоиска = "CREATEPOST";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "Link (URL) under the post (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePost";
    НоваяСтрока.МетодПоиска = "CREATEPOST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateCompositePost";
    НоваяСтрока.МетодПоиска = "CREATECOMPOSITEPOST";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Post text";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Creates a post based on an array of object identifiers (images, videos, etc..)
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateCompositePost";
    НоваяСтрока.МетодПоиска = "CREATECOMPOSITEPOST";
    НоваяСтрока.Параметр    = "--objects";
    НоваяСтрока.Описание    = "Array of identifiers like photo123_123";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateCompositePost";
    НоваяСтрока.МетодПоиска = "CREATECOMPOSITEPOST";
    НоваяСтрока.Параметр    = "--ad";
    НоваяСтрока.Описание    = "Sign ""This is an ad"" (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateCompositePost";
    НоваяСтрока.МетодПоиска = "CREATECOMPOSITEPOST";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "Link (URL) under the post (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateCompositePost";
    НоваяСтрока.МетодПоиска = "CREATECOMPOSITEPOST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeletePost";
    НоваяСтрока.МетодПоиска = "DELETEPOST";
    НоваяСтрока.Параметр    = "--post";
    НоваяСтрока.Описание    = "Post ID";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Deletes a post by ID
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeletePost";
    НоваяСтрока.МетодПоиска = "DELETEPOST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePoll";
    НоваяСтрока.МетодПоиска = "CREATEPOLL";
    НоваяСтрока.Параметр    = "--question";
    НоваяСтрока.Описание    = "Poll question";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Creates a poll with answer options
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePoll";
    НоваяСтрока.МетодПоиска = "CREATEPOLL";
    НоваяСтрока.Параметр    = "--options";
    НоваяСтрока.Описание    = "Array of answer options";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePoll";
    НоваяСтрока.МетодПоиска = "CREATEPOLL";
    НоваяСтрока.Параметр    = "--picture";
    НоваяСтрока.Описание    = "Poll image (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreatePoll";
    НоваяСтрока.МетодПоиска = "CREATEPOLL";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAlbum";
    НоваяСтрока.МетодПоиска = "CREATEALBUM";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Album name";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Creates an album to store images
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAlbum";
    НоваяСтрока.МетодПоиска = "CREATEALBUM";
    НоваяСтрока.Параметр    = "--description";
    НоваяСтрока.Описание    = "Album description (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAlbum";
    НоваяСтрока.МетодПоиска = "CREATEALBUM";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteAlbum";
    НоваяСтрока.МетодПоиска = "DELETEALBUM";
    НоваяСтрока.Параметр    = "--album";
    НоваяСтрока.Описание    = "Album ID";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Deletes a previously created album
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteAlbum";
    НоваяСтрока.МетодПоиска = "DELETEALBUM";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateStory";
    НоваяСтрока.МетодПоиска = "CREATESTORY";
    НоваяСтрока.Параметр    = "--picture";
    НоваяСтрока.Описание    = "Story background";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Creates a story from an image
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateStory";
    НоваяСтрока.МетодПоиска = "CREATESTORY";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL for button under the story (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateStory";
    НоваяСтрока.МетодПоиска = "CREATESTORY";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "SaveImageToAlbum";
    НоваяСтрока.МетодПоиска = "SAVEIMAGETOALBUM";
    НоваяСтрока.Параметр    = "--album";
    НоваяСтрока.Описание    = "Album ID";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Saves an image to the community album
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "SaveImageToAlbum";
    НоваяСтрока.МетодПоиска = "SAVEIMAGETOALBUM";
    НоваяСтрока.Параметр    = "--picture";
    НоваяСтрока.Описание    = "Image file";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "SaveImageToAlbum";
    НоваяСтрока.МетодПоиска = "SAVEIMAGETOALBUM";
    НоваяСтрока.Параметр    = "--description";
    НоваяСтрока.Описание    = "Image description (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "SaveImageToAlbum";
    НоваяСтрока.МетодПоиска = "SAVEIMAGETOALBUM";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteImage";
    НоваяСтрока.МетодПоиска = "DELETEIMAGE";
    НоваяСтрока.Параметр    = "--pictureid";
    НоваяСтрока.Описание    = "Image ID";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Deletes an image from the album
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteImage";
    НоваяСтрока.МетодПоиска = "DELETEIMAGE";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "UploadVideoToServer";
    НоваяСтрока.МетодПоиска = "UPLOADVIDEOTOSERVER";
    НоваяСтрока.Параметр    = "--file";
    НоваяСтрока.Описание    = "Video file";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Uploads video to the group for further use
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "UploadVideoToServer";
    НоваяСтрока.МетодПоиска = "UPLOADVIDEOTOSERVER";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Video name";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "UploadVideoToServer";
    НоваяСтрока.МетодПоиска = "UPLOADVIDEOTOSERVER";
    НоваяСтрока.Параметр    = "--description";
    НоваяСтрока.Описание    = "Video description (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "UploadVideoToServer";
    НоваяСтрока.МетодПоиска = "UPLOADVIDEOTOSERVER";
    НоваяСтрока.Параметр    = "--album";
    НоваяСтрока.Описание    = "Album ID, if necessary (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "UploadVideoToServer";
    НоваяСтрока.МетодПоиска = "UPLOADVIDEOTOSERVER";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "UploadPhotoToServer";
    НоваяСтрока.МетодПоиска = "UPLOADPHOTOTOSERVER";
    НоваяСтрока.Параметр    = "--file";
    НоваяСтрока.Описание    = "Image file";
    НоваяСтрока.Область     = "Group work";
    НоваяСтрока.ОписаниеМетода   = "Uploads photo to server for further use
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "UploadPhotoToServer";
    НоваяСтрока.МетодПоиска = "UPLOADPHOTOTOSERVER";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "UploadPhotoToServer";
    НоваяСтрока.МетодПоиска = "UPLOADPHOTOTOSERVER";
    НоваяСтрока.Параметр    = "--type";
    НоваяСтрока.Описание    = "Upload type (Post, Product, Story, Poll, Other) (необяз. по ум. - Post)";
    НоваяСтрока.Область     = "Group work";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateDiscussion";
    НоваяСтрока.МетодПоиска = "CREATEDISCUSSION";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Discussion name";
    НоваяСтрока.Область     = "Discussion management";
    НоваяСтрока.ОписаниеМетода   = "Creates a new discussion
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateDiscussion";
    НоваяСтрока.МетодПоиска = "CREATEDISCUSSION";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Text of the first message";
    НоваяСтрока.Область     = "Discussion management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateDiscussion";
    НоваяСтрока.МетодПоиска = "CREATEDISCUSSION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Discussion management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CloseDiscussion";
    НоваяСтрока.МетодПоиска = "CLOSEDISCUSSION";
    НоваяСтрока.Параметр    = "--topic";
    НоваяСтрока.Описание    = "Discussion ID";
    НоваяСтрока.Область     = "Discussion management";
    НоваяСтрока.ОписаниеМетода   = "Close or delete discussion
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CloseDiscussion";
    НоваяСтрока.МетодПоиска = "CLOSEDISCUSSION";
    НоваяСтрока.Параметр    = "--remove";
    НоваяСтрока.Описание    = "Delete completely (True) or close (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Discussion management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CloseDiscussion";
    НоваяСтрока.МетодПоиска = "CLOSEDISCUSSION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Discussion management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "OpenDiscussion";
    НоваяСтрока.МетодПоиска = "OPENDISCUSSION";
    НоваяСтрока.Параметр    = "--topic";
    НоваяСтрока.Описание    = "Discussion ID";
    НоваяСтрока.Область     = "Discussion management";
    НоваяСтрока.ОписаниеМетода   = "Opens a previously closed discussion
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "OpenDiscussion";
    НоваяСтрока.МетодПоиска = "OPENDISCUSSION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Discussion management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteInDiscussion";
    НоваяСтрока.МетодПоиска = "WRITEINDISCUSSION";
    НоваяСтрока.Параметр    = "--topic";
    НоваяСтрока.Описание    = "Discussion ID";
    НоваяСтрока.Область     = "Discussion management";
    НоваяСтрока.ОписаниеМетода   = "Adds a message to the discussion on behalf of the group
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteInDiscussion";
    НоваяСтрока.МетодПоиска = "WRITEINDISCUSSION";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Message text";
    НоваяСтрока.Область     = "Discussion management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteInDiscussion";
    НоваяСтрока.МетодПоиска = "WRITEINDISCUSSION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Discussion management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "LikePost";
    НоваяСтрока.МетодПоиска = "LIKEPOST";
    НоваяСтрока.Параметр    = "--post";
    НоваяСтрока.Описание    = "Post ID";
    НоваяСтрока.Область     = "Interactive actions";
    НоваяСтрока.ОписаниеМетода   = "Likes a post
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "LikePost";
    НоваяСтрока.МетодПоиска = "LIKEPOST";
    НоваяСтрока.Параметр    = "--wall";
    НоваяСтрока.Описание    = "ID of the wall where the post is located (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "LikePost";
    НоваяСтрока.МетодПоиска = "LIKEPOST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "MakeRepost";
    НоваяСтрока.МетодПоиска = "MAKEREPOST";
    НоваяСтрока.Параметр    = "--post";
    НоваяСтрока.Описание    = "Post ID";
    НоваяСтрока.Область     = "Interactive actions";
    НоваяСтрока.ОписаниеМетода   = "Reposts the record
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "MakeRepost";
    НоваяСтрока.МетодПоиска = "MAKEREPOST";
    НоваяСтрока.Параметр    = "--from";
    НоваяСтрока.Описание    = "ID of the wall where the post is located (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "MakeRepost";
    НоваяСтрока.МетодПоиска = "MAKEREPOST";
    НоваяСтрока.Параметр    = "--to";
    НоваяСтрока.Описание    = "ID of the target wall or group (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "MakeRepost";
    НоваяСтрока.МетодПоиска = "MAKEREPOST";
    НоваяСтрока.Параметр    = "--ad";
    НоваяСтрока.Описание    = "Sign of an advertising post (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "MakeRepost";
    НоваяСтрока.МетодПоиска = "MAKEREPOST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteMessage";
    НоваяСтрока.МетодПоиска = "WRITEMESSAGE";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Message text";
    НоваяСтрока.Область     = "Interactive actions";
    НоваяСтрока.ОписаниеМетода   = "Write a message to a user in the community's dialog
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteMessage";
    НоваяСтрока.МетодПоиска = "WRITEMESSAGE";
    НоваяСтрока.Параметр    = "--user";
    НоваяСтрока.Описание    = "Recipient user ID";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteMessage";
    НоваяСтрока.МетодПоиска = "WRITEMESSAGE";
    НоваяСтрока.Параметр    = "--ct";
    НоваяСтрока.Описание    = "Community chat bot token, which can be obtained in the settings";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteMessage";
    НоваяСтрока.МетодПоиска = "WRITEMESSAGE";
    НоваяСтрока.Параметр    = "--keyboard";
    НоваяСтрока.Описание    = "JSON keyboard. See FormKeyboard (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteMessage";
    НоваяСтрока.МетодПоиска = "WRITEMESSAGE";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteComment";
    НоваяСтрока.МетодПоиска = "WRITECOMMENT";
    НоваяСтрока.Параметр    = "--post";
    НоваяСтрока.Описание    = "ID of the target post";
    НоваяСтрока.Область     = "Interactive actions";
    НоваяСтрока.ОписаниеМетода   = "Creates a comment under the selected record
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteComment";
    НоваяСтрока.МетодПоиска = "WRITECOMMENT";
    НоваяСтрока.Параметр    = "--wall";
    НоваяСтрока.Описание    = "ID of the wall where the post is located";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteComment";
    НоваяСтрока.МетодПоиска = "WRITECOMMENT";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Comment text";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "WriteComment";
    НоваяСтрока.МетодПоиска = "WRITECOMMENT";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "ShortenLink";
    НоваяСтрока.МетодПоиска = "SHORTENLINK";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL for shortening";
    НоваяСтрока.Область     = "Interactive actions";
    НоваяСтрока.ОписаниеМетода   = "Creates a shortened URL from a regular one
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "ShortenLink";
    НоваяСтрока.МетодПоиска = "SHORTENLINK";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Interactive actions";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetStatistics";
    НоваяСтрока.МетодПоиска = "GETSTATISTICS";
    НоваяСтрока.Параметр    = "--datefrom";
    НоваяСтрока.Описание    = "Start date of the period";
    НоваяСтрока.Область     = "Statistics";
    НоваяСтрока.ОписаниеМетода   = "Gets the overall community statistics for a period
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetStatistics";
    НоваяСтрока.МетодПоиска = "GETSTATISTICS";
    НоваяСтрока.Параметр    = "--dateto";
    НоваяСтрока.Описание    = "End date of the period";
    НоваяСтрока.Область     = "Statistics";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetStatistics";
    НоваяСтрока.МетодПоиска = "GETSTATISTICS";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Statistics";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetPostStatistics";
    НоваяСтрока.МетодПоиска = "GETPOSTSTATISTICS";
    НоваяСтрока.Параметр    = "--posts";
    НоваяСтрока.Описание    = "Array of post IDs";
    НоваяСтрока.Область     = "Statistics";
    НоваяСтрока.ОписаниеМетода   = "Gets statistics in terms of posts
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetPostStatistics";
    НоваяСтрока.МетодПоиска = "GETPOSTSTATISTICS";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Statistics";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAdvertisingCampaign";
    НоваяСтрока.МетодПоиска = "CREATEADVERTISINGCAMPAIGN";
    НоваяСтрока.Параметр    = "--cabinet";
    НоваяСтрока.Описание    = "Advertising account ID";
    НоваяСтрока.Область     = "Ad account management";
    НоваяСтрока.ОписаниеМетода   = "Creates a campaign in the selected advertising account
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAdvertisingCampaign";
    НоваяСтрока.МетодПоиска = "CREATEADVERTISINGCAMPAIGN";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Campaign name";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAdvertisingCampaign";
    НоваяСтрока.МетодПоиска = "CREATEADVERTISINGCAMPAIGN";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAd";
    НоваяСтрока.МетодПоиска = "CREATEAD";
    НоваяСтрока.Параметр    = "--campaign";
    НоваяСтрока.Описание    = "Advertising campaign ID";
    НоваяСтрока.Область     = "Ad account management";
    НоваяСтрока.ОписаниеМетода   = "Creates an advertising post based on a post
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAd";
    НоваяСтрока.МетодПоиска = "CREATEAD";
    НоваяСтрока.Параметр    = "--limit";
    НоваяСтрока.Описание    = "Daily limit in rubles";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAd";
    НоваяСтрока.МетодПоиска = "CREATEAD";
    НоваяСтрока.Параметр    = "--category";
    НоваяСтрока.Описание    = "Advertising category number";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAd";
    НоваяСтрока.МетодПоиска = "CREATEAD";
    НоваяСтрока.Параметр    = "--post";
    НоваяСтрока.Описание    = "ID of the post used for advertising";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAd";
    НоваяСтрока.МетодПоиска = "CREATEAD";
    НоваяСтрока.Параметр    = "--cabinet";
    НоваяСтрока.Описание    = "Advertising account ID";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateAd";
    НоваяСтрока.МетодПоиска = "CREATEAD";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "PauseAdvertisingAd";
    НоваяСтрока.МетодПоиска = "PAUSEADVERTISINGAD";
    НоваяСтрока.Параметр    = "--cabinet";
    НоваяСтрока.Описание    = "Advertising account ID";
    НоваяСтрока.Область     = "Ad account management";
    НоваяСтрока.ОписаниеМетода   = "Pauses the display of the advertising post
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "PauseAdvertisingAd";
    НоваяСтрока.МетодПоиска = "PAUSEADVERTISINGAD";
    НоваяСтрока.Параметр    = "--adv";
    НоваяСтрока.Описание    = "Ad ID";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "PauseAdvertisingAd";
    НоваяСтрока.МетодПоиска = "PAUSEADVERTISINGAD";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Ad account management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetAdvertisingCategoryList";
    НоваяСтрока.МетодПоиска = "GETADVERTISINGCATEGORYLIST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Ad account management";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of advertising category IDs for creating an advertising post
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetProductCategoryList";
    НоваяСтрока.МетодПоиска = "GETPRODUCTCATEGORYLIST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";
    НоваяСтрока.ОписаниеМетода   = "Gets a list of product category IDs to specify when creating a product
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetProductList";
    НоваяСтрока.МетодПоиска = "GETPRODUCTLIST";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Selection ID, if filtering is needed (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";
    НоваяСтрока.ОписаниеМетода   = "Gets the community's product list
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetProductList";
    НоваяСтрока.МетодПоиска = "GETPRODUCTLIST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetProductsByID";
    НоваяСтрока.МетодПоиска = "GETPRODUCTSBYID";
    НоваяСтрока.Параметр    = "--items";
    НоваяСтрока.Описание    = "Array of product IDs";
    НоваяСтрока.Область     = "Product management";
    НоваяСтрока.ОписаниеМетода   = "Gets information about products by array of IDs
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetProductsByID";
    НоваяСтрока.МетодПоиска = "GETPRODUCTSBYID";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProduct";
    НоваяСтрока.МетодПоиска = "ADDPRODUCT";
    НоваяСтрока.Параметр    = "--See GetProductDescription";
    НоваяСтрока.Описание    = "product";
    НоваяСтрока.Область     = "Product management";
    НоваяСтрока.ОписаниеМетода   = "Adds a new product to the community's catalog
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProduct";
    НоваяСтрока.МетодПоиска = "ADDPRODUCT";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Selection ID for placing the product, if needed (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProduct";
    НоваяСтрока.МетодПоиска = "ADDPRODUCT";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProduct";
    НоваяСтрока.МетодПоиска = "EDITPRODUCT";
    НоваяСтрока.Параметр    = "--item";
    НоваяСтрока.Описание    = "Identifier of the product being edited";
    НоваяСтрока.Область     = "Product management";
    НоваяСтрока.ОписаниеМетода   = "Edits a previously created product
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProduct";
    НоваяСтрока.МетодПоиска = "EDITPRODUCT";
    НоваяСтрока.Параметр    = "--See GetProductDescription";
    НоваяСтрока.Описание    = "product";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProduct";
    НоваяСтрока.МетодПоиска = "EDITPRODUCT";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Identifier of the new selection, if needed (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProduct";
    НоваяСтрока.МетодПоиска = "EDITPRODUCT";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteProduct";
    НоваяСтрока.МетодПоиска = "DELETEPRODUCT";
    НоваяСтрока.Параметр    = "--item";
    НоваяСтрока.Описание    = "Product ID";
    НоваяСтрока.Область     = "Product management";
    НоваяСтрока.ОписаниеМетода   = "Deletes a previously created product
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteProduct";
    НоваяСтрока.МетодПоиска = "DELETEPRODUCT";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GroupProducts";
    НоваяСтрока.МетодПоиска = "GROUPPRODUCTS";
    НоваяСтрока.Параметр    = "--items";
    НоваяСтрока.Описание    = "Array of product IDs";
    НоваяСтрока.Область     = "Product management";
    НоваяСтрока.ОписаниеМетода   = "Groups products based on similar sets of properties
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GroupProducts";
    НоваяСтрока.МетодПоиска = "GROUPPRODUCTS";
    НоваяСтрока.Параметр    = "--sellgroup";
    НоваяСтрока.Описание    = "ID of the existing group, if needed (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GroupProducts";
    НоваяСтрока.МетодПоиска = "GROUPPRODUCTS";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetSelectionList";
    НоваяСтрока.МетодПоиска = "GETSELECTIONLIST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product selection management";
    НоваяСтрока.ОписаниеМетода   = "Gets the list of product selections
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetSelectionsByID";
    НоваяСтрока.МетодПоиска = "GETSELECTIONSBYID";
    НоваяСтрока.Параметр    = "--sels";
    НоваяСтрока.Описание    = "Selection IDs";
    НоваяСтрока.Область     = "Product selection management";
    НоваяСтрока.ОписаниеМетода   = "Gets the list of selections by array of IDs
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetSelectionsByID";
    НоваяСтрока.МетодПоиска = "GETSELECTIONSBYID";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateProductCollection";
    НоваяСтрока.МетодПоиска = "CREATEPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Selection name";
    НоваяСтрока.Область     = "Product selection management";
    НоваяСтрока.ОписаниеМетода   = "Creates an empty product selection
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateProductCollection";
    НоваяСтрока.МетодПоиска = "CREATEPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--picture";
    НоваяСтрока.Описание    = "Image file";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateProductCollection";
    НоваяСтрока.МетодПоиска = "CREATEPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--main";
    НоваяСтрока.Описание    = "Main (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateProductCollection";
    НоваяСтрока.МетодПоиска = "CREATEPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--hidden";
    НоваяСтрока.Описание    = "Hidden (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateProductCollection";
    НоваяСтрока.МетодПоиска = "CREATEPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductCollection";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New selection name";
    НоваяСтрока.Область     = "Product selection management";
    НоваяСтрока.ОписаниеМетода   = "Edits the properties of a product selection
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductCollection";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Selection ID";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductCollection";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--picture";
    НоваяСтрока.Описание    = "New selection image (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductCollection";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--main";
    НоваяСтрока.Описание    = "Main (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductCollection";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--hidden";
    НоваяСтрока.Описание    = "Hidden (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductCollection";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTCOLLECTION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProductToSelection";
    НоваяСтрока.МетодПоиска = "ADDPRODUCTTOSELECTION";
    НоваяСтрока.Параметр    = "--items";
    НоваяСтрока.Описание    = "Array of products or product";
    НоваяСтрока.Область     = "Product selection management";
    НоваяСтрока.ОписаниеМетода   = "Adds a product to the selection
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProductToSelection";
    НоваяСтрока.МетодПоиска = "ADDPRODUCTTOSELECTION";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Selection ID";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProductToSelection";
    НоваяСтрока.МетодПоиска = "ADDPRODUCTTOSELECTION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "RemoveProductFromSelection";
    НоваяСтрока.МетодПоиска = "REMOVEPRODUCTFROMSELECTION";
    НоваяСтрока.Параметр    = "--item";
    НоваяСтрока.Описание    = "Product ID";
    НоваяСтрока.Область     = "Product selection management";
    НоваяСтрока.ОписаниеМетода   = "Removes a previously added product from the selection
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "RemoveProductFromSelection";
    НоваяСтрока.МетодПоиска = "REMOVEPRODUCTFROMSELECTION";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Selection ID";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "RemoveProductFromSelection";
    НоваяСтрока.МетодПоиска = "REMOVEPRODUCTFROMSELECTION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteSelection";
    НоваяСтрока.МетодПоиска = "DELETESELECTION";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Selection ID";
    НоваяСтрока.Область     = "Product selection management";
    НоваяСтрока.ОписаниеМетода   = "Deletes the selection by ID
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteSelection";
    НоваяСтрока.МетодПоиска = "DELETESELECTION";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product selection management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetPropertyList";
    НоваяСтрока.МетодПоиска = "GETPROPERTYLIST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product properties management";
    НоваяСтрока.ОписаниеМетода   = "Gets the list of properties of group products
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateProductProperty";
    НоваяСтрока.МетодПоиска = "CREATEPRODUCTPROPERTY";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Property name";
    НоваяСтрока.Область     = "Product properties management";
    НоваяСтрока.ОписаниеМетода   = "Creates a new property for use in products
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "CreateProductProperty";
    НоваяСтрока.МетодПоиска = "CREATEPRODUCTPROPERTY";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductProperty";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTPROPERTY";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "New name";
    НоваяСтрока.Область     = "Product properties management";
    НоваяСтрока.ОписаниеМетода   = "Edits the existing product property
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductProperty";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTPROPERTY";
    НоваяСтрока.Параметр    = "--prop";
    НоваяСтрока.Описание    = "Property ID";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductProperty";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTPROPERTY";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteProductProperty";
    НоваяСтрока.МетодПоиска = "DELETEPRODUCTPROPERTY";
    НоваяСтрока.Параметр    = "--prop";
    НоваяСтрока.Описание    = "Property ID";
    НоваяСтрока.Область     = "Product properties management";
    НоваяСтрока.ОписаниеМетода   = "Deletes the existing product property
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteProductProperty";
    НоваяСтрока.МетодПоиска = "DELETEPRODUCTPROPERTY";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "ADDPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--value";
    НоваяСтрока.Описание    = "Property value";
    НоваяСтрока.Область     = "Product properties management";
    НоваяСтрока.ОписаниеМетода   = "Adds a variant for an existing property
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "ADDPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--prop";
    НоваяСтрока.Описание    = "Property ID where the variant is added";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "AddProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "ADDPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--value";
    НоваяСтрока.Описание    = "New property value";
    НоваяСтрока.Область     = "Product properties management";
    НоваяСтрока.ОписаниеМетода   = "Edits the value of an existing product property variant
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--prop";
    НоваяСтрока.Описание    = "Property ID";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--option";
    НоваяСтрока.Описание    = "Variant ID";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "EditProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "EDITPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "DELETEPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--option";
    НоваяСтрока.Описание    = "Variant ID";
    НоваяСтрока.Область     = "Product properties management";
    НоваяСтрока.ОписаниеМетода   = "Deletes the previously created product property variant
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "DeleteProductPropertyVariant";
    НоваяСтрока.МетодПоиска = "DELETEPRODUCTPROPERTYVARIANT";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Product properties management";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "GetOrderList";
    НоваяСтрока.МетодПоиска = "GETORDERLIST";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "Authorization JSON or path to .json (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Order management";
    НоваяСтрока.ОписаниеМетода   = "Returns the community's order list
    |
    |    Структура JSON данных авторизации (параметр --auth):
    |    {
    |     ""access_token"": """",
    |     ""owner_id""    : """",   
    |     ""app_id""      : """",  
    |     ""group_id""    : """"  
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vk";
    НоваяСтрока.Модуль      = "OPI_VK";
    НоваяСтрока.Метод       = "FormKeyboard";
    НоваяСтрока.МетодПоиска = "FORMKEYBOARD";
    НоваяСтрока.Параметр    = "--buttons";
    НоваяСтрока.Описание    = "Array of button titles";
    НоваяСтрока.Область     = "Others";
    НоваяСтрока.ОписаниеМетода   = "Forms a keyboard from an array of buttons";

    Возврат ТаблицаСостава;
КонецФункции

