Процедура ПроверитьВыводСправкиCLI(Знач Корень, Знач Языки) Экспорт

	Для Каждого Язык Из Языки Цикл

		ОбъектCLI = ЗагрузитьСценарий(Корень + Язык + "/cli/data/Classes/LibraryComposition.os");
		Состав    = ?(Язык = "ru", ОбъектCLI.ПолучитьПолныйСостав(), ОбъектCLI.GetFullComposition());

		ШаблонВызоваМетода     = СтрШаблон("oscript %1%2/cli/core/Classes/app.os %%1 %%2", Корень, Язык);
		ШаблонВызоваБиблиотеки = СтрШаблон("oscript %1%2/cli/core/Classes/app.os %%1", Корень, Язык);

		СоответствиеВызововБиблиотек = Новый Соответствие();
		СоответствиеВызововМетодов   = Новый Соответствие();

		Для Каждого СтрокаСостава Из Состав Цикл

			СоответствиеВызововБиблиотек.Вставить(СтрШаблон(ШаблонВызоваБиблиотеки, СтрокаСостава.Библиотека), СтрокаСостава.Библиотека);
			СоответствиеВызововМетодов.Вставить(СтрШаблон(ШаблонВызоваМетода, СтрокаСостава.Библиотека, СтрокаСостава.Метод)
				, СтрШаблон("%1 %2", СтрокаСостава.Библиотека, СтрокаСостава.Метод));
		КонецЦикла;

		Для Каждого СтрокаВызова Из СоответствиеВызововБиблиотек Цикл
			КодВозврата = Неопределено;
			ЗапуститьПриложение(СтрокаВызова.Ключ, , Истина, КодВозврата);

			Если КодВозврата <> 0 Тогда
				ВызватьИсключение СтрШаблон("Ошибка при проверке справки CLI: %1 %2 (%3)", КодВозврата, СтрокаВызова.Значение, Язык);
			КонецЕсли;

		КонецЦикла;

		Для Каждого СтрокаВызова Из СоответствиеВызововМетодов Цикл
			КодВозврата = Неопределено;
			ЗапуститьПриложение(СтрокаВызова.Ключ, , Истина, КодВозврата);

			Если КодВозврата <> 0 Тогда
				ВызватьИсключение СтрШаблон("Ошибка при проверке справки CLI: %1 %2 (%3)", КодВозврата, СтрокаВызова.Значение, Язык);
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

//ПроверитьВыводСправкиCLI("R:\Repos\OpenIntegrations\src\");
