
#Область СлужебныйПрограммныйИнтерфейс

Перем СоответствиеКаталога;

Процедура СформироватьКаталог(Знач МассивФайлов) Экспорт

	СоответствиеКаталога = Новый Соответствие();

	Для Каждого ТекущийФайл Из МассивФайлов Цикл
		ОбработатьМодуль(ТекущийФайл);
	КонецЦикла;

	ТаблицаКаталога =  "|  | Наименование | Ключевые слова |" 
		+ Символы.ПС
		+ "|-|-|-|"
		+ Символы.ПС;


	СтрокаТаблицы      = "|![%1](../%2.png)| `%1`| %3 |";
	СтрокаОблакаТэгов  = " - %1 для 1С:Предприятие и OneScript
						 | - Работа с %1 для 1С
						 | - Интеграция с %1 в 1С";

	МассивТэгов = Новый Массив;

	Для Каждого КлючЗначение Из СоответствиеКаталога Цикл

		ТаблицаКаталога = ТаблицаКаталога 
			+ СтрШаблон(СтрокаТаблицы, КлючЗначение.Ключ, СтрЗаменить(КлючЗначение.Ключ, " ", ""), КлючЗначение.Значение)
			+ Символы.ПС;

		МассивТэгов.Добавить(СтрШаблон(СтрокаОблакаТэгов, КлючЗначение.Ключ));

	КонецЦикла;

	ПолучитьДвоичныеДанныеИзСтроки(ТаблицаКаталога).Записать("./media/catalogs/Catalog.md");

	ДополнитьReadmeОблакомТэгов(МассивТэгов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьМодуль(Знач ФайлМодуля)
	
	ТекущийФайл = ФайлМодуля.ПолноеИмя;
	ТекстФайла  = Новый ТекстовыйДокумент();
	ТекстФайла.Прочитать(ТекущийФайл, "UTF-8");

	ПризнакКлюч     = "// Lib: ";
	ПризнакЗначение = "// Keywords: ";

	ТекущийКлюч = "";
	ТекущееЗначение = "";

	Для Н = 1 По ТекстФайла.КоличествоСтрок() Цикл

		ТекущаяСтрока = СокрЛП(ТекстФайла.ПолучитьСтроку(Н));

		Если Не ЗначениеЗаполнено(ТекущаяСтрока) Тогда
			Прервать;
		КонецЕсли;

		Если СтрНайти(ТекущаяСтрока, ПризнакКлюч) > 0 Тогда

			ТекущийКлюч = СтрЗаменить(ТекущаяСтрока, ПризнакКлюч, "");
			ТекущийКлюч = СокрЛП(ТекущийКлюч);

		КонецЕсли;

		Если СтрНайти(ТекущаяСтрока, ПризнакЗначение) > 0 Тогда

			ТекущееЗначение = СтрЗаменить(ТекущаяСтрока, ПризнакЗначение, "");
			ТекущееЗначение = СокрЛП(ТекущееЗначение);

		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(ТекущийКлюч) И ЗначениеЗаполнено(ТекущееЗначение) Тогда
		СоответствиеКаталога.Вставить(ТекущийКлюч, ТекущееЗначение);
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьReadmeОблакомТэгов(МассивТэгов)

	ТекстТэгов  = СтрСоединить(МассивТэгов, Символы.ПС);
	ОблакоТэгов = ПолучитьСТрокуИзДвоичныхДанных(Новый ДвоичныеДанные("./service/templates/tags.md"));

	ОблакоТэгов = СтрШаблон(ОблакоТэгов, ТекстТэгов);

	ДокументReadme = Новый ТекстовыйДокумент();
	ДокументReadme.Прочитать("./README.md");

	Признак    = "NOTICE";
	Найдено    = Ложь;
	Счетчик    = 0;
	ВсегоСтрок = ДокументReadme.КоличествоСтрок();

	Пока Не Найдено Цикл

		Индекс        = ВсегоСтрок - Счетчик;
		ТекущаяСтрока = ДокументReadme.ПолучитьСтроку(Индекс); 

		Если СтрНайти(ТекущаяСтрока, Признак) <> 0 Тогда
			Найдено = Истина;
		Иначе
			ДокументReadme.УдалитьСтроку(Индекс);
		КонецЕсли;

		Счетчик = Счетчик + 1;

	КонецЦикла;

	ДокументReadme.ДобавитьСтроку(ОблакоТэгов);
	ДокументReadme.Записать("./README.md");

КонецПроцедуры

#КонецОбласти

