
#Область СлужебныйПрограммныйИнтерфейс

Перем СоответствиеКаталога;

Процедура СформироватьКаталог(Знач МассивФайлов) Экспорт

	СоответствиеКаталога = Новый Соответствие();

	Для Каждого ТекущийФайл Из МассивФайлов Цикл
		ОбработатьМодуль(ТекущийФайл);
	КонецЦикла;

	ТаблицаКаталога =  "|  | Наименование | Ключевые слова |" 
		+ Символы.ПС
		+ "|-|-|-|"
		+ Символы.ПС;

	СтрокаТаблицы = "|![%1](./media/%2.png)| `%1`| %3 |";

	Для Каждого КлючЗначение Из СоответствиеКаталога Цикл

		ТаблицаКаталога = ТаблицаКаталога 
			+ СтрШаблон(СтрокаТаблицы, КлючЗначение.Ключ, СтрЗаменить(КлючЗначение.Ключ, " ", ""), КлючЗначение.Значение)
			+ Символы.ПС;

	КонецЦикла;

	ПолучитьДвоичныеДанныеИзСтроки(ТаблицаКаталога).Записать("./media/catalogs/Catalog.md");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьМодуль(Знач ФайлМодуля)
	
	ТекущийФайл = ФайлМодуля.ПолноеИмя;
	ТекстФайла  = Новый ТекстовыйДокумент();
	ТекстФайла.Прочитать(ТекущийФайл, "UTF-8");

	ПризнакКлюч     = "// Lib: ";
	ПризнакЗначение = "// Keywords: ";

	ТекущийКлюч = "";
	ТекущееЗначение = "";

	Для Н = 1 По ТекстФайла.КоличествоСтрок() Цикл

		ТекущаяСтрока = СокрЛП(ТекстФайла.ПолучитьСтроку(Н));

		Если Не ЗначениеЗаполнено(ТекущаяСтрока) Тогда
			Прервать;
		КонецЕсли;

		Если СтрНайти(ТекущаяСтрока, ПризнакКлюч) > 0 Тогда

			ТекущийКлюч = СтрЗаменить(ТекущаяСтрока, ПризнакКлюч, "");
			ТекущийКлюч = СокрЛП(ТекущийКлюч);

		КонецЕсли;

		Если СтрНайти(ТекущаяСтрока, ПризнакЗначение) > 0 Тогда

			ТекущееЗначение = СтрЗаменить(ТекущаяСтрока, ПризнакЗначение, "");
			ТекущееЗначение = СокрЛП(ТекущееЗначение);

		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(ТекущийКлюч) Тогда
		СоответствиеКаталога.Вставить(ТекущийКлюч, ТекущееЗначение);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

