// MIT License

// Copyright (c) 2023 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:LineLength-off

//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content
//@skip-check method-too-many-params

// Раскомментировать, если выполняется OneScript
//#Использовать "../../tools"

#Область ОписаниеПеременных

Перем Обработчик;
Перем Инициализирована;

Перем Данные Экспорт;
Перем Успех  Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область МетодыСервера

// Создать сервер
// Создает новый TCP сервер и устаналивает порт
//
// Параметры:
//  Порт      - Число  - Номер свободного порта для сервера 
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция СоздатьСервер(Знач Порт) Экспорт
    Возврат ОбработкаИнициализирована()
		.ПодключитьОбработчик("OPI_TCPServer", "Server")
		.СерверИнициализирован()
		.УстановитьПорт(Порт);
КонецФункции

// Запустить сервер
// Запускает ранее созданный сервер
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция ЗапуститьСервер() Экспорт
	Возврат ОбработкаИнициализирована().СерверИнициализирован().Компонента_Start();
КонецФункции

// Отключить сервер
// Останавливает запущенный сервер
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция ОтключитьСервер() Экспорт
	Возврат ОбработкаИнициализирована().СерверИнициализирован().Компонента_Stop();
КонецФункции

// Ожидать входящие соединения
// Блокирует выполнение программы до появления нового подключения
//
// Параметры:
//  Таймаут   - Число - Максимальное время ожидания подключений. 0 > бесконечно
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция ОжидатьВходящиеСоединения(Знач Таймаут = 0) Экспорт
	Возврат ОбработкаИнициализирована().СерверИнициализирован().Компонента_Wait(Таймаут);
КонецФункции

// Получить входящие соединения
// Получает список соединений в пуле
//
// Примечание:
// Наличие соединения в пуле не гарантирует его активности.^^
// Для очистки пула от неактивных соединений используется функция АктуализироватьВходящиеСоединения
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция ПолучитьВходящиеСоединения() Экспорт
	Возврат ОбработкаИнициализирована().СерверИнициализирован().Компонента_ListConnections();
КонецФункции

// Актуализировать входящие соединения
// Удаляет неактивные соединения из пула
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция АктуализироватьВходящиеСоединения() Экспорт
	Возврат ОбработкаИнициализирована().СерверИнициализирован().Компонента_UpdateConnections();
КонецФункции

#КонецОбласти

#Область МетодыОбработкиСоединений

// Получить запрос
// Получает данные из потока существующего соединения
//
// Параметры:
//  IDПодключения      - Строка, Число - ID активного подключения. См. ОжидатьПодключение 
//  МаксимальныйРазмер - Число         - Максимальный размер данных. 0 > до конца потока 
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция ПолучитьЗапрос(Знач IDПодключения, Знач МаксимальныйРазмер = 0) Экспорт
	Возврат ОбработкаИнициализирована()
		.СерверИлиОбработчикИнициализирован()
		.Компонента_Receive(IDПодключения, МаксимальныйРазмер);
КонецФункции

// Отправить ответ
// Отправляет данные клиенту по идентификатору подключения
//
// Параметры:
//  IDПодключения - Строка, Число  - ID активного подключения. См. ОжидатьПодключение
//  Данные        - ДвоичныеДанные - Данные для отправки
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция ОтправитьОтвет(Знач IDПодключения, Знач Данные) Экспорт
	Возврат ОбработкаИнициализирована()
		.СерверИлиОбработчикИнициализирован()
		.Компонента_Send(IDПодключения, Данные);
КонецФункции

// Закрыть входящее соединение
// Закрывает существующее соединение по идентификатору
//
// Параметры:
//  IDПодключения - Строка, Число  - ID активного подключения. См. ОжидатьПодключение
//
// Возвращаемое значение:
//  ВнешняяОбработкаОбъект - объект обработки Mustela
Функция ЗакрытьВходящееСоединение(Знач IDПодключения, Знач TCPОбработчик = "") Экспорт
	Возврат ОбработкаИнициализирована()
		.СерверИлиОбработчикИнициализирован()
		.Компонента_Close(IDПодключения);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Вспомогательные 

Функция ПодключитьОбработчик(Знач ИмяКомпоненты, Знач ИмяКласса)

	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	
    Если ЭтоOneScript() Тогда
        ИмяМакета = КаталогКомпонентOS() + ИмяКомпоненты + ".zip";
    Иначе
        ИмяМакета = "ВнешняяОбработка.Mustela.Макет" + ИмяКомпоненты;
    КонецЕсли;

    ПодключитьВнешнююКомпоненту(ИмяМакета, ИмяКомпоненты, ТипВнешнейКомпоненты.Native);

	Попытка
    	Обработчик = Новый("AddIn." + ИмяКомпоненты + "." + ИмяКласса);
	Исключение
		Ошибка(ОписаниеОшибки());
	КонецПопытки;
	
    Возврат ЭтотОбъект;

КонецФункции

Функция УстановитьПорт(Знач Порт)
	
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	
	Попытка
		ПолучитьЧисло(Порт);
		Обработчик.Port = Порт;
	Исключение
		Ошибка(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ОбработатьРезультат(Знач Результат)

	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	
	Попытка
		
		ТипРезультата = ТипЗнч(Результат);
		
		Если ТипРезультата = Тип("ДвоичныеДанные") Тогда
			Результат = Новый Структура("result,data", Истина, Результат);	
		ИначеЕсли Не Тип("Структура") Тогда
        	Результат = JsonВСтруктуру(Результат, Ложь);
		КонецЕсли;
				
    Исключение
        Результат = Новый Структура("result,error", Ложь, Результат);
	КонецПопытки;
	
	Если Не Результат.Свойство("error") Тогда
		Результат.Вставить("error", "");
	КонецЕсли;

	Успех  = ?(Результат.Свойство("result"), Результат["result"], Ложь);
	Данные = ?(Результат.Свойство("data"), Результат["data"], Результат["error"]);
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция ОбработкаИнициализирована()
	
	Возврат ?(ЗначениеЗаполнено(Инициализирована)
		, ЭтотОбъект
		, Ошибка("Processor not initialised"));
		
КонецФункции

Функция СерверИнициализирован()
	
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	
	Возврат ?(Строка(ТипЗнч(Обработчик)) = "AddIn.OPI_TCPServer.Server"
		, ЭтотОбъект
		, Ошибка("Server not initialised"));

КонецФункции
	
Функция ОбработчикИнициализирован()
	
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	
	Возврат ?(Строка(ТипЗнч(Обработчик)) = "AddIn.OPI_TCPServer.Handler"
		, ЭтотОбъект
		, Ошибка("Handler not initialised"));

КонецФункции
	
Функция СерверИлиОбработчикИнициализирован()
	
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	
	Возврат ?(СерверИнициализирован().Успех Или ОбработчикИнициализирован().Успех
		, Успех()
		, Ошибка("Server or handler not initialised"));
		
КонецФункции

Функция Успех(Знач Содержимое = "")
	
	Успех  = Истина;	
	Данные = Содержимое;
	
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Ошибка(Знач ТекстОшибки)
	
	ПолучитьСтроку(ТекстОшибки);
	
	Успех  = Ложь;
	Данные = ТекстОшибки;
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область Обертки

Функция Компонента_Start()	
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	Возврат ОбработатьРезультат(Обработчик.Start());
КонецФункции

Функция Компонента_Stop()
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	Возврат ОбработатьРезультат(Обработчик.Stop());
КонецФункции

Функция Компонента_Wait(Знач Таймаут)
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	ПолучитьЧисло(Таймаут);
	Возврат ОбработатьРезультат(Обработчик.Wait(Таймаут));
КонецФункции

Функция Компонента_ListConnections()
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	Возврат ОбработатьРезультат(Обработчик.ListConnections());
КонецФункции

Функция Компонента_UpdateConnections()
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	Возврат ОбработатьРезультат(Обработчик.UpdateConnections());
КонецФункции

Функция Компонента_Receive(Знач IDПодключения, Знач МаксимальныйРазмер)
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	ПолучитьСтроку(IDПодключения);
    ПолучитьЧисло(МаксимальныйРазмер);
	Возврат ОбработатьРезультат(Обработчик.Receive(IDПодключения, МаксимальныйРазмер));
КонецФункции

Функция Компонента_Send(Знач IDПодключения, Знач Данные)
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	ПолучитьСтроку(IDПодключения);
    ПолучитьДвоичныеДанные(Данные);
	Возврат ОбработатьРезультат(Обработчик.Send(IDПодключения, Данные));
КонецФункции

Функция Компонента_Close(Знач IDПодключения)
	Если Не Успех Тогда Возврат ЭтотОбъект КонецЕсли;
	ПолучитьСтроку(IDПодключения);
	Возврат ОбработатьРезультат(Обработчик.Close(IDПодключения));
КонецФункции

#КонецОбласти

#Область Инструменты

Процедура ПолучитьЧисло(Значение) Экспорт

    ОписаниеТипа = Новый ОписаниеТипов("Число");
    Значение     = ОписаниеТипа.ПривестиЗначение(Значение);

КонецПроцедуры

Процедура ПолучитьБулево(Значение) Экспорт

    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Попытка

        Если ТипЗнч(Значение) = Тип("Булево") Тогда

            Возврат;

        Иначе

            Значение = Булево(Значение);

        КонецЕсли;

    Исключение
        ВызватьИсключение "Ошибка получения данных булево из параметра";
    КонецПопытки;

КонецПроцедуры

Процедура ПолучитьСтроку(Значение, Знач ИзИсточника = Ложь) Экспорт

    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Попытка

        Если ЭтоСимвольное(Значение) Тогда

            Значение = ЧислоВСтроку(Значение);
            Возврат;

        ИначеЕсли ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда

            Значение = ПолучитьСтрокуИзДвоичныхДанных(Значение);

        ИначеЕсли ЭтоКоллекция(Значение) Тогда

            Значение = JSONСтрокой(Значение);

        ИначеЕсли ТипЗнч(Значение) = Тип("ЗаписьXML") Тогда

            Значение = Значение.Закрыть();

        Иначе
            Возврат;
        КонецЕсли;

    Исключение
        Значение = Строка(Значение);
        Возврат;
    КонецПопытки;

КонецПроцедуры

Процедура ПолучитьДвоичныеДанные(Значение, Знач Безусловно = Ложь, Знач ПопыткаB64 = Истина) Экспорт

    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Попытка

        Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
            Возврат;
        Иначе
            ПреобразоватьИсточникВЗначение(Значение, ПопыткаB64);
        КонецЕсли;

    Исключение

        Если Безусловно Тогда
            Значение = ЧислоВСтроку(Значение);
            Значение = ПолучитьДвоичныеДанныеИзСтроки(Значение);
        Иначе
            ВызватьИсключение "Ошибка получения двоичных данных из параметра: " + ОписаниеОшибки();
        КонецЕсли;

    КонецПопытки;

КонецПроцедуры

Процедура ПреобразоватьИсточникВЗначение(Значение, ПопыткаB64)

    Файл = Новый Файл(Значение);

    Если Файл.Существует() Тогда

        Значение = Новый ДвоичныеДанные(Значение);

    Иначе

        Если ПопыткаB64 Тогда
            Значение = Base64Значение(Значение);
        Иначе
            ВызватьИсключение "значение не является путем к файлу или Base64 строкой";
        КонецЕсли;

    КонецЕсли;

КонецПроцедуры

Функция ЧислоВСтроку(Знач Число) Экспорт
    Возврат СтрЗаменить(Строка(Число), Символы.НПП, "");
КонецФункции

Функция ЭтоСимвольное(Знач Значение)

    Возврат ТипЗнч(Значение) = Тип("Строка")
        Или ТипЗнч(Значение) = Тип("Число")
        Или ТипЗнч(Значение) = Тип("Дата");

КонецФункции

Функция ЭтоКоллекция(Знач Значение)

    Возврат ТипЗнч(Значение) = Тип("Массив")
        Или ТипЗнч(Значение) = Тип("Структура")
        Или ТипЗнч(Значение) = Тип("Соответствие");

КонецФункции

Функция ПолеКоллекцииСуществует(Знач Коллекция, Знач Поле, ЗначениеПоля = Неопределено) Экспорт

    ТипКоллекции = ТипЗнч(Коллекция);

    ЭтоСтруктура    = ТипКоллекции = Тип("Структура");
    ЭтоСоответствие = ТипКоллекции = Тип("Соответствие");
    ЭтоКоллекция    = ЭтоСтруктура Или ЭтоСоответствие;

    Если СтрНайти(Поле, ".") И ЭтоКоллекция Тогда

        ЧастиПоля   = СтрРазделить(Поле, ".");
        ТекущееПоле = ЧастиПоля[0];

        Если Не ПолеКоллекцииСуществует(Коллекция, ТекущееПоле, ЗначениеПоля) Тогда

            Возврат Ложь;

        Иначе

            ЧастиПоля.Удалить(0);
            СледующаяКоллекция = Коллекция[ТекущееПоле];
            СледующееПоле      = СтрСоединить(ЧастиПоля, ".");

            Возврат ПолеКоллекцииСуществует(СледующаяКоллекция, СледующееПоле, ЗначениеПоля);

        КонецЕсли;

    ИначеЕсли ЭтоСтруктура Тогда

        Возврат Коллекция.Свойство(Поле, ЗначениеПоля);

    ИначеЕсли ЭтоСоответствие Тогда

        ЗначениеПоля = Коллекция[Поле];
        Возврат ЗначениеПоля <> Неопределено;

    Иначе

        Возврат Ложь;

    КонецЕсли;

КонецФункции

Функция JSONСтрокой(Знач Данные
    , Знач Экранирование  = "Нет"
    , Знач ПереносСтрок   = Истина
    , Знач ДвойныеКавычки = Истина) Экспорт

    Перенос = ?(ПереносСтрок, ПереносСтрокJSON.Windows, ПереносСтрокJSON.Нет);

    ПараметрыJSON = Новый ПараметрыЗаписиJSON(Перенос
        , " "
        , ДвойныеКавычки
        , ЭкранированиеСимволовJSON[Экранирование]
        , Ложь
        , Ложь
        , Ложь
        , Ложь);

    Попытка

        ЗаписьJSON = Новый ЗаписьJSON;
        ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);

        ЗаписатьJSON(ЗаписьJSON, Данные);
        Возврат ЗаписьJSON.Закрыть();

    Исключение
        Возврат "НЕ JSON: " + Строка(Данные);
    КонецПопытки;

КонецФункции

Функция JSONВСтруктуру(Знач Текст, Знач ВСоответствие = Истина) Экспорт

    Если Не ЗначениеЗаполнено(Текст) Тогда
        Возврат "";
    КонецЕсли;

    Текст = ?(ТипЗнч(Текст) = Тип("ДвоичныеДанные"), ПолучитьСтрокуИзДвоичныхДанных(Текст), Текст);

    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Текст);

    Данные = ПрочитатьJSON(ЧтениеJSON, ВСоответствие, Неопределено, ФорматДатыJSON.ISO);
    ЧтениеJSON.Закрыть();

    Возврат Данные;

КонецФункции

Функция ЭтоOneScript() Экспорт

    Попытка

        Ответ = Ложь;

        // BSLLS:UnusedLocalVariable-off

        //@skip-check module-unused-local-variable
        Проверка = Новый ЗащищенноеСоединениеOpenSSL;

        // BSLLS:UnusedLocalVariable-on

    Исключение

        Ответ = Истина;

    КонецПопытки;

    Возврат Ответ;

КонецФункции

Функция КаталогКомпонентOS() Экспорт

    КаталогПрограммы = СтрЗаменить(КаталогПрограммы(), "\", "/");

    ЭлементыПути = СтрРазделить(КаталогПрограммы, "/");
    ЭлементыПути.Удалить(ЭлементыПути.ВГраница());

    // BSLLS:UsingHardcodePath-off

    КаталогКомпонент = СтрСоединить(ЭлементыПути, "/") + "/lib/oint/addins/";

    // BSLLS:UsingHardcodePath-on

    Возврат КаталогКомпонент;

КонецФункции

#КонецОбласти

#КонецОбласти