// OneScript: ./OInt/api/nativeapi/Modules/OPI_NativeAPI.os
// Lib: NativeAPI
// CLI: nativeapi
// Keywords: native api, addin, component, ffi

// DocsCategory: Other
// DocsNameRU: Native API
// DocsNameEN: Native API

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:UsingServiceTag-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:CommonModuleNameClientServer-off
// BSLLS:MagicNumber-off
// BSLLS:LineLength-off

//@skip-check method-too-many-params
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check wrong-string-literal-content
//@skip-check constructor-function-return-section

// #Использовать "../../../tools/main"

#Если Не ВебКлиент Тогда // !OPI

#Область ПрограммныйИнтерфейс

#Область Основные

// Получить настройки логирования !NOCLI
// Возвращает шаблон настроек логирования компоненты
//
// Параметры:
//  ЗаписьВПамять   - Булево - Записывать лог в память компоненты                 - memory
//  МаксимумСобытий - Число  - Максимальное количество событий в памяти           - max
//  ПутьКФайлу      - Строка - Путь к файлу лога. При заполнении пишет лог в файл - path
//
// Возвращаемое значение:
//  Структура Из КлючИЗначение - Настройки логирования
Функция ПолучитьНастройкиЛогирования(Знач ЗаписьВПамять = Истина
    , Знач МаксимумСобытий = 300
    , Знач ПутьКФайлу = "") Экспорт

    Возврат OPI_Компоненты.ПолучитьНастройкиЛогирования(ЗаписьВПамять, МаксимумСобытий, ПутьКФайлу);

КонецФункции

// Создать хост !NOCLI
// Создаёт объект прослойки Native API и загружает указанную DLL/SO
//
// Параметры:
//  Путь        - Строка                     - Полный путь к файлу анализируемой библиотеки            - path
//  Логирование - Структура Из КлючИЗначение - Настройки логирования. См. ПолучитьНастройкиЛогирования - log
//
// Возвращаемое значение:
//  Произвольный - Объект хоста или структура с информацией об ошибке
Функция СоздатьХост(Знач Путь, Знач Логирование = Неопределено) Экспорт

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Путь);

    Компонента = OPI_Компоненты.ПолучитьКомпоненту("NativeAPI");

    Если Логирование <> Неопределено Тогда

        ТекстОшибки    = "Некорректные настройки логирования";
        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Логирование, ТекстОшибки);
        СтрокаНастроек = OPI_Компоненты.СериализоватьJanx(Логирование);

        Если ЗначениеЗаполнено(СтрокаНастроек) Тогда

            РезультатЛога = Компонента.SetLogger(СтрокаНастроек);
            РезультатЛога = OPI_Компоненты.ДесериализоватьJanx(РезультатЛога);

            Если Не РезультатЛога["result"] Тогда
                Возврат РезультатЛога;
            КонецЕсли;

        КонецЕсли;

    КонецЕсли;

    Результат = Компонента.OpenLibrary(Путь);
    Результат = OPI_Компоненты.ДесериализоватьJanx(Результат);

    Возврат ?(Результат["result"], Компонента, Результат);

КонецФункции

// Это хост !NOCLI
// Проверяет, что значение является объектом компоненты-прослойки Native API
//
// Параметры:
//  Значение - Произвольный - Значение для проверки - value
//
// Возвращаемое значение:
//  Булево - Это хост
Функция ЭтоХост(Знач Значение) Экспорт

    Возврат Строка(ТипЗнч(Значение)) = "AddIn.OPI_NativeAPI.Main";

КонецФункции

// Получить лог !NOCLI
// Возвращает лог компоненты Native API
//
// Параметры:
//  Хост         - Строка, Произвольный - Объект хоста или путь к компоненте. См. СоздатьХост - host
//  КакСтрока    - Булево               - Возвращать лог одной строкой с переводами строк     - asString
//  ЧислоСобытий - Число                - Количество последних событий                        - count
//
// Возвращаемое значение:
//  Произвольный - Лог или строка лога
Функция ПолучитьЛог(Знач Хост, Знач КакСтрока = Ложь, Знач ЧислоСобытий = 100) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    Возврат OPI_Компоненты.ПолучитьЛог(Хост
        , КакСтрока
        , ЧислоСобытий);

КонецФункции

#КонецОбласти

#Область РаботаСБиблиотекой

// Получить имена классов
// Возвращает список классов, объявленных в компоненте
//
// Параметры:
//  Хост - Строка, Произвольный - Объект хоста или путь к компоненте. См. СоздатьХост - host
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат со списком классов
Функция ПолучитьИменаКлассов(Знач Хост) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    Результат = Хост.GetClassNames();

    Возврат OPI_Компоненты.ДесериализоватьJanx(Результат);

КонецФункции

#КонецОбласти

#Область РаботаСЭкземпляром

// Создать экземпляр !NOCLI
// Создаёт объект анализируемой компоненты указанного класса и сохраняет его в хосте
//
// Параметры:
//  Хост  - Строка, Произвольный - Объект хоста или путь к компоненте. См. СоздатьХост - host
//  Класс - Строка               - Имя класса для создания экземпляра                  - class
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - UUID экземпляра или структура с ошибкой
Функция СоздатьЭкземпляр(Знач Хост, Знач Класс) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Класс);

    Результат = Хост.CreateInstance(Класс);

    Возврат OPI_Компоненты.ДесериализоватьJanx(Результат);

КонецФункции

// Уничтожить экземпляр !NOCLI
// Уничтожает ранее созданный экземпляр анализируемой компоненты
//
// Параметры:
//  Хост      - Строка, Произвольный - Объект хоста или путь к компоненте. См. СоздатьХост - host
//  Экземпляр - Строка               - UUID экземпляра. См. СоздатьЭкземпляр               - class
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат операции
Функция УничтожитьЭкземпляр(Знач Хост, Знач Экземпляр) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Экземпляр);

    Результат = Хост.DestroyInstance(Экземпляр);

    Возврат OPI_Компоненты.ДесериализоватьJanx(Результат);

КонецФункции

// Получить метаданные
// Возвращает описание методов и свойств экземпляра компоненты
//
// Параметры:
//  Хост      - Строка, Произвольный - Объект хоста или путь к компоненте. См. СоздатьХост - host
//  Экземпляр - Строка               - UUID экземпляра или имя класса                      - class
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Метаданные компоненты
Функция ПолучитьМетаданные(Знач Хост, Знач Экземпляр) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Экземпляр);

    Результат = Хост.GetMetadata(Экземпляр);

    Возврат OPI_Компоненты.ДесериализоватьJanx(Результат);

КонецФункции

// Вызвать метод
// Вызывает метод экземпляра компоненты по имени или номеру
//
// Параметры:
//  Хост      - Строка, Произвольный          - Объект хоста или путь к компоненте. См. СоздатьХост      - host
//  Экземпляр - Строка                        - UUID экземпляра или имя класса для временного экземпляра - class
//  Метод     - Строка                        - Имя метода                                               - method
//  Параметры - Массив Из Произвольный        - Параметры вызываемой функции                             - params
//  Свойства  - Соответствие Из КлючИЗначение - Значения для установки свойств экземпляра перед вызовом  - props
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат вызова, значение метода и все свойства экземпляра
Функция ВызватьМетод(Знач Хост, Знач Экземпляр, Знач Метод, Знач Параметры = Неопределено, Знач Свойства = Неопределено) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Экземпляр);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(Метод);

    Если Параметры = Неопределено Тогда
        Параметры = Новый Массив;
    Иначе
        OPI_ПреобразованиеТипов.ПолучитьМассив(Параметры);
    КонецЕсли;

    СвойстваJanx = "";

    Если Свойства <> Неопределено Тогда

        OPI_ПреобразованиеТипов.ПолучитьКоллекциюКлючИЗначение(Свойства);
        СвойстваJanx = OPI_Компоненты.СериализоватьJanx(Свойства);

    КонецЕсли;

    ПараметрыJanx = OPI_Компоненты.СериализоватьJanx(Параметры);

    Результат = Хост.CallMethod(Экземпляр, Метод, ПараметрыJanx, СвойстваJanx);
    Результат = OPI_Компоненты.ДесериализоватьJanx(Результат);

    Возврат Результат;

КонецФункции

// Получить свойства
// Возвращает значения всех читаемых свойств экземпляра компоненты
//
// Параметры:
//  Хост      - Строка, Произвольный - Объект хоста или путь к компоненте. См. СоздатьХост      - host
//  Экземпляр - Строка               - UUID экземпляра или имя класса для временного экземпляра - class
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Соответствие имён свойств и их значений
Функция ПолучитьСвойства(Знач Хост, Знач Экземпляр) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Экземпляр);

    Результат = Хост.GetProperties(Экземпляр);

    Возврат OPI_Компоненты.ДесериализоватьJanx(Результат);

КонецФункции

// Получить свойство
// Читает значение свойства экземпляра компоненты
//
// Параметры:
//  Хост      - Строка, Произвольный - Объект хоста или путь к компоненте. См. СоздатьХост      - host
//  Экземпляр - Строка               - UUID экземпляра или имя класса для временного экземпляра - class
//  Свойство  - Строка, Число        - Имя свойства                                             - prop
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Значение свойства
Функция ПолучитьСвойство(Знач Хост, Знач Экземпляр, Знач Свойство) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Экземпляр);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(Свойство);

    Результат = Хост.GetProperty(Экземпляр, Свойство);

    Возврат OPI_Компоненты.ДесериализоватьJanx(Результат);

КонецФункции

// Установить свойство !NOCLI
// Записывает значение свойства экземпляра компоненты
//
// Параметры:
//  Хост      - Строка, Произвольный - Объект хоста или путь к компоненте. См. СоздатьХост      - host
//  Экземпляр - Строка               - UUID экземпляра или имя класса для временного экземпляра - class
//  Свойство  - Строка, Число        - Имя свойства                                             - prop
//  Значение  - Произвольный         - Новое значение                                           - value
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Результат операции
Функция УстановитьСвойство(Знач Хост, Знач Экземпляр, Знач Свойство, Знач Значение) Экспорт

    Хост = РазрешитьХост(Хост);

    Если Не ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    OPI_ПреобразованиеТипов.ПолучитьСтроку(Экземпляр);
    OPI_ПреобразованиеТипов.ПолучитьСтроку(Свойство);

    ЗначениеJanx = OPI_Компоненты.СериализоватьJanx(Значение);
    Результат    = Хост.SetProperty(Экземпляр, Свойство, ЗначениеJanx);

    Возврат OPI_Компоненты.ДесериализоватьJanx(Результат);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РазрешитьХост(Знач Хост)

    Если ЭтоХост(Хост) Тогда
        Возврат Хост;
    КонецЕсли;

    Возврат СоздатьХост(Хост);

КонецФункции

#КонецОбласти

#КонецЕсли // !OPI
