// OneScript: ./OInt/tests/Modules/OPItc_Slack.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

//#Использовать "../../tools/main"
//#Использовать "../../tools/http"
//#Использовать "../../api"
//#Использовать asserts
//#Использовать "internal"


// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_ПолучениеДанныхТестов.СформироватьТестыЯксCLI("Slack");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертсCLI("Slack");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область Slack

Процедура Слак_ПолучитьИнформацию() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token", ПараметрыТеста);

    Slack_ПолучитьИнформациюОБоте(ПараметрыТеста);
    Slack_ПолучитьСписокПользователей(ПараметрыТеста);
    Slack_ПолучитьСписокРабочихОбластей(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_ОтправитьУдалитьСообщение() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Channel", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Picture"      , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_User"   , ПараметрыТеста);

    Slack_ОтправитьСообщение(ПараметрыТеста);
    Slack_ИзменитьСообщение(ПараметрыТеста);
    Slack_ПолучитьСписокОтветовНаСообщение(ПараметрыТеста);
    Slack_ПолучитьСсылкуНаСообщение(ПараметрыТеста);
    Slack_УдалитьСообщение(ПараметрыТеста);
    Slack_ОтправитьЭфемерноеСообщение(ПараметрыТеста);
    Slack_ПолучитьСписокОтложенныхСообщений(ПараметрыТеста);
    Slack_СформироватьБлокКартинку(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_СоздатьАрхивироватьКанал() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_User" , ПараметрыТеста);

    Slack_СоздатьКанал(ПараметрыТеста);
    Slack_УстановитьТемуКанала(ПараметрыТеста);
    Slack_УстановитьЦельКанала(ПараметрыТеста);
    Slack_ПолучитьКанал(ПараметрыТеста);
    Slack_ПригласитьПользователейВКанал(ПараметрыТеста);
    Slack_ВыгнатьПользователяИзКанала(ПараметрыТеста);
    Slack_ПолучитьИсториюКанала(ПараметрыТеста);
    Slack_ПолучитьСписокПользователейКанала(ПараметрыТеста);
    Slack_ПокинутьКанал(ПараметрыТеста);
    Slack_ВступитьВКанал(ПараметрыТеста);
    Slack_ПереименоватьКанал(ПараметрыТеста);
    Slack_АрхивироватьКанал(ПараметрыТеста);
    Slack_ПолучитьСписокКаналов(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_ОткрытьЗакрытьДиалог() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_User" , ПараметрыТеста);

    Slack_ОткрытьДиалог(ПараметрыТеста);
    Slack_ЗакрытьДиалог(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_ЗагрузитьУдалитьФайл() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Channel", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"     , ПараметрыТеста);

    Slack_ПолучитьСписокФайлов(ПараметрыТеста);
    Slack_ЗагрузитьФайл(ПараметрыТеста);
    Slack_СделатьФайлПубличным(ПараметрыТеста);
    Slack_СделатьФайлПриватным(ПараметрыТеста);
    Slack_ПолучитьДанныеФайла(ПараметрыТеста);
    Slack_УдалитьФайл(ПараметрыТеста);

КонецПроцедуры

Процедура Слак_ЗагрузитьУдалитьВФ() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Token"  , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Slack_Channel", ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("Document"     , ПараметрыТеста);

    Slack_ПолучитьСписокВнешнихФайлов(ПараметрыТеста);
    Slack_ДобавитьВнешнийФайл(ПараметрыТеста);
    Slack_ПолучитьВнешнийФайл(ПараметрыТеста);
    Slack_ОтправитьВнешнийФайл(ПараметрыТеста);
    Slack_УдалитьВнешнийФайл(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // Slack

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область Slack

Процедура Slack_ПолучитьИнформациюОБоте(ПараметрыФункции)

    Токен     = ПараметрыФункции["Slack_Token"];
    Опции = Новый Структура;
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьИнформациюОБоте", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьИнформациюОБоте");

КонецПроцедуры

Процедура Slack_ПолучитьСписокПользователей(ПараметрыФункции)

    Токен     = ПараметрыФункции["Slack_Token"];
    Опции = Новый Структура;
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокПользователей", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокПользователей");

КонецПроцедуры

Процедура Slack_ПолучитьСписокРабочихОбластей(ПараметрыФункции)

    Токен     = ПараметрыФункции["Slack_Token"];
    Опции = Новый Структура;
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокРабочихОбластей", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокРабочихОбластей");

КонецПроцедуры

Процедура Slack_ОтправитьСообщение(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];

    // Текстовое

    Текст     = "Тестовое сообщение 1";
    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("text", Текст);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ОтправитьСообщение", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ОтправитьСообщение", , ПараметрыФункции, Текст, Канал); // SKIP

    // С вложениями (в примере: блок с картинкой)

    Текст        = "Сообщение с картинкой";
    Картинка     = ПараметрыФункции["Picture"];
    МассивБлоков = Новый Массив;

    Опции = Новый Структура;
    Опции.Вставить("picture", Картинка);
    Опции.Вставить("alt", "Картинка");

    Блок = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "СформироватьБлокКартинку", Опции);
    МассивБлоков.Добавить(Блок);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("text", Текст);
    Опции.Вставить("blocks", МассивБлоков);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ОтправитьСообщение", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ОтправитьСообщение", "Картинка", ПараметрыФункции, Текст, Канал); // SKIP

    // Отложенное

    Текст = "Отложенное сообщение";
    Час   = 3600;
    Сутки = 24;

    ДатаОтправки = OPI_Инструменты.ПолучитьТекущуюДату() + (Сутки * Час);
    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("text", Текст);
    Опции.Вставить("date", ДатаОтправки);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ОтправитьСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ОтправитьСообщение", "Отложенное", ПараметрыФункции, Текст, Канал);

    Токен   = ПараметрыФункции["Slack_Token"];
    Отметка = Результат["scheduled_message_id"];

    OPI_Slack.УдалитьСообщение(Токен, Канал, Отметка, Истина);

КонецПроцедуры

Процедура Slack_СформироватьБлокКартинку(ПараметрыФункции)

    Картинка = ПараметрыФункции["Picture"];

    Опции = Новый Структура;
    Опции.Вставить("picture", Картинка);
    Опции.Вставить("alt", "Картинка");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "СформироватьБлокКартинку", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "СформироватьБлокКартинку");

КонецПроцедуры

Процедура Slack_ИзменитьСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["Slack_Token"];
    Канал   = ПараметрыФункции["Slack_Channel"];
    Отметка = ПараметрыФункции["Slack_MessageTS"];

    Текст = "Тестовое сообщение 2";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("stamp", Отметка);
    Опции.Вставить("text", Текст);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ИзменитьСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ИзменитьСообщение", , Текст, Канал);

КонецПроцедуры

Процедура Slack_ПолучитьСписокОтветовНаСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["Slack_Token"];
    Канал   = ПараметрыФункции["Slack_Channel"];
    Отметка = ПараметрыФункции["Slack_MessageTS"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("stamp", Отметка);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокОтветовНаСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокОтветовНаСообщение");

КонецПроцедуры

Процедура Slack_ПолучитьСсылкуНаСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["Slack_Token"];
    Канал   = ПараметрыФункции["Slack_Channel"];
    Отметка = ПараметрыФункции["Slack_MessageTS"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("stamp", Отметка);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСсылкуНаСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСсылкуНаСообщение", , Канал);

КонецПроцедуры

Процедура Slack_УдалитьСообщение(ПараметрыФункции)

    Токен   = ПараметрыФункции["Slack_Token"];
    Канал   = ПараметрыФункции["Slack_Channel"];
    Отметка = ПараметрыФункции["Slack_MessageTS"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("stamp", Отметка);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "УдалитьСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "УдалитьСообщение");

КонецПроцедуры

Процедура Slack_ОтправитьЭфемерноеСообщение(ПараметрыФункции)

    Токен        = ПараметрыФункции["Slack_Token"];
    Канал        = ПараметрыФункции["Slack_Channel"];
    Пользователь = ПараметрыФункции["Slack_User"];
    Картинка     = ПараметрыФункции["Picture"];
    Текст        = "Эфимерное сообщение";

    Опции = Новый Структура;
    Опции.Вставить("picture", Картинка);
    Опции.Вставить("alt", "Картинка");

    Блок = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "СформироватьБлокКартинку", Опции);
    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("text", Текст);
    Опции.Вставить("user", Пользователь);
    Опции.Вставить("blocks", Блок);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ОтправитьЭфемерноеСообщение", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ОтправитьЭфемерноеСообщение");

КонецПроцедуры

Процедура Slack_ПолучитьСписокОтложенныхСообщений(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокОтложенныхСообщений", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокОтложенныхСообщений");

КонецПроцедуры

Процедура Slack_СоздатьКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Имя   = "testconv" + Строка(Новый УникальныйИдентификатор);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("title", Имя);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "СоздатьКанал", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "СоздатьКанал", , ПараметрыФункции, Имя);

КонецПроцедуры

Процедура Slack_УстановитьТемуКанала(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];
    Тема  = "Тестовая тема";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("theme", Тема);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "УстановитьТемуКанала", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "УстановитьТемуКанала", , Тема);

КонецПроцедуры

Процедура Slack_УстановитьЦельКанала(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];
    Цель  = "Тестовая цель";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("purpose", Цель);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "УстановитьЦельКанала", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "УстановитьЦельКанала");

КонецПроцедуры

Процедура Slack_ПолучитьКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьКанал", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьКанал", , ПараметрыФункции["Slack_NewChannelName"]);

КонецПроцедуры

Процедура Slack_ПригласитьПользователейВКанал(ПараметрыФункции)

    Токен        = ПараметрыФункции["Slack_Token"];
    Канал        = ПараметрыФункции["Slack_NewChannel"];
    Пользователь = ПараметрыФункции["Slack_User"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("users", Пользователь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПригласитьПользователейВКанал", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПригласитьПользователейВКанал", , ПараметрыФункции["Slack_NewChannelName"]);

КонецПроцедуры

Процедура Slack_ВыгнатьПользователяИзКанала(ПараметрыФункции)

    Токен        = ПараметрыФункции["Slack_Token"];
    Канал        = ПараметрыФункции["Slack_NewChannel"];
    Пользователь = ПараметрыФункции["Slack_User"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("user", Пользователь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ВыгнатьПользователяИзКанала", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ВыгнатьПользователяИзКанала");

КонецПроцедуры

Процедура Slack_ПолучитьИсториюКанала(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьИсториюКанала", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьИсториюКанала");

КонецПроцедуры

Процедура Slack_ПолучитьСписокПользователейКанала(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокПользователейКанала", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокПользователейКанала");

КонецПроцедуры

Процедура Slack_ПокинутьКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПокинутьКанал", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПокинутьКанал");

КонецПроцедуры

Процедура Slack_ВступитьВКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ВступитьВКанал", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ВступитьВКанал", , ПараметрыФункции["Slack_NewChannelName"]);

КонецПроцедуры

Процедура Slack_ПереименоватьКанал(ПараметрыФункции)

    Токен    = ПараметрыФункции["Slack_Token"];
    Канал    = ПараметрыФункции["Slack_NewChannel"];
    Название = "testconv" + Строка(Новый УникальныйИдентификатор);

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("title", Название);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПереименоватьКанал", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПереименоватьКанал", , Название);

КонецПроцедуры

Процедура Slack_АрхивироватьКанал(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_NewChannel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "АрхивироватьКанал", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "АрхивироватьКанал");

КонецПроцедуры

Процедура Slack_ПолучитьСписокКаналов(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокКаналов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокКаналов");

КонецПроцедуры

Процедура Slack_ОткрытьДиалог(ПараметрыФункции)

    Токен        = ПараметрыФункции["Slack_Token"];
    Пользователь = ПараметрыФункции["Slack_User"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("users", Пользователь);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ОткрытьДиалог", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ОткрытьДиалог", , ПараметрыФункции);

    Канал = Результат["channel"]["id"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);
    Опции.Вставить("text", "Тест диалог");

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ОтправитьСообщение", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ОткрытьДиалог", "Сообщение", ПараметрыФункции);

КонецПроцедуры

Процедура Slack_ЗакрытьДиалог(ПараметрыФункции)

    Токен  = ПараметрыФункции["Slack_Token"];
    Диалог = ПараметрыФункции["Slack_Dialog"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("conv", Диалог);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ЗакрытьДиалог", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ЗакрытьДиалог");

КонецПроцедуры

Процедура Slack_ПолучитьСписокФайлов(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокФайлов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокФайлов");

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокФайлов", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокФайлов", "Все");

КонецПроцедуры

Процедура Slack_ЗагрузитьФайл(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];
    Файл  = ПараметрыФункции["Document"]; // URL, Двоичные данные или Путь к файлу

    ИмяФайла  = "megadoc.docx";
    Заголовок = "Новый файл";

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("file", Файл);
    Опции.Вставить("filename", ИмяФайла);
    Опции.Вставить("title", Заголовок);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ЗагрузитьФайл", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ЗагрузитьФайл", , ПараметрыФункции, ИмяФайла); // SKIP
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "СделатьФайлПубличным");                        // SKIP
    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "СделатьФайлПриватным");                        // SKIP

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("file", Файл);
    Опции.Вставить("filename", ИмяФайла);
    Опции.Вставить("title", Заголовок);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ЗагрузитьФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ЗагрузитьФайл", "Канал", ПараметрыФункции, ИмяФайла);
    OPI_Slack.УдалитьФайл(ПараметрыФункции["Slack_Token"], Результат["files"][0]["id"]);

КонецПроцедуры

Процедура Slack_СделатьФайлПубличным(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_FileID"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("fileid", ИдентификаторФайла);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "СделатьФайлПубличным", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "СделатьФайлПубличным", "Без записи");

КонецПроцедуры

Процедура Slack_СделатьФайлПриватным(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_FileID"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("fileid", ИдентификаторФайла);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "СделатьФайлПриватным", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "СделатьФайлПриватным", "Без записи");

КонецПроцедуры

Процедура Slack_ПолучитьДанныеФайла(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_FileID"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("fileid", ИдентификаторФайла);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьДанныеФайла", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьДанныеФайла", , "megadoc.docx");

КонецПроцедуры

Процедура Slack_УдалитьФайл(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_FileID"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("fileid", ИдентификаторФайла);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "УдалитьФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "УдалитьФайл");

КонецПроцедуры

Процедура Slack_ПолучитьСписокВнешнихФайлов(ПараметрыФункции)

    Токен = ПараметрыФункции["Slack_Token"];
    Канал = ПараметрыФункции["Slack_Channel"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("channel", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокВнешнихФайлов", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокВнешнихФайлов");

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьСписокВнешнихФайлов", Опции);

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьСписокВнешнихФайлов", "Все");

КонецПроцедуры

Процедура Slack_ДобавитьВнешнийФайл(ПараметрыФункции)

    Токен     = ПараметрыФункции["Slack_Token"];
    Заголовок = "Новый файл";
    Файл      = ПараметрыФункции["Document"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("url", Файл);
    Опции.Вставить("title", Заголовок);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ДобавитьВнешнийФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ДобавитьВнешнийФайл", , ПараметрыФункции, Заголовок);

КонецПроцедуры

Процедура Slack_ПолучитьВнешнийФайл(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_ExtFileID"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("fileid", ИдентификаторФайла);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ПолучитьВнешнийФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ПолучитьВнешнийФайл");

КонецПроцедуры

Процедура Slack_ОтправитьВнешнийФайл(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    Канал              = ПараметрыФункции["Slack_Channel"];
    ИдентификаторФайла = ПараметрыФункции["Slack_ExtFileID"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("fileid", ИдентификаторФайла);
    Опции.Вставить("channels", Канал);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "ОтправитьВнешнийФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "ОтправитьВнешнийФайл");

КонецПроцедуры

Процедура Slack_УдалитьВнешнийФайл(ПараметрыФункции)

    Токен              = ПараметрыФункции["Slack_Token"];
    ИдентификаторФайла = ПараметрыФункции["Slack_ExtFileID"];

    Опции = Новый Структура;
    Опции.Вставить("token", Токен);
    Опции.Вставить("fileid", ИдентификаторФайла);

    Результат = OPI_ПолучениеДанныхТестов.ВыполнитьТестCLI("slack", "УдалитьВнешнийФайл", Опции);

    // END

    OPI_ПолучениеДанныхТестов.ОбработатьCLI(Результат, "Slack", "УдалитьВнешнийФайл");

КонецПроцедуры

#КонецОбласти // Slack

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции


#Region Alternate

Procedure SlackGetData() Export
    Слак_ПолучитьИнформацию();
EndProcedure

Procedure Slack_SendDeleteMessage() Export
    Слак_ОтправитьУдалитьСообщение();
EndProcedure

Procedure Slack_CreateArchiveChannel() Export
    Слак_СоздатьАрхивироватьКанал();
EndProcedure

Procedure Slack_OpenCloseDialog() Export
    Слак_ОткрытьЗакрытьДиалог();
EndProcedure

Procedure Slack_UploadDeleteFile() Export
    Слак_ЗагрузитьУдалитьФайл();
EndProcedure

Procedure Slack_UploadDeleteExternalFile() Export
    Слак_ЗагрузитьУдалитьВФ();
EndProcedure

#EndRegion
