// OneScript: ./OInt/tests/Modules/OPIt_CDEK.os

// MIT License

// Copyright (c) 2023-2026 Anton Tsitavets

// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:

// The above copyright notice and +this permission notice shall be included in all
// copies or substantial portions of the Software.

// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

// https://github.com/Bayselonarrend/OpenIntegrations

// Набор тестов для YAxUnit

// BSLLS:Typo-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:IncorrectLineBreak-off
// BSLLS:UsingServiceTag-off
// BSLLS:UnusedParameters-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:UsingHardcodePath-off
// BSLLS:UnusedLocalVariable-off
// BSLLS:DeprecatedMessage-off
// BSLLS:LineLength-off
// BSLLS:MagicNumber-off
// BSLLS:CommentedCode-off
// BSLLS:AssignAliasFieldsInQuery-off
// BSLLS:UsingHardcodeNetworkAddress-off
// BSLLS:UnreachableCode-off
// BSLLS:UnusedLocalMethod-off
// BSLLS:NestedFunctionInParameters-off
// BSLLS:MissingTemporaryFileDeletion-off
// BSLLS:UsingSynchronousCalls-off
// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NumberOfOptionalParams-off
// BSLLS:MethodSize-off
// BSLLS:NestedConstructorsInStructureDeclaration-off
// BSLLS:NumberOfValuesInStructureConstructor-off
// BSLLS:UsingHardcodeSecretInformation-off
// BSLLS:SpaceAtStartComment-off

//@skip-check undefined-variable
//@skip-check wrong-string-literal-content
//@skip-check module-structure-top-region
//@skip-check module-structure-method-in-regions
//@skip-check undefined-function-or-procedure
//@skip-check wrong-string-literal-content
//@skip-check module-unused-local-variable
//@skip-check bsl-legacy-check-string-literal
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check missing-temporary-file-deletion
//@skip-check module-unused-method

// #Использовать oint
// #Использовать asserts
// #Использовать "internal"

#Если Не ВебКлиент Тогда

// Для YaxUnit

Процедура ИсполняемыеСценарии() Экспорт

    OPI_СписокТестовКлиентСервер.СформироватьТестыЯкс("CDEK");

КонецПроцедуры

// Для Asserts

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    Возврат OPI_ПолучениеДанныхТестов.СформироватьТестыАссертс("CDEK");

КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗапускаемыеТесты

#Область CDEK

Процедура СдэкАПИ_ОбщиеМетоды() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("CDEK_Account" , ПараметрыТеста);
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("CDEK_Password", ПараметрыТеста);

    CDEK_ПолучитьТокен(ПараметрыТеста);
    CDEK_ПолучитьЧекиНаДату(ПараметрыТеста);
    CDEK_ПолучитьРеестрыПлатежейНаДату(ПараметрыТеста);
    CDEK_ПолучитьПереводыПлатежейНаДату(ПараметрыТеста);
    CDEK_ПолучитьОписаниеФильтраОфисов(ПараметрыТеста);
    CDEK_ПолучитьСписокОфисов(ПараметрыТеста);
    CDEK_ПолучитьСписокРегионов(ПараметрыТеста);

КонецПроцедуры

Процедура СдэкАПИ_РаботаСЗаказами() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("CDEK_Token", ПараметрыТеста);

    CDEK_ПолучитьОписаниеЗаказа(ПараметрыТеста);
    CDEK_СоздатьЗаказ(ПараметрыТеста);

    OPI_Инструменты.Пауза(25);

    CDEK_ПолучитьЗаказ(ПараметрыТеста);
    CDEK_ПолучитьЗаказПоНомеру(ПараметрыТеста);
    CDEK_СформироватьКвитанцию(ПараметрыТеста);
    CDEK_СформироватьШтрихкод(ПараметрыТеста);
    CDEK_СоздатьПреалерт(ПараметрыТеста);

    OPI_Инструменты.Пауза(25);

    CDEK_ПолучитьКвитанцию(ПараметрыТеста);
    CDEK_ПолучитьШтрихкод(ПараметрыТеста);
    CDEK_ПолучитьПреалерт(ПараметрыТеста);
    CDEK_ПолучитьСтатусПаспортныхДанных(ПараметрыТеста);
    CDEK_ПолучитьЧекЗаказа(ПараметрыТеста);
    CDEK_ИзменитьЗаказ(ПараметрыТеста);
    CDEK_ОформитьКлиентскийВозврат(ПараметрыТеста);
    CDEK_СоздатьОтказ(ПараметрыТеста);
    CDEK_УдалитьЗаказ(ПараметрыТеста);

КонецПроцедуры

Процедура СдэкАПИ_РаботаСЗаявкамиНаВызовКурьера() Экспорт

    ПараметрыТеста = Новый Структура;
    OPI_ПолучениеДанныхТестов.ПараметрВКоллекцию("CDEK_Token", ПараметрыТеста);

    CDEK_СоздатьЗаказ(ПараметрыТеста);

    OPI_Инструменты.Пауза(25);

    CDEK_ПолучитьОписаниеЗаявкиКурьера(ПараметрыТеста);
    CDEK_СоздатьЗаявкуНаВызовКурьера(ПараметрыТеста);
    CDEK_ПолучитьЗаявкуНаВызовКурьера(ПараметрыТеста);
    CDEK_УдалитьЗаявкуНаВызовКурьера(ПараметрыТеста);
    CDEK_ПолучитьОписаниеДоговоренности(ПараметрыТеста);

    CDEK_ПолучитьДоступныеИнтервалыДоставки(ПараметрыТеста);
    CDEK_ЗафиксироватьДоговоренностьОДоставке(ПараметрыТеста);

    OPI_Инструменты.Пауза(25);

    CDEK_ПолучитьДоговоренностьОДоставке(ПараметрыТеста);
    CDEK_УдалитьЗаказ(ПараметрыТеста);

КонецПроцедуры

#КонецОбласти // CDEK

#КонецОбласти // ЗапускаемыеТесты

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область АтомарныеТесты

#Область CDEK

Процедура CDEK_ПолучитьТокен(ПараметрыФункции)

    Аккаунт = ПараметрыФункции["CDEK_Account"];
    Пароль  = ПараметрыФункции["CDEK_Password"];

    Результат = OPI_CDEK.ПолучитьТокен(Аккаунт, Пароль, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьТокен", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьОписаниеЗаказа(ПараметрыФункции)

    Результат = OPI_CDEK.ПолучитьОписаниеЗаказа();

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьОписаниеЗаказа");

    Результат = OPI_CDEK.ПолучитьОписаниеЗаказа(Истина);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьОписаниеЗаказа", "Пустая");

КонецПроцедуры

Процедура CDEK_СоздатьЗаказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];

    ОписаниеЗаказа = Новый Структура;

    ЛокацияОтправления = Новый Структура;
    ЛокацияОтправления.Вставить("code"   , "44");
    ЛокацияОтправления.Вставить("city"   , "Москва");
    ЛокацияОтправления.Вставить("address", "пр. Ленинградский, д.4");

    ЛокацияНазначения = Новый Структура;
    ЛокацияНазначения.Вставить("code"   , "270");
    ЛокацияНазначения.Вставить("city"   , "Новосибирск");
    ЛокацияНазначения.Вставить("address", "ул. Блюхера, 32");

    Получатель = Новый Структура;

    Телефоны = Новый Массив;
    Телефоны.Добавить(Новый Структура("number", "+79134637228"));

    Получатель.Вставить("phones", Телефоны);
    Получатель.Вставить("name"  , "Иванов Иван");

    Отправитель = Новый Структура("name", "Петров Петр");

    Услуги = Новый Массив;

    Услуга = Новый Структура;
    Услуга.Вставить("code"     , "SECURE_PACKAGE_A2");
    Услуга.Вставить("parameter", 10);

    Услуги.Добавить(Услуга);

    Пакеты = Новый Массив;

    Пакет = Новый Структура;

    Позиции = Новый Массив;

    Позиция = Новый Структура;

    Оплата = Новый Структура;
    Оплата.Вставить("value", 3000);

    Позиция.Вставить("payment" , Оплата);
    Позиция.Вставить("ware_key", "00055");
    Позиция.Вставить("name"    , "Товар");
    Позиция.Вставить("cost"    , 300);
    Позиция.Вставить("amount"  , 2);
    Позиция.Вставить("weight"  , 700);
    Позиция.Вставить("url"     , "www.item.ru");

    Позиции.Добавить(Позиция);

    Пакет.Вставить("items"  , Позиции);
    Пакет.Вставить("number" , "bar-001");
    Пакет.Вставить("comment", "Упаковка");
    Пакет.Вставить("height" , 10);
    Пакет.Вставить("length" , 10);
    Пакет.Вставить("weight" , "4000");
    Пакет.Вставить("width"  , 10);

    Пакеты.Добавить(Пакет);

    ОписаниеЗаказа.Вставить("from_location", ЛокацияОтправления);
    ОписаниеЗаказа.Вставить("to_location"  , ЛокацияНазначения);
    ОписаниеЗаказа.Вставить("packages"     , Пакеты);
    ОписаниеЗаказа.Вставить("recipient"    , Получатель);
    ОписаниеЗаказа.Вставить("sender"       , Отправитель);
    ОписаниеЗаказа.Вставить("services"     , Услуги);

    ОписаниеЗаказа.Вставить("number"     , Строка(Новый УникальныйИдентификатор));
    ОписаниеЗаказа.Вставить("comment"    , "Новый заказ");
    ОписаниеЗаказа.Вставить("tariff_code", 139);

    ОписаниеЗаказа.Вставить("delivery_recipient_cost"    , Новый Структура("value"        , 50));
    ОписаниеЗаказа.Вставить("delivery_recipient_cost_adv", Новый Структура("sum,threshold", 3000, 200));

    Результат = OPI_CDEK.СоздатьЗаказ(Токен, ОписаниеЗаказа, Истина, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "СоздатьЗаказ", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьЗаказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.ПолучитьЗаказ(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьЗаказ", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьЗаказПоНомеру(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];

    НомерЗаказа = ПараметрыФункции["CDEK_OrderIMN"];
    Результат   = OPI_CDEK.ПолучитьЗаказПоНомеру(Токен, НомерЗаказа, Истина, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьЗаказПоНомеру");

КонецПроцедуры

Процедура CDEK_ИзменитьЗаказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    ОписаниеЗаказа = Новый Структура("comment", "Новый комментарий");

    Результат = OPI_CDEK.ИзменитьЗаказ(Токен, UUID, ОписаниеЗаказа, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ИзменитьЗаказ");

КонецПроцедуры

Процедура CDEK_УдалитьЗаказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.УдалитьЗаказ(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "УдалитьЗаказ");

КонецПроцедуры

Процедура CDEK_ОформитьКлиентскийВозврат(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];
    Тариф = 139;

    Результат = OPI_CDEK.ОформитьКлиентскийВозврат(Токен, UUID, Тариф, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ОформитьКлиентскийВозврат");

КонецПроцедуры

Процедура CDEK_СоздатьОтказ(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.СоздатьОтказ(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "СоздатьОтказ");

КонецПроцедуры

Процедура CDEK_ПолучитьОписаниеЗаявкиКурьера(ПараметрыФункции)

    Результат = OPI_CDEK.ПолучитьОписаниеЗаявкиКурьера();

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьОписаниеЗаявкиКурьера");

    Результат = OPI_CDEK.ПолучитьОписаниеЗаявкиКурьера(Истина);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьОписаниеЗаявкиКурьера", "Пустая");

КонецПроцедуры

Процедура CDEK_СоздатьЗаявкуНаВызовКурьера(ПараметрыФункции)

    Токен       = ПараметрыФункции["CDEK_Token"];
    ТекущаяДата = OPI_Инструменты.ПолучитьТекущуюДату();

    ОписаниеЗаявки = Новый Структура;
    ОписаниеЗаявки.Вставить("intake_date"     , Формат(ТекущаяДата + 60 * 60 * 24, "ДФ=yyyy-MM-dd"));
    ОписаниеЗаявки.Вставить("intake_time_from", "10:00");
    ОписаниеЗаявки.Вставить("intake_time_to"  , "17:00");
    ОписаниеЗаявки.Вставить("name"            , "Консолидированный груз");
    ОписаниеЗаявки.Вставить("weight"          , 1000);
    ОписаниеЗаявки.Вставить("length"          , 10);
    ОписаниеЗаявки.Вставить("width"           , 10);
    ОписаниеЗаявки.Вставить("height"          , 10);
    ОписаниеЗаявки.Вставить("comment"         , "Комментарий курьеру");
    ОписаниеЗаявки.Вставить("need_call"       , Ложь);

    Отправитель = Новый Структура;
    Отправитель.Вставить("company", "Компания");
    Отправитель.Вставить("name"   , "Иванов Иван");

    Телефоны = Новый Массив;
    Телефон  = Новый Структура("number", "+79589441654");
    Телефоны.Добавить(Телефон);

    Отправитель.Вставить("phones", Телефоны);

    ОписаниеЗаявки.Вставить("sender", Отправитель);

    ТочкаОтправления = Новый Структура;
    ТочкаОтправления.Вставить("code"        , "44");
    ТочкаОтправления.Вставить("fias_guid"   , "0c5b2444-70a0-4932-980c-b4dc0d3f02b5");
    ТочкаОтправления.Вставить("postal_code" , "109004");
    ТочкаОтправления.Вставить("longitude"   , 37.6204);
    ТочкаОтправления.Вставить("latitude"    , 55.754);
    ТочкаОтправления.Вставить("country_code", "RU");
    ТочкаОтправления.Вставить("region"      , "Москва");
    ТочкаОтправления.Вставить("sub_region"  , "Москва");
    ТочкаОтправления.Вставить("city"        , "Москва");
    ТочкаОтправления.Вставить("kladr_code"  , "7700000000000");
    ТочкаОтправления.Вставить("address"     , "ул. Блюхера, 32");

    ОписаниеЗаявки.Вставить("from_location", ТочкаОтправления);

    Результат = OPI_CDEK.СоздатьЗаявкуНаВызовКурьера(Токен, ОписаниеЗаявки, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "СоздатьЗаявкуНаВызовКурьера", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьЗаявкуНаВызовКурьера(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_IntakeUUID"];

    Результат = OPI_CDEK.ПолучитьЗаявкуНаВызовКурьера(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьЗаявкуНаВызовКурьера");

КонецПроцедуры

Процедура CDEK_УдалитьЗаявкуНаВызовКурьера(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_IntakeUUID"];

    Результат = OPI_CDEK.УдалитьЗаявкуНаВызовКурьера(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "УдалитьЗаявкуНаВызовКурьера");

КонецПроцедуры

Процедура CDEK_СформироватьКвитанцию(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];
    Тип   = "tpl_russia";
    Копий = 1;

    Результат = OPI_CDEK.СформироватьКвитанцию(Токен, UUID, Тип, Копий, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "СформироватьКвитанцию", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьКвитанцию(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_PrintUUID"];

    Результат = OPI_CDEK.ПолучитьКвитанцию(Токен, UUID, , Истина); // Ответ сервера с ссылкой

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьКвитанцию");

КонецПроцедуры

Процедура CDEK_СформироватьШтрихкод(ПараметрыФункции)

    Токен  = ПараметрыФункции["CDEK_Token"];
    UUID   = ПараметрыФункции["CDEK_OrderUUID"];
    Формат = "A5";
    Копий  = 1;

    Результат = OPI_CDEK.СформироватьШтрихкод(Токен, UUID, Копий, Формат, , Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "СформироватьШтрихкод", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьШтрихкод(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_BarcodeUUID"];

    Результат = OPI_CDEK.ПолучитьШтрихкод(Токен, UUID, , Истина); // Ответ сервера с ссылкой

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьШтрихкод");

КонецПроцедуры

Процедура CDEK_ПолучитьДоступныеИнтервалыДоставки(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.ПолучитьДоступныеИнтервалыДоставки(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьДоступныеИнтервалыДоставки");

КонецПроцедуры

Процедура CDEK_ПолучитьОписаниеДоговоренности(ПараметрыФункции)

    Результат = OPI_CDEK.ПолучитьОписаниеДоговоренности();

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьОписаниеДоговоренности");

    Результат = OPI_CDEK.ПолучитьОписаниеДоговоренности(Истина);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьОписаниеДоговоренности", "Пустая");

КонецПроцедуры

Процедура CDEK_ЗафиксироватьДоговоренностьОДоставке(ПараметрыФункции)

    Токен      = ПараметрыФункции["CDEK_Token"];
    UUIDЗаказа = ПараметрыФункции["CDEK_OrderUUID"];

    Сутки        = 60 * 60 * 24;
    ТекущаяДата  = НачалоДня(OPI_Инструменты.ПолучитьТекущуюДату());
    ДатаДоставки = ТекущаяДата + Сутки * 14;

    Пока ДеньНедели(ДатаДоставки) > 5 Цикл
        ДатаДоставки = ДатаДоставки + Сутки;
    КонецЦикла;

    Договоренность = Новый Структура;

    Договоренность.Вставить("cdek_number", "1106207236");
    Договоренность.Вставить("order_uuid" , UUIDЗаказа);
    Договоренность.Вставить("date"       , Формат(ДатаДоставки, "ДФ=yyyy-MM-dd"));
    Договоренность.Вставить("time_from"  , "10:00");
    Договоренность.Вставить("time_to"    , "17:00");
    Договоренность.Вставить("comment"    , "Офис группы компаний");

    МестоДоставки = Новый Структура;
    МестоДоставки.Вставить("code"        , "270");
    МестоДоставки.Вставить("fias_guid"   , "0c5b2444-70a0-4932-980c-b4dc0d3f02b5");
    МестоДоставки.Вставить("postal_code" , "109004");
    МестоДоставки.Вставить("longitude"   , 37.6204);
    МестоДоставки.Вставить("latitude"    , 55.754);
    МестоДоставки.Вставить("country_code", "RU");
    МестоДоставки.Вставить("region"      , "Новосибирск");
    МестоДоставки.Вставить("sub_region"  , "Новосибирск");
    МестоДоставки.Вставить("city"        , "Новосибирск");
    МестоДоставки.Вставить("kladr_code"  , "7700000000000");
    МестоДоставки.Вставить("address"     , "ул. Блюхера, 33");

    Договоренность.Вставить("to_location", МестоДоставки);

    Результат = OPI_CDEK.ЗафиксироватьДоговоренностьОДоставке(Токен, Договоренность, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ЗафиксироватьДоговоренностьОДоставке", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьДоговоренностьОДоставке(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_ApptUUID"];

    Результат = OPI_CDEK.ПолучитьДоговоренностьОДоставке(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьДоговоренностьОДоставке");

КонецПроцедуры

Процедура CDEK_СоздатьПреалерт(ПараметрыФункции)

    Токен        = ПараметрыФункции["CDEK_Token"];
    UUID         = ПараметрыФункции["CDEK_OrderUUID"];
    ПВЗ          = "NSK27";
    ДатаПередачи = OPI_Инструменты.ПолучитьТекущуюДату() + 60 * 60 * 24;

    Результат = OPI_CDEK.СоздатьПреалерт(Токен, UUID, ДатаПередачи, ПВЗ, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "СоздатьПреалерт", , ПараметрыФункции);

КонецПроцедуры

Процедура CDEK_ПолучитьПреалерт(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_PrealertUUID"];

    Результат = OPI_CDEK.ПолучитьПреалерт(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьПреалерт");

КонецПроцедуры

Процедура CDEK_ПолучитьСтатусПаспортныхДанных(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.ПолучитьСтатусПаспортныхДанных(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьСтатусПаспортныхДанных");

КонецПроцедуры

Процедура CDEK_ПолучитьЧекЗаказа(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];
    UUID  = ПараметрыФункции["CDEK_OrderUUID"];

    Результат = OPI_CDEK.ПолучитьЧекЗаказа(Токен, UUID, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьЧекЗаказа");

КонецПроцедуры

Процедура CDEK_ПолучитьЧекиНаДату(ПараметрыФункции)

    Токен         = ПараметрыФункции["CDEK_Token"];
    ДатаПолучения = OPI_Инструменты.ПолучитьТекущуюДату();

    Результат = OPI_CDEK.ПолучитьЧекиНаДату(Токен, ДатаПолучения, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьЧекиНаДату");

КонецПроцедуры

Процедура CDEK_ПолучитьРеестрыПлатежейНаДату(ПараметрыФункции)

    Токен         = ПараметрыФункции["CDEK_Token"];
    ДатаПолучения = OPI_Инструменты.ПолучитьТекущуюДату();

    Результат = OPI_CDEK.ПолучитьРеестрыПлатежейНаДату(Токен, ДатаПолучения, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьРеестрыПлатежейНаДату");

КонецПроцедуры

Процедура CDEK_ПолучитьПереводыПлатежейНаДату(ПараметрыФункции)

    Токен         = ПараметрыФункции["CDEK_Token"];
    ДатаПолучения = OPI_Инструменты.ПолучитьТекущуюДату();

    Результат = OPI_CDEK.ПолучитьПереводыПлатежейНаДату(Токен, ДатаПолучения, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьПереводыПлатежейНаДату");

КонецПроцедуры

Процедура CDEK_ПолучитьОписаниеФильтраОфисов(ПараметрыФункции)

    Результат = OPI_CDEK.ПолучитьОписаниеФильтраОфисов();

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьОписаниеФильтраОфисов");

    Результат = OPI_CDEK.ПолучитьОписаниеФильтраОфисов(Истина);

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьОписаниеФильтраОфисов", "Пустая");

КонецПроцедуры

Процедура CDEK_ПолучитьСписокОфисов(ПараметрыФункции)

    Токен  = ПараметрыФункции["CDEK_Token"];
    Фильтр = Новый Структура;
    Фильтр.Вставить("weight_max" , 50);
    Фильтр.Вставить("city_code"  , 270);
    Фильтр.Вставить("allowed_cod", Истина);

    Результат = OPI_CDEK.ПолучитьСписокОфисов(Токен, Фильтр, Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьСписокОфисов");

КонецПроцедуры

Процедура CDEK_ПолучитьСписокРегионов(ПараметрыФункции)

    Токен = ПараметрыФункции["CDEK_Token"];

    Результат = OPI_CDEK.ПолучитьСписокРегионов(Токен, , , , Истина);

    // END

    OPI_ПолучениеДанныхТестов.Обработать(Результат, "CDEK", "ПолучитьСписокРегионов");

КонецПроцедуры

#КонецОбласти // CDEK

#КонецОбласти // АтомарныеТесты

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
