Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СерверноеВремя";
    НоваяСтрока.МетодПоиска = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр    = "--хука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Описание    = "URL внешнего веб";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает текущее серверное время";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СерверноеВремя";
    НоваяСтрока.МетодПоиска = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр    = "--хук";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не веб (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--хука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Описание    = "URL внешнего веб";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--хука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Описание    = "URL внешнего веб";
    НоваяСтрока.Область     = "Живая лента";

    Возврат ТаблицаСостава;
КонецФункции

