Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСсылкуАвторизацииПриложения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬССЫЛКУАВТОРИЗАЦИИПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр    = "--domain";
    НоваяСтрока.Описание    = "Адрес битрикс вида portal.bitrix24.com";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Формирует ссылку для авторизации через браузер";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСсылкуАвторизацииПриложения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬССЫЛКУАВТОРИЗАЦИИПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает токен по коду авторизации";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientsecret";
    НоваяСтрока.Описание    = "Client secret из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--code";
    НоваяСтрока.Описание    = "Code из авторизации через браузер";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Обновляет токен по Refresh токену";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientsecret";
    НоваяСтрока.Описание    = "Client secret из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--refresh";
    НоваяСтрока.Описание    = "Refresh токен";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СерверноеВремя";
    НоваяСтрока.МетодПоиска = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает текущее серверное время";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СерверноеВремя";
    НоваяСтрока.МетодПоиска = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Создает новую новость в ленте";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст новости";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Удаляет новость из ленты по выбранному ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости для удаления";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Возвращает список пользователей, просмотревших выбранное важное сообщение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID важной новости";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Получает нвости или одну новость с отобором по ID или доступности";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID важной новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Отбор новостей по доступу (UA все, SGn раб. группа, Un пользователь, DRn отдел, Gn группа) (необяз. по ум. - UA)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";

    Возврат ТаблицаСостава;
КонецФункции

