Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСсылкуАвторизацииПриложения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬССЫЛКУАВТОРИЗАЦИИПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр    = "--domain";
    НоваяСтрока.Описание    = "Адрес битрикс вида portal.bitrix24.com";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Формирует ссылку для авторизации через браузер";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСсылкуАвторизацииПриложения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬССЫЛКУАВТОРИЗАЦИИПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает токен по коду авторизации";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientsecret";
    НоваяСтрока.Описание    = "Client secret из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--code";
    НоваяСтрока.Описание    = "Code из авторизации через браузер";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Обновляет токен по Refresh токену";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientsecret";
    НоваяСтрока.Описание    = "Client secret из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--refresh";
    НоваяСтрока.Описание    = "Refresh токен";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СерверноеВремя";
    НоваяСтрока.МетодПоиска = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает текущее серверное время";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СерверноеВремя";
    НоваяСтрока.МетодПоиска = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Создает новую новость в ленте";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст новости";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--vision";
    НоваяСтрока.Описание    = "Массив или 1 получатель: UA все, SGn р. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--files";
    НоваяСтрока.Описание    = "Данные вложений, где ключ > имя файла, значение > путь к файлу иди двоичные данные (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Заголовок новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--important";
    НоваяСтрока.Описание    = "Помечает новость как важную (необяз. по ум. - False)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Изменяет новость в ленте";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст новости";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--vision";
    НоваяСтрока.Описание    = "Массив или 1 получатель: UA все, SGn р. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--files";
    НоваяСтрока.Описание    = "Данные вложений, где ключ > имя файла, значение > путь к файлу иди двоичные данные (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Заголовок новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Удаляет новость из ленты по выбранному ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости для удаления";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Возвращает список пользователей, просмотревших выбранное важное сообщение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID важной новости";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Получает нвости или одну новость с отобором по ID или доступности";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID важной новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Отбор новостей по доступу: UA все, SGn раб. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьКомментарий";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Добавляет комментарий к новости";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьКомментарий";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьКомментарий";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст комментария";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьКомментарий";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Добавляет новые группы или пользователей в получатели";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр    = "--vision";
    НоваяСтрока.Описание    = "Массив или 1 получатель: UA все, SGn р. группа, Un пользователь, DRn отдел, Gn группа";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУЗАДАЧИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру с описанем полей для создания задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУЗАДАЧИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает список задач (50 шт. за запрос максимум) с фильтром или без (см. ПолучитьСтруктуруФильтраЗадач)";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр    = "--filter";
    НоваяСтрока.Описание    = "Структура отбора задач (см. ПолучитьСтруктуруФильтраЗадач) (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр    = "--offset";
    НоваяСтрока.Описание    = "Отступ от начала списка для полчения задач > 50 шт. рекурсивно (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Создает новую задачу по структуре полей (см. ПолучитьСтруктуруЗадачи)";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--fields";
    НоваяСтрока.Описание    = "Структура полей задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет существующую задачу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--fields";
    НоваяСтрока.Описание    = "Структура полей задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Принимает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Отклоняет задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Завершает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Возвращает в работу задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Откладывает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Приостанавливает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Начинает выполнение задачи по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Начинает наблюдение за задачей по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Прекращает наблюдение за задчей по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Делегирует задачу на другого пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--user";
    НоваяСтрока.Описание    = "ID пользователя исполнителя";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Добавляет задачу в список избранного";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет задачу из списка избранного";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьИсториюЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬИСТОРИЮЗАДАЧИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает историю изменений задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьИсториюЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬИСТОРИЮЗАДАЧИ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьИсториюЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬИСТОРИЮЗАДАЧИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокКомментариевЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВЗАДАЧИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Полчает список комментариев пользователей к задаче по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокКомментариевЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВЗАДАЧИ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокКомментариевЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВЗАДАЧИ";
    НоваяСтрока.Параметр    = "--filter";
    НоваяСтрока.Описание    = "Структура отбора (см. ПолучитьСтруктуруФильтраКомментариев) (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокКомментариевЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВЗАДАЧИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруФильтраЗадач";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАЗАДАЧ";
    НоваяСтрока.Параметр    = "--empty";
    НоваяСтрока.Описание    = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей для фильтрации задач в методе ПолучитьСписокЗадач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруФильтраКомментариев";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАКОММЕНТАРИЕВ";
    НоваяСтрока.Параметр    = "--empty";
    НоваяСтрока.Описание    = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область     = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей для фильтрации комментариев в методе ПолучитьСписокКомментариевЗадачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокХранилищ";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКХРАНИЛИЩ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает список доступных хранилищ файлов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокХранилищ";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКХРАНИЛИЩ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьХранилищеПриложения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬХРАНИЛИЩЕПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о хранилище с которым может работать приложение для хранения своих данных";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьХранилищеПриложения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬХРАНИЛИЩЕПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьХранилище";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о хранилище по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьХранилище";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--storageid";
    НоваяСтрока.Описание    = "Идентификатор хранилища";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьХранилище";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПереименоватьХранилище";
    НоваяСтрока.МетодПоиска = "ПЕРЕИМЕНОВАТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет имя хранилища (только для хранилища приложения см. ПолучитьСписокХранилищПриложения)";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПереименоватьХранилище";
    НоваяСтрока.МетодПоиска = "ПЕРЕИМЕНОВАТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--storageid";
    НоваяСтрока.Описание    = "Идентификатор хранилища";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПереименоватьХранилище";
    НоваяСтрока.МетодПоиска = "ПЕРЕИМЕНОВАТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Новое наименование хранилища";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПереименоватьХранилище";
    НоваяСтрока.МетодПоиска = "ПЕРЕИМЕНОВАТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСодержимоеХранилища";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСОДЕРЖИМОЕХРАНИЛИЩА";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает список файлов и каталогов, находящихся в корне хранилища";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСодержимоеХранилища";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСОДЕРЖИМОЕХРАНИЛИЩА";
    НоваяСтрока.Параметр    = "--storageid";
    НоваяСтрока.Описание    = "Идентификатор хранилища";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСодержимоеХранилища";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСОДЕРЖИМОЕХРАНИЛИЩА";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Загружает файл в выбранное хранилище";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Наименование файла с расширением для сохранения";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--file";
    НоваяСтрока.Описание    = "Файл для загрузки";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--storageid";
    НоваяСтрока.Описание    = "Идентификатор хранилища для загрузки";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--rights";
    НоваяСтрока.Описание    = "Массив доступов по задачам, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьКаталогВХранилище";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬКАТАЛОГВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Создает пустой каталог в хранилище";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьКаталогВХранилище";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬКАТАЛОГВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--storageid";
    НоваяСтрока.Описание    = "Идентификатор хранилища";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьКаталогВХранилище";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬКАТАЛОГВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Имя каталога";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьКаталогВХранилище";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬКАТАЛОГВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьКаталог";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о каталоге";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьКаталог";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--folderid";
    НоваяСтрока.Описание    = "Идентификатор каталога";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьКаталог";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьПодкаталог";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬПОДКАТАЛОГ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Создает каталог внутри другого каталога";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьПодкаталог";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬПОДКАТАЛОГ";
    НоваяСтрока.Параметр    = "--folderid";
    НоваяСтрока.Описание    = "Идентификатор каталога родителя";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьПодкаталог";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬПОДКАТАЛОГ";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Наименование нового каталога";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьПодкаталог";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬПОДКАТАЛОГ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "КопироватьКаталог";
    НоваяСтрока.МетодПоиска = "КОПИРОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Копирует один каталог в другой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "КопироватьКаталог";
    НоваяСтрока.МетодПоиска = "КОПИРОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--folderid";
    НоваяСтрока.Описание    = "Идентификатор каталога родителя";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "КопироватьКаталог";
    НоваяСтрока.МетодПоиска = "КОПИРОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--tagetid";
    НоваяСтрока.Описание    = "ID каталога назначения";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "КопироватьКаталог";
    НоваяСтрока.МетодПоиска = "КОПИРОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьФайл";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет файл по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьФайл";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр    = "--fileid";
    НоваяСтрока.Описание    = "Идентификатор удаляемого файла";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьФайл";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьКаталог";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет каталог с подкаталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьКаталог";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--folderid";
    НоваяСтрока.Описание    = "Идентификатор удаляемого каталога";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьКаталог";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬКАТАЛОГ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьВнешнююСсылкуКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУКАТАЛОГА";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает внешнюю ссылку для доступа к каталогу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьВнешнююСсылкуКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУКАТАЛОГА";
    НоваяСтрока.Параметр    = "--folderid";
    НоваяСтрока.Описание    = "Идентификатор каталога";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьВнешнююСсылкуКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУКАТАЛОГА";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьДочерниеЭлементыКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬДОЧЕРНИЕЭЛЕМЕНТЫКАТАЛОГА";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает дочерние элементы каталога";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьДочерниеЭлементыКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬДОЧЕРНИЕЭЛЕМЕНТЫКАТАЛОГА";
    НоваяСтрока.Параметр    = "--folderid";
    НоваяСтрока.Описание    = "Идентификатор каталога";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьДочерниеЭлементыКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬДОЧЕРНИЕЭЛЕМЕНТЫКАТАЛОГА";
    НоваяСтрока.Параметр    = "--filter";
    НоваяСтрока.Описание    = "Отбор элементов (См. ПолучитьСтруктуруФильтраКаталога) (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьДочерниеЭлементыКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬДОЧЕРНИЕЭЛЕМЕНТЫКАТАЛОГА";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруФильтраКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАКАТАЛОГА";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Работа с диском и файлами";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей для фильтрации дочерних элементов каталога";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруФильтраКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАКАТАЛОГА";
    НоваяСтрока.Параметр    = "--empty";
    НоваяСтрока.Описание    = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания типов полей (необяз. по ум. - False)";
    НоваяСтрока.Область     = "Работа с диском и файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруФильтраКаталога";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАКАТАЛОГА";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Работа с диском и файлами";

    Возврат ТаблицаСостава;
КонецФункции

