
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("ПараметрСокр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСсылкуАвторизацииПриложения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬССЫЛКУАВТОРИЗАЦИИПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр     = "--domain";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Адрес битрикс вида portal.bitrix24.com";
    НоваяСтрока.Область      = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Формирует ссылку для авторизации через браузер";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСсылкуАвторизацииПриложения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬССЫЛКУАВТОРИЗАЦИИПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр     = "--clientid";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Client ID из настроек приложения";
    НоваяСтрока.Область      = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--clientid";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Client ID из настроек приложения";
    НоваяСтрока.Область      = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает токен по коду авторизации";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--clientsecret";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Client secret из настроек приложения";
    НоваяСтрока.Область      = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--code";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Code из авторизации через браузер";
    НоваяСтрока.Область      = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--clientid";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Client ID из настроек приложения";
    НоваяСтрока.Область      = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Обновляет токен по Refresh токену";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--clientsecret";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Client secret из настроек приложения";
    НоваяСтрока.Область      = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--refresh";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Refresh токен";
    НоваяСтрока.Область      = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СерверноеВремя";
    НоваяСтрока.МетодПоиска  = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает текущее серверное время";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СерверноеВремя";
    НоваяСтрока.МетодПоиска  = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьНовость";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Создает новую новость в ленте";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьНовость";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст новости";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьНовость";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--vision";
    НоваяСтрока.ПараметрСокр = "-v";
    НоваяСтрока.Описание     = "Массив или 1 получатель: UA все, SGn р. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьНовость";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--files";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Ключ > имя файла, значение > путь или двоичные данные (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьНовость";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Заголовок новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьНовость";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--important";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Помечает новость как важную (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьНовость";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Изменяет новость в ленте";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--postid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID новости";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст новости";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--vision";
    НоваяСтрока.ПараметрСокр = "-v";
    НоваяСтрока.Описание     = "Массив или 1 получатель: UA все, SGn р. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--files";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Ключ > имя файла, значение > путь или двоичные данные (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Заголовок новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьНовость";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Удаляет новость из ленты по выбранному ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьНовость";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--postid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID новости для удаления";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьНовость";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Возвращает список пользователей, просмотревших выбранное важное сообщение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр     = "--postid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID важной новости";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Получает нвости или одну новость с отобором по ID или доступности";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр     = "--postid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID важной новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр     = "--sel";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Отбор новостей по доступу: UA все, SGn раб. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьКомментарийНовости";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОММЕНТАРИЙНОВОСТИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Добавляет комментарий к новости";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьКомментарийНовости";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОММЕНТАРИЙНОВОСТИ";
    НоваяСтрока.Параметр     = "--postid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID новости";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьКомментарийНовости";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОММЕНТАРИЙНОВОСТИ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст комментария";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьКомментарийНовости";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОММЕНТАРИЙНОВОСТИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с живой лентой";
    НоваяСтрока.ОписаниеМетода   = "Добавляет новые группы или пользователей в получатели";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр     = "--postid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID новости";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр     = "--vision";
    НоваяСтрока.ПараметрСокр = "-v";
    НоваяСтрока.Описание     = "Массив или 1 получатель: UA все, SGn р. группа, Un пользователь, DRn отдел, Gn группа";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с живой лентой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает список задач (50 шт. за запрос максимум) с фильтром или без
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура отбора задач. См. ПолучитьСтруктуруФильтраЗадач (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр     = "--offset";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Отступ от начала списка для полчения задач > 50 шт. рекурсивно (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЗадач";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЗАДАЧ";
    НоваяСтрока.Параметр     = "--select";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Список полей задачи в ответе. Все невычисляемые по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Создает новую задачу по структуре полей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей задачи. См. ПолучитьСтруктуруЗадачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет существующую задачу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьФайлВЗадачу";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬФАЙЛВЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Прикрепляет файл к выбранной задаче";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьФайлВЗадачу";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬФАЙЛВЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьФайлВЗадачу";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬФАЙЛВЗАДАЧУ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID Файла";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьФайлВЗадачу";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬФАЙЛВЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Принимает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Отклоняет задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Завершает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Возвращает в работу задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Откладывает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Приостанавливает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска  = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Начинает выполнение задачи по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Начинает наблюдение за задачей по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска  = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Прекращает наблюдение за задчей по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска  = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска  = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска  = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Делегирует задачу на другого пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска  = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска  = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя исполнителя";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска  = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Добавляет задачу в список избранного";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска  = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет задачу из списка избранного";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска  = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска  = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИсториюЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИСТОРИЮЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает историю изменений задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИсториюЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИСТОРИЮЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИсториюЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИСТОРИЮЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПроверитьДоступКЗадаче";
    НоваяСтрока.МетодПоиска  = "ПРОВЕРИТЬДОСТУПКЗАДАЧЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Проверяет доступность задачи для пользователей
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПроверитьДоступКЗадаче";
    НоваяСтрока.МетодПоиска  = "ПРОВЕРИТЬДОСТУПКЗАДАЧЕ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПроверитьДоступКЗадаче";
    НоваяСтрока.МетодПоиска  = "ПРОВЕРИТЬДОСТУПКЗАДАЧЕ";
    НоваяСтрока.Параметр     = "--users";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователей для проверки доступа (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПроверитьДоступКЗадаче";
    НоваяСтрока.МетодПоиска  = "ПРОВЕРИТЬДОСТУПКЗАДАЧЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтключитьЗвукЗадачи";
    НоваяСтрока.МетодПоиска  = "ОТКЛЮЧИТЬЗВУКЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает режим Без звука для задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтключитьЗвукЗадачи";
    НоваяСтрока.МетодПоиска  = "ОТКЛЮЧИТЬЗВУКЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтключитьЗвукЗадачи";
    НоваяСтрока.МетодПоиска  = "ОТКЛЮЧИТЬЗВУКЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВключитьЗвукЗадачи";
    НоваяСтрока.МетодПоиска  = "ВКЛЮЧИТЬЗВУКЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Отключает режим Без звука для задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВключитьЗвукЗадачи";
    НоваяСтрока.МетодПоиска  = "ВКЛЮЧИТЬЗВУКЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВключитьЗвукЗадачи";
    НоваяСтрока.МетодПоиска  = "ВКЛЮЧИТЬЗВУКЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Создает зависимость одной задачи от другой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--taskfrom";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи источника связи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--taskto";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID задачи приемника связи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--linktype";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Тип связи: 0 старт>старт, 1 старт>финиш, 2 финиш>старт, 3 финиш>финиш";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет зависимость одной задачи от другой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--taskfrom";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи источника связи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--taskto";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID задачи приемника связи";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--linktype";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Тип связи: 0 старт>старт, 1 старт>финиш, 2 финиш>старт, 3 финиш>финиш";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЗависимостьЗадач";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАВИСИМОСТЬЗАДАЧ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПланЗадачНаДень";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПЛАНЗАДАЧНАДЕНЬ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает план задач на день текущего пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПланЗадачНаДень";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПЛАНЗАДАЧНАДЕНЬ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру с описанем полей для создания задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраЗадач";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАЗАДАЧ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с задачами";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей для фильтрации задач в методе ПолучитьСписокЗадач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраЗадач";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАЗАДАЧ";
    НоваяСтрока.Параметр     = "--map";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Истина > возвращает поля фильтра как соответствие (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с задачами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПользовательскихПолейЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПОЛЬЗОВАТЕЛЬСКИХПОЛЕЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";
    НоваяСтрока.ОписаниеМетода   = "Получает список пользовательских полей для задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПользовательскихПолейЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПОЛЬЗОВАТЕЛЬСКИХПОЛЕЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";
    НоваяСтрока.ОписаниеМетода   = "Добавляет новое пользовательское поле для добавления в задачу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--type";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Тип поля: string, double, date, boolean";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--fieldname";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Текстовый идентификатор (наименование) поля";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--externalid";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Внешний текстовый идентификатор поля (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Заголовок поля (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--label";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Подпись в форме. Ключ: en или ru, Значение: Текст подписи (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";
    НоваяСтрока.ОписаниеМетода   = "Изменяет пользовательское поле задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--fieldid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID поля для изменения";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--externalid";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Внешний текстовый идентификатор поля (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Заголовок поля (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--label";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Подпись в форме. Ключ: en или ru, Значение: Текст подписи (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о пользовательском поле задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--fieldid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID поля для получения";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";
    НоваяСтрока.ОписаниеМетода   = "Удаляет пользовательское поле задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--fieldid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID поля для удаления";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьПользовательскоеПолеЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬПОЛЬЗОВАТЕЛЬСКОЕПОЛЕЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с пользовательскими полями задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чеклистами задач";
    НоваяСтрока.ОписаниеМетода   = "Добавляет новый элемент чеклиста задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст (заголовок) пункта чек листа";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--complete";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Отметить пункт как выполненный (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чеклистами задач";
    НоваяСтрока.ОписаниеМетода   = "Изменяет текст элемента чеклиста задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--element";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID элемента чеклиста";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст (заголовок) пункта чек листа";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чеклистами задач";
    НоваяСтрока.ОписаниеМетода   = "Удаляет элемент из чеклиста задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--element";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID элемента для удаления";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЧеклистЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЧЕКЛИСТЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чеклистами задач";
    НоваяСтрока.ОписаниеМетода   = "Получает список элементов чеклиста задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЧеклистЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЧЕКЛИСТЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЧеклистЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЧЕКЛИСТЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чеклистами задач";
    НоваяСтрока.ОписаниеМетода   = "Получить элемент чеклиста задачи по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--element";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID элемента для получения";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВыполнитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чеклистами задач";
    НоваяСтрока.ОписаниеМетода   = "Помечает элемент чеклиста задачи как выполненный";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВыполнитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВыполнитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--element";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID элемента";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВыполнитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВозобновитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ВОЗОБНОВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чеклистами задач";
    НоваяСтрока.ОписаниеМетода   = "Снимает пометку элемента как выполненного";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВозобновитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ВОЗОБНОВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВозобновитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ВОЗОБНОВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--element";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID элемента";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВозобновитьЭлементЧеклистаЗадачи";
    НоваяСтрока.МетодПоиска  = "ВОЗОБНОВИТЬЭЛЕМЕНТЧЕКЛИСТАЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чеклистами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокКомментариевЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Полчает список комментариев пользователей к задаче по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокКомментариевЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокКомментариевЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьКомменатрийЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОММЕНАТРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о комментарии задачи по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьКомменатрийЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОММЕНАТРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьКомменатрийЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОММЕНАТРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--comment";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID комментария";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьКомменатрийЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОММЕНАТРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Создает комментарий к задаче";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст комментария";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Изменяет текст комментария задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--comment";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID комментария";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст комментария";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Удаляет существующий комментарий задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--comment";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID удаляемого комментария";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКомментарийЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОММЕНТАРИЙЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокРезультатов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКРЕЗУЛЬТАТОВ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Получает список результатов задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокРезультатов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКРЕЗУЛЬТАТОВ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокРезультатов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКРЕЗУЛЬТАТОВ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьРезультатИзКомментария";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬРЕЗУЛЬТАТИЗКОММЕНТАРИЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Создает результат задачи из комментария";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьРезультатИзКомментария";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬРЕЗУЛЬТАТИЗКОММЕНТАРИЯ";
    НоваяСтрока.Параметр     = "--comment";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID комментария";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьРезультатИзКомментария";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬРЕЗУЛЬТАТИЗКОММЕНТАРИЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьРезультатИзКомментария";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬРЕЗУЛЬТАТИЗКОММЕНТАРИЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Удаляет ранее созданный результат из комментария";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьРезультатИзКомментария";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬРЕЗУЛЬТАТИЗКОММЕНТАРИЯ";
    НоваяСтрока.Параметр     = "--comment";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID комментария";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьРезультатИзКомментария";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬРЕЗУЛЬТАТИЗКОММЕНТАРИЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруКомментария";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУКОММЕНТАРИЯ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с комментариями и результатами задач";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру полей комментария";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Канбан";
    НоваяСтрока.ОписаниеМетода   = "Добавляет стабию канбана или Моего плана";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Наименование новой стадии";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--color";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "HEX цвета новой стадии (необяз. по ум. - FFD800)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--prevstage";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID стадии, после которой необходимо вставить новую (в начало по ум.) (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--entityid";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID группы или пользователя владельца канбан. Свой по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--admin";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Позволяет добавлять стадии без проверки прав (для администраторов) (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Канбан";
    НоваяСтрока.ОписаниеМетода   = "Изменяет свойства существующей стадии канбана или Моего плана";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Новое наименование стадии";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--stage";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "ID стадии для изменения";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--color";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "HEX нового цвета стадии (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--prevstage";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID стадии, после которой необходимо вставить выбранную (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--admin";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Позволяет добавлять стадии без проверки прав (для администраторов) (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Канбан";
    НоваяСтрока.ОписаниеМетода   = "Удаляет стадию канбана или Моего плана, при условии, что в ней нет задач";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--stage";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "ID стадии для удаления";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--admin";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Позволяет добавлять стадии без проверки прав (для администраторов) (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтадииКанбана";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАДИИКАНБАНА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Канбан";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о стадиях Канбана или Моего плана";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтадииКанбана";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАДИИКАНБАНА";
    НоваяСтрока.Параметр     = "--entityid";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID группы или пользователя владельца канбан. Свой по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтадииКанбана";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАДИИКАНБАНА";
    НоваяСтрока.Параметр     = "--admin";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Позволяет получать стадии без проверки прав (для администраторов) (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтадииКанбана";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАДИИКАНБАНА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПеренестиЗадачуВСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ПЕРЕНЕСТИЗАДАЧУВСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Канбан";
    НоваяСтрока.ОписаниеМетода   = "Переносит задачу в выбранную стадию канбана";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПеренестиЗадачуВСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ПЕРЕНЕСТИЗАДАЧУВСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи для переноса";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПеренестиЗадачуВСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ПЕРЕНЕСТИЗАДАЧУВСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--stage";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "ID стадии";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПеренестиЗадачуВСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ПЕРЕНЕСТИЗАДАЧУВСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--before";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "ID задачи, перед которой надо поставить выбранную (если не заполнено После) (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПеренестиЗадачуВСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ПЕРЕНЕСТИЗАДАЧУВСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--after";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "ID задачи, после которой надо поставить выбранную (если не заполнено Перед) (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПеренестиЗадачуВСтадиюКанбана";
    НоваяСтрока.МетодПоиска  = "ПЕРЕНЕСТИЗАДАЧУВСТАДИЮКАНБАНА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Канбан";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Добавляет информацию о затраченном времени пользователя в задачу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи для добавления затрат";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--amount";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Затраченное время в секундах";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя, затратившего время (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст комментария трудозатраты (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--date";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Дата установки трудозатрат (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Удаляет запись о трудозатратах из задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи для добавления затрат";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--record";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "ID записи о трудозатратах";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокТрудозатратЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКТРУДОЗАТРАТЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Получает список записей о трудозатратах задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокТрудозатратЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКТРУДОЗАТРАТЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокТрудозатратЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКТРУДОЗАТРАТЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о записи трудозатрат задачи по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--record";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "ID записи о трудозатратах";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Изменяет данные записи о трудозатратах задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--task";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID задачи";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--record";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "ID записи о трудозатратах";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--amount";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Затраченное время в секундах";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст комментария трудозатраты (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--date";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Дата установки трудозатрат (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьТрудозатратыЗадачи";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТРУДОЗАТРАТЫЗАДАЧИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьУчетВремени";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Начинает учет времени пользователя
    |
    |    Дата указывается в формате ISO 8601:
    |    ""2024-04-07""
    |    ""2024-04-07T13:34:42+00:00"" 
    |    ""2024-04-07T13:34:42Z""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьУчетВремени";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--userid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для учета. Текущий по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьУчетВремени";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--time";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Время начала учета. Дата должна совпадать с текущей. Текущее время по ум. (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьУчетВремени";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--report";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Причина изменения. Обязателен при указании Время и отключенном свободном графике (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НачатьУчетВремени";
    НоваяСтрока.МетодПоиска  = "НАЧАТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗавершитьУчетВремени";
    НоваяСтрока.МетодПоиска  = "ЗАВЕРШИТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Завершает учет времени пользователя
    |
    |    Дата указывается в формате ISO 8601:
    |    ""2024-04-07""
    |    ""2024-04-07T13:34:42+00:00"" 
    |    ""2024-04-07T13:34:42Z""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗавершитьУчетВремени";
    НоваяСтрока.МетодПоиска  = "ЗАВЕРШИТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--userid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для учета. Текущий по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗавершитьУчетВремени";
    НоваяСтрока.МетодПоиска  = "ЗАВЕРШИТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--time";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Время заверш. учета. Дата должна совпадать с текущей. Текущее время по ум. (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗавершитьУчетВремени";
    НоваяСтрока.МетодПоиска  = "ЗАВЕРШИТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--report";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Причина изменения. Обязателен при указании Время и отключенном свободном графике (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗавершитьУчетВремени";
    НоваяСтрока.МетодПоиска  = "ЗАВЕРШИТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПриостановитьУчетВремени";
    НоваяСтрока.МетодПоиска  = "ПРИОСТАНОВИТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Приостанавливает учет времени пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПриостановитьУчетВремени";
    НоваяСтрока.МетодПоиска  = "ПРИОСТАНОВИТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--userid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для учета. Текущий по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПриостановитьУчетВремени";
    НоваяСтрока.МетодПоиска  = "ПРИОСТАНОВИТЬУЧЕТВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтатусУчетаВремени";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАТУСУЧЕТАВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Получает статус учета времени пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтатусУчетаВремени";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАТУСУЧЕТАВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--userid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для учета. Текущий по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтатусУчетаВремени";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАТУСУЧЕТАВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьНастройкиУчетаВремени";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНАСТРОЙКИУЧЕТАВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Учет рабочего времени";
    НоваяСтрока.ОписаниеМетода   = "Получает настройки учета времени пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьНастройкиУчетаВремени";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНАСТРОЙКИУЧЕТАВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--userid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для учета. Текущий по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьНастройкиУчетаВремени";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНАСТРОЙКИУЧЕТАВРЕМЕНИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Учет рабочего времени";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокХранилищ";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКХРАНИЛИЩ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с хранилищами";
    НоваяСтрока.ОписаниеМетода   = "Получает список доступных хранилищ файлов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокХранилищ";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКХРАНИЛИЩ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьХранилищеПриложения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬХРАНИЛИЩЕПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с хранилищами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о хранилище с которым может работать приложение для хранения своих данных";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьХранилищеПриложения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬХРАНИЛИЩЕПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьХранилище";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с хранилищами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о хранилище по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьХранилище";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--storageid";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Идентификатор хранилища";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьХранилище";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьХранилище";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с хранилищами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет имя хранилища (только для хранилища приложения см. ПолучитьСписокХранилищПриложения)";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьХранилище";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--storageid";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Идентификатор хранилища";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьХранилище";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Новое наименование хранилища";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьХранилище";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСодержимоеХранилища";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОДЕРЖИМОЕХРАНИЛИЩА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с хранилищами";
    НоваяСтрока.ОписаниеМетода   = "Получает список файлов и каталогов, находящихся в корне хранилища";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСодержимоеХранилища";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОДЕРЖИМОЕХРАНИЛИЩА";
    НоваяСтрока.Параметр     = "--storageid";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Идентификатор хранилища";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСодержимоеХранилища";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОДЕРЖИМОЕХРАНИЛИЩА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьКаталогВХранилище";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКАТАЛОГВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с хранилищами";
    НоваяСтрока.ОписаниеМетода   = "Создает пустой каталог в хранилище";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьКаталогВХранилище";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКАТАЛОГВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--storageid";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Идентификатор хранилища";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьКаталогВХранилище";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКАТАЛОГВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя каталога";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьКаталогВХранилище";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКАТАЛОГВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с хранилищами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОКаталоге";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОКАТАЛОГЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о каталоге";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОКаталоге";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОКАТАЛОГЕ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОКаталоге";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОКАТАЛОГЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодкаталог";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДКАТАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Создает каталог внутри другого каталога";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодкаталог";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДКАТАЛОГ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога родителя";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодкаталог";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДКАТАЛОГ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Наименование нового каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодкаталог";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДКАТАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СкопироватьКаталог";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Копирует один каталог в другой";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СкопироватьКаталог";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СкопироватьКаталог";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--tagetid";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID каталога назначения";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СкопироватьКаталог";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереместитьКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕМЕСТИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Перемещает один каталог внутрь другого";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереместитьКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕМЕСТИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереместитьКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕМЕСТИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--tagetid";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID каталога назначения";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереместитьКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕМЕСТИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКаталог";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет каталог с подкаталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКаталог";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор удаляемого каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКаталог";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьВнешнююСсылкуКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУКАТАЛОГА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Получает внешнюю ссылку для доступа к каталогу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьВнешнююСсылкуКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУКАТАЛОГА";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьВнешнююСсылкуКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУКАТАЛОГА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьДочерниеЭлементыКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДОЧЕРНИЕЭЛЕМЕНТЫКАТАЛОГА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Получает дочерние элементы каталога";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьДочерниеЭлементыКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДОЧЕРНИЕЭЛЕМЕНТЫКАТАЛОГА";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьДочерниеЭлементыКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДОЧЕРНИЕЭЛЕМЕНТЫКАТАЛОГА";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Отбор элементов. См. ПолучитьСтруктуруФильтраКаталога (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьДочерниеЭлементыКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДОЧЕРНИЕЭЛЕМЕНТЫКАТАЛОГА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПоместитьКаталогВКорзину";
    НоваяСтрока.МетодПоиска  = "ПОМЕСТИТЬКАТАЛОГВКОРЗИНУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Перемещает каталог в корзину удаляемых файлов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПоместитьКаталогВКорзину";
    НоваяСтрока.МетодПоиска  = "ПОМЕСТИТЬКАТАЛОГВКОРЗИНУ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПоместитьКаталогВКорзину";
    НоваяСтрока.МетодПоиска  = "ПОМЕСТИТЬКАТАЛОГВКОРЗИНУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВосстановитьКаталог";
    НоваяСтрока.МетодПоиска  = "ВОССТАНОВИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Восстанавливает каталог из корзины";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВосстановитьКаталог";
    НоваяСтрока.МетодПоиска  = "ВОССТАНОВИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВосстановитьКаталог";
    НоваяСтрока.МетодПоиска  = "ВОССТАНОВИТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет имя каталога";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Новое наименование каталога";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬКАТАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАКАТАЛОГА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с каталогами";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей для фильтрации дочерних элементов каталога";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАКАТАЛОГА";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания типов полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраКаталога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАКАТАЛОГА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Загружает файл в выбранное хранилище";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Наименование файла с расширением для сохранения";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--file";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Файл для загрузки";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--storageid";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Идентификатор хранилища для загрузки";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--rights";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Массив доступов по задачам, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВХранилище";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВХРАНИЛИЩЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Загружает переданный файл в каталог";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Наименование файла с расширением для сохранения";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--file";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Файл для загрузки";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Идентификатор каталога для загрузки";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ЗагрузитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОФайле";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОФАЙЛЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о файле по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОФайле";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОФАЙЛЕ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОФайле";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОФАЙЛЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьФайл";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет файл по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьФайл";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор удаляемого файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьФайл";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьВнешнююСсылкуФайла";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУФАЙЛА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает внешнюю ссылку для доступа к файлу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьВнешнююСсылкуФайла";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУФАЙЛА";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьВнешнююСсылкуФайла";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬВНЕШНЮЮССЫЛКУФАЙЛА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПоместитьФайлВКорзину";
    НоваяСтрока.МетодПоиска  = "ПОМЕСТИТЬФАЙЛВКОРЗИНУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Перемещает файл в корзину удаляемых файлов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПоместитьФайлВКорзину";
    НоваяСтрока.МетодПоиска  = "ПОМЕСТИТЬФАЙЛВКОРЗИНУ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПоместитьФайлВКорзину";
    НоваяСтрока.МетодПоиска  = "ПОМЕСТИТЬФАЙЛВКОРЗИНУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВосстановитьФайл";
    НоваяСтрока.МетодПоиска  = "ВОССТАНОВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Восстанавливает файл из корзины";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВосстановитьФайл";
    НоваяСтрока.МетодПоиска  = "ВОССТАНОВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВосстановитьФайл";
    НоваяСтрока.МетодПоиска  = "ВОССТАНОВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СкопироватьФайл";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Копирует файл из одного расположения в другое";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СкопироватьФайл";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID файла для копирования";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СкопироватьФайл";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID каталога размещения копии";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СкопироватьФайл";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереместитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕМЕСТИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Перемещает файл из одного расположения в другое";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереместитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕМЕСТИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID файла для перемещения";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереместитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕМЕСТИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--folderid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID каталога нового размещения";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереместитьФайлВКаталог";
    НоваяСтрока.МетодПоиска  = "ПЕРЕМЕСТИТЬФАЙЛВКАТАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьФайл";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет имя существующего файла";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьФайл";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Идентификатор файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьФайл";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Новое наименование каталога";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПереименоватьФайл";
    НоваяСтрока.МетодПоиска  = "ПЕРЕИМЕНОВАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЧат";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЧАТ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Создает новый чат на основе структуры полей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЧат";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЧАТ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей чата. См. ПолучитьСтруктуруЧата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЧат";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЧАТ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПользователейЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПОЛЬЗОВАТЕЛЕЙЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Получает список пользователей чата по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПользователейЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПОЛЬЗОВАТЕЛЕЙЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПользователейЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПОЛЬЗОВАТЕЛЕЙЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПокинутьЧат";
    НоваяСтрока.МетодПоиска  = "ПОКИНУТЬЧАТ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Исключает текущего пользователя из чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПокинутьЧат";
    НоваяСтрока.МетодПоиска  = "ПОКИНУТЬЧАТ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПокинутьЧат";
    НоваяСтрока.МетодПоиска  = "ПОКИНУТЬЧАТ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о пользователях для диалога
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--users";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя или нескольких пользователей";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользователейВЧат";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЕЙВЧАТ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Добавляет пользователей в чат по массиву ID
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользователейВЧат";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЕЙВЧАТ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользователейВЧат";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЕЙВЧАТ";
    НоваяСтрока.Параметр     = "--users";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователей для добавления";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользователейВЧат";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЕЙВЧАТ";
    НоваяСтрока.Параметр     = "--hide";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Скрыть старые сообщения от новых пользователей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ДобавитьПользователейВЧат";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬПОЛЬЗОВАТЕЛЕЙВЧАТ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИсключитьПользователяИзЧата";
    НоваяСтрока.МетодПоиска  = "ИСКЛЮЧИТЬПОЛЬЗОВАТЕЛЯИЗЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Исключает выбранного пользователя из чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИсключитьПользователяИзЧата";
    НоваяСтрока.МетодПоиска  = "ИСКЛЮЧИТЬПОЛЬЗОВАТЕЛЯИЗЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИсключитьПользователяИзЧата";
    НоваяСтрока.МетодПоиска  = "ИСКЛЮЧИТЬПОЛЬЗОВАТЕЛЯИЗЧАТА";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИсключитьПользователяИзЧата";
    НоваяСтрока.МетодПоиска  = "ИСКЛЮЧИТЬПОЛЬЗОВАТЕЛЯИЗЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЗаголовокЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЗАГОЛОВОКЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет текст заголовка чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЗаголовокЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЗАГОЛОВОКЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЗаголовокЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЗАГОЛОВОКЧАТА";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Новый текст заголовка";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЗаголовокЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЗАГОЛОВОКЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЦветЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЦВЕТЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет цвет чата для мобильного приложения";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЦветЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЦВЕТЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЦветЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЦВЕТЧАТА";
    НоваяСтрока.Параметр     = "--color";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Новый цвет чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЦветЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЦВЕТЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКартинкуЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКАРТИНКУЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает новую картинку чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКартинкуЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКАРТИНКУЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКартинкуЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКАРТИНКУЧАТА";
    НоваяСтрока.Параметр     = "--picture";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Данные файла картинки";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКартинкуЧата";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКАРТИНКУЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СменитьВладельцаЧата";
    НоваяСтрока.МетодПоиска  = "СМЕНИТЬВЛАДЕЛЬЦАЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет пользователя владельца чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СменитьВладельцаЧата";
    НоваяСтрока.МетодПоиска  = "СМЕНИТЬВЛАДЕЛЬЦАЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СменитьВладельцаЧата";
    НоваяСтрока.МетодПоиска  = "СМЕНИТЬВЛАДЕЛЬЦАЧАТА";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СменитьВладельцаЧата";
    НоваяСтрока.МетодПоиска  = "СМЕНИТЬВЛАДЕЛЬЦАЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтключитьУведомленияЧата";
    НоваяСтрока.МетодПоиска  = "ОТКЛЮЧИТЬУВЕДОМЛЕНИЯЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Отключает уведомлений чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтключитьУведомленияЧата";
    НоваяСтрока.МетодПоиска  = "ОТКЛЮЧИТЬУВЕДОМЛЕНИЯЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтключитьУведомленияЧата";
    НоваяСтрока.МетодПоиска  = "ОТКЛЮЧИТЬУВЕДОМЛЕНИЯЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВключитьУведомленияЧата";
    НоваяСтрока.МетодПоиска  = "ВКЛЮЧИТЬУВЕДОМЛЕНИЯЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Включает уведомления в чате";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВключитьУведомленияЧата";
    НоваяСтрока.МетодПоиска  = "ВКЛЮЧИТЬУВЕДОМЛЕНИЯЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ВключитьУведомленияЧата";
    НоваяСтрока.МетодПоиска  = "ВКЛЮЧИТЬУВЕДОМЛЕНИЯЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСообщенийЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСООБЩЕНИЙЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Получает список из 20 сообщений чата или диалога, в зависимости от указания IDПервого и IDПоследнего";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСообщенийЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСООБЩЕНИЙЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата (chatXXX) или пользователя (XXX) для диалога";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСообщенийЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСООБЩЕНИЙЧАТА";
    НоваяСтрока.Параметр     = "--last";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "ID последнего загруженного сообщения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСообщенийЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСООБЩЕНИЙЧАТА";
    НоваяСтрока.Параметр     = "--first";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID первого загруженного сообщения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСообщенийЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСООБЩЕНИЙЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьДиалог";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДИАЛОГ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о диалоге по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьДиалог";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДИАЛОГ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата (chatXXX) или пользователя (XXX) для диалога";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьДиалог";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДИАЛОГ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПользователейДиалога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПОЛЬЗОВАТЕЛЕЙДИАЛОГА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Получает список участников далога";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПользователейДиалога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПОЛЬЗОВАТЕЛЕЙДИАЛОГА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата (chatXXX) или пользователя (XXX) для диалога";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокПользователейДиалога";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКПОЛЬЗОВАТЕЛЕЙДИАЛОГА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьУведомлениеОВводе";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬУВЕДОМЛЕНИЕОВВОДЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Отправляет в чат статус Вам пишут...";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьУведомлениеОВводе";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬУВЕДОМЛЕНИЕОВВОДЕ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата (chatXXX) или пользователя (XXX) для диалога";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьУведомлениеОВводе";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬУВЕДОМЛЕНИЕОВВОДЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Получает статус (онлайн) текущего пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает статус (онлайн) текущего пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--status";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Статус пользователя: online, dnd, away";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПрочитатьВсе";
    НоваяСтрока.МетодПоиска  = "ПРОЧИТАТЬВСЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Отмечает все сообщения во всех доступных чатах как прочитанные";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПрочитатьВсе";
    НоваяСтрока.МетодПоиска  = "ПРОЧИТАТЬВСЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьКаталогФайловЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКАТАЛОГФАЙЛОВЧАТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Получает каталог для хранения фйлов чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьКаталогФайловЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКАТАЛОГФАЙЛОВЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьКаталогФайловЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКАТАЛОГФАЙЛОВЧАТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУЧАТА";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания типов полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с чатами и диалогами";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру полей чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Отправляет сообщение в диалог
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата (chatXXX) или пользователя (XXX) для диалога";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст сообщения";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--blocks";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "Массив блоков вложений (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСообщение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Изменяет сообщение в диалоге
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСообщение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "ID сообщения для изменения";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСообщение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Новый текст сообщения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСообщение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--blocks";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "Новый массив блоков вложений (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСообщение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьРеакциюНаСообщение";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬРЕАКЦИЮНАСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает или снимает реакцию на сообщение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьРеакциюНаСообщение";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬРЕАКЦИЮНАСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "ID сообщения";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьРеакциюНаСообщение";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬРЕАКЦИЮНАСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСообщение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Удаляет сообщение в диалоге";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСообщение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "ID сообщения для удаления";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСообщение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Отправляет файл диска в чат по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--fileid";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID файла, загруженного при помощи ЗагрузитьФайлВКаталог";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--description";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Описание файла (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтметитьСообщениеКакПрочитанное";
    НоваяСтрока.МетодПоиска  = "ОТМЕТИТЬСООБЩЕНИЕКАКПРОЧИТАННОЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Отмечает выбранное сообщение и все сообщения до него как прочитанные";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтметитьСообщениеКакПрочитанное";
    НоваяСтрока.МетодПоиска  = "ОТМЕТИТЬСООБЩЕНИЕКАКПРОЧИТАННОЕ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата (chatXXX) или пользователя (XXX) для диалога";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтметитьСообщениеКакПрочитанное";
    НоваяСтрока.МетодПоиска  = "ОТМЕТИТЬСООБЩЕНИЕКАКПРОЧИТАННОЕ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "ID последнего прочитанного сообщения";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтметитьСообщениеКакПрочитанное";
    НоваяСтрока.МетодПоиска  = "ОТМЕТИТЬСООБЩЕНИЕКАКПРОЧИТАННОЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтметитьСообщениеКакНепрочитанное";
    НоваяСтрока.МетодПоиска  = "ОТМЕТИТЬСООБЩЕНИЕКАКНЕПРОЧИТАННОЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Отмечает выбранное сообщение и все сообщения после него как непрочитанные";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтметитьСообщениеКакНепрочитанное";
    НоваяСтрока.МетодПоиска  = "ОТМЕТИТЬСООБЩЕНИЕКАКНЕПРОЧИТАННОЕ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата (chatXXX) или пользователя (XXX) для диалога";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтметитьСообщениеКакНепрочитанное";
    НоваяСтрока.МетодПоиска  = "ОТМЕТИТЬСООБЩЕНИЕКАКНЕПРОЧИТАННОЕ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "ID послднего непрочитанного сообщения";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ОтметитьСообщениеКакНепрочитанное";
    НоваяСтрока.МетодПоиска  = "ОТМЕТИТЬСООБЩЕНИЕКАКНЕПРОЧИТАННОЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьБлокКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬБЛОККАРТИНКИ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Наименование картинки";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Формирует картинку для отправки в функции ОтправитьСообщение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьБлокКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬБЛОККАРТИНКИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL картинки для отправки";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьБлокФайла";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬБЛОКФАЙЛА";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Наименование картинки";
    НоваяСтрока.Область      = "Работа с сообщениями";
    НоваяСтрока.ОписаниеМетода   = "Формирует блок файла для отправки в функции ОтправитьСообщение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьБлокФайла";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬБЛОКФАЙЛА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL файла для отправки";
    НоваяСтрока.Область      = "Работа с сообщениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПерсональноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПЕРСОНАЛЬНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с уведомлениями";
    НоваяСтрока.ОписаниеМетода   = "Создает персональное уведомление пользователю
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПерсональноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПЕРСОНАЛЬНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для отправки уведомления";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПерсональноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПЕРСОНАЛЬНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст уведомления";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПерсональноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПЕРСОНАЛЬНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--tag";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Тег уникальности Если уже существет, то другие увед. будут удалены (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПерсональноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПЕРСОНАЛЬНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--blocks";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "Массив блоков вложений (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПерсональноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПЕРСОНАЛЬНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСистемноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСИСТЕМНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с уведомлениями";
    НоваяСтрока.ОписаниеМетода   = "Создает системное уведомление пользователю
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСистемноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСИСТЕМНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для отправки уведомления";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСистемноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСИСТЕМНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст уведомления";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСистемноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСИСТЕМНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--tag";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Тег уникальности Если уже существет, то другие увед. будут удалены (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСистемноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСИСТЕМНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--blocks";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "Массив блоков вложений (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСистемноеУведомление";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСИСТЕМНОЕУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьУведомление";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с уведомлениями";
    НоваяСтрока.ОписаниеМетода   = "Удаляет уведомление по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьУведомление";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--notif";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "ID уведомления для удаления";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьУведомление";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с уведомлениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодразделение";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление подразделениями";
    НоваяСтрока.ОписаниеМетода   = "Создает новое подразделение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодразделение";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Наименование подразделения";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодразделение";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--parentid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID родительского подразделения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодразделение";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--headid";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "ID руководителя подразделения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПодразделение";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПодразделение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление подразделениями";
    НоваяСтрока.ОписаниеМетода   = "Изменяет существующее подразделение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПодразделение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--depid";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "ID подразделения";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПодразделение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Наименование подразделения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПодразделение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--parentid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "ID родительского подразделения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПодразделение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--headid";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "ID руководителя подразделения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПодразделение";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПодразделения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОДРАЗДЕЛЕНИЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление подразделениями";
    НоваяСтрока.ОписаниеМетода   = "Получает список подразделений по ID или фильтру";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПодразделения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОДРАЗДЕЛЕНИЯ";
    НоваяСтрока.Параметр     = "--depid";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Выбор по ID подразделения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПодразделения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОДРАЗДЕЛЕНИЯ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Фильтр по наименованию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПодразделения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОДРАЗДЕЛЕНИЯ";
    НоваяСтрока.Параметр     = "--parentid";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Фильтр по родителю (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПодразделения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОДРАЗДЕЛЕНИЯ";
    НоваяСтрока.Параметр     = "--headid";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Фильтр по руководителю (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПодразделения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОДРАЗДЕЛЕНИЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьПодразделение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление подразделениями";
    НоваяСтрока.ОписаниеМетода   = "Удаляет подразделение по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьПодразделение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--depid";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "ID подразделения для удаления";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьПодразделение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬПОДРАЗДЕЛЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление подразделениями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТекущегоПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТЕКУЩЕГОПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление пользователями";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о текущем пользователе";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьТекущегоПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТЕКУЩЕГОПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление пользователями";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о пользователе по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--userid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для получения";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПользователя";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление пользователями";
    НоваяСтрока.ОписаниеМетода   = "Создает нового пользователя по структуре полей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПользователя";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Данные пользователя. См. ПолучитьСтурктуруПользователя";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьПользователя";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользователя";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление пользователями";
    НоваяСтрока.ОписаниеМетода   = "Изменяет данные пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользователя";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--userid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для изменения";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользователя";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Данные пользователя. См. ПолучитьСтурктуруПользователя";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьПользователя";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление пользователями";
    НоваяСтрока.ОписаниеМетода   = "Активирует или деактивирует (увольняет) выбранного пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--userid";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя для изменения";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--fire";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Истина > Деактивация, Ложь > Активация (необяз. по ум. - True)";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСтатусПользователя";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСТАТУСПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НайтиПользователей";
    НоваяСтрока.МетодПоиска  = "НАЙТИПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление пользователями";
    НоваяСтрока.ОписаниеМетода   = "Получает список пользователей по заданному фильтру";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НайтиПользователей";
    НоваяСтрока.МетодПоиска  = "НАЙТИПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Фильтр. См. ПолучитьСтруктуруФильтраПользователей";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "НайтиПользователей";
    НоваяСтрока.МетодПоиска  = "НАЙТИПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтурктуруПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТУРКТУРУПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Управление пользователями";
    НоваяСтрока.ОписаниеМетода   = "Получает структурау полей для создания или изменения пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтурктуруПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТУРКТУРУПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление пользователями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Управление пользователями";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей для фильтрации пользователей в методе НайтиПользователей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЛид";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЛИД";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с лидами";
    НоваяСтрока.ОписаниеМетода   = "Создает новый лид по структуре полей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЛид";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЛИД";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей лида. См. ПолучитьСтруктуруЛида";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьЛид";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬЛИД";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЛид";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЛИД";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с лидами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет лид по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЛид";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЛИД";
    НоваяСтрока.Параметр     = "--lead";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "ID лида";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьЛид";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЛИД";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЛид";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЛИД";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с лидами";
    НоваяСтрока.ОписаниеМетода   = "Получает лид по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЛид";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЛИД";
    НоваяСтрока.Параметр     = "--lead";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "ID лида";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЛид";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЛИД";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЛидов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЛИДОВ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с лидами";
    НоваяСтрока.ОписаниеМетода   = "Получает список лидов (50 шт. за запрос максимум) с фильтром или без";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЛидов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЛИДОВ";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура отбора лидов. См. ПолучитьСтруктуруФильтраЛидов (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЛидов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЛИДОВ";
    НоваяСтрока.Параметр     = "--offset";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Отступ от начала списка для получения лидов > 50 шт. рекурсивно (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокЛидов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКЛИДОВ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЛид";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЛИД";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с лидами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет существующий лид";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЛид";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЛИД";
    НоваяСтрока.Параметр     = "--lead";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "ID лида";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЛид";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЛИД";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей лида";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьЛид";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬЛИД";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруЛида";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУЛИДА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с лидами";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру с описанием полей для создания лида";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруЛида";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУЛИДА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с лидами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраЛидов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАЛИДОВ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с лидами";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей для фильтрации лидов в методе ПолучитьСписокЛидов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСделку";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа со сделками";
    НоваяСтрока.ОписаниеМетода   = "Создает новую сделку по структуре полей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСделку";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей сделки. См. ПолучитьСтруктуруСделки";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСделку";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСделку";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа со сделками";
    НоваяСтрока.ОписаниеМетода   = "Удаляет сделку по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСделку";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--deal";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "ID сделки";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСделку";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСделку";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа со сделками";
    НоваяСтрока.ОписаниеМетода   = "Получает сделку по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСделку";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--deal";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "ID сделки";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСделку";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСделок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСДЕЛОК";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа со сделками";
    НоваяСтрока.ОписаниеМетода   = "Получает список сделок (50 шт. за запрос максимум) с фильтром или без";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСделок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСДЕЛОК";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура отбора сделок. См. ПолучитьСтруктуруФильтраСделок (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСделок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСДЕЛОК";
    НоваяСтрока.Параметр     = "--offset";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Отступ от начала списка для получения сделок > 50 шт. рекурсивно (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокСделок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКСДЕЛОК";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСделку";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа со сделками";
    НоваяСтрока.ОписаниеМетода   = "Изменяет существующую сделку";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСделку";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--deal";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "ID сделки";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСделку";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей сделки";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСделку";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСДЕЛКУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСделки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСДЕЛКИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа со сделками";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру с описанием полей для создания сделки";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСделки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСДЕЛКИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа со сделками";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраСделок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАСДЕЛОК";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа со сделками";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей для фильтрации сделок в методе ПолучитьСписокСделок";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Получает список календарей указанного владельца";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--owner";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "ID владельца календаря";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--type";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Тип календаря: user, group, company_calendar, location и др.";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСписокКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьКалендарь";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Создает новый календарь";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьКалендарь";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей календаря. См. ПолучитьСтруктуруКалендаря";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьКалендарь";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКалендарь";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Изменяет параметры календаря";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКалендарь";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--calendar";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID календаря";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКалендарь";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Структура полей сделки. См. ПолучитьСтруктуруСделки";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьКалендарь";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКалендарь";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Удаляет существующий календарь";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКалендарь";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--calendar";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID календаря";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКалендарь";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--owner";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "ID владельца календаря";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКалендарь";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--type";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Тип календаря: user, group";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьКалендарь";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКАЛЕНДАРЬ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЗанятостьПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАНЯТОСТЬПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Получает массив событий пользователей в заданном интервале
    |
    |    Дата указывается в формате ISO 8601:
    |    ""2024-04-07""
    |    ""2024-04-07T13:34:42+00:00"" 
    |    ""2024-04-07T13:34:42Z""
    |
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЗанятостьПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАНЯТОСТЬПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--users";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователей или одного пользователя";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЗанятостьПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАНЯТОСТЬПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--from";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Дата начала периода";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЗанятостьПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАНЯТОСТЬПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--to";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Дата окончания периода";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьЗанятостьПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАНЯТОСТЬПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользовательскиеНастройкиКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЬСКИЕНАСТРОЙКИКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Получает пользовательские настройки календаря текущего пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьПользовательскиеНастройкиКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПОЛЬЗОВАТЕЛЬСКИЕНАСТРОЙКИКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьПользовательскиеНастройкиКалендаря";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬПОЛЬЗОВАТЕЛЬСКИЕНАСТРОЙКИКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает новые пользовательские настройки календаря";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьПользовательскиеНастройкиКалендаря";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬПОЛЬЗОВАТЕЛЬСКИЕНАСТРОЙКИКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--settings";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Структура настроек. См. ПолучитьСтруктуруПользовательскихНастроекКаледнаря";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьПользовательскиеНастройкиКалендаря";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬПОЛЬЗОВАТЕЛЬСКИЕНАСТРОЙКИКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруНастроекКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУНАСТРОЕККАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру стандартных настроек календаря";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруНастроекКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУНАСТРОЕККАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с календарями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруПользовательскихНастроекКаледнаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУПОЛЬЗОВАТЕЛЬСКИХНАСТРОЕККАЛЕДНАРЯ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Получает пустую структуру для установки пользовательских настроек календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с календарями";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей описания календаря";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Создает новое событие календаря";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Описание события. См. ПолучитьСтруктуруСобытияКалендаря";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "СоздатьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Изменяет данные события календаря";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--event";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID события календаря";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Описание события. См. ПолучитьСтруктуруСобытияКалендаря";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ИзменитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Получает событие календаря по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--event";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID события для получения";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСобытияКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОБЫТИЯКАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Получает события календарей с фильтрами или без";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСобытияКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОБЫТИЯКАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--owner";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "ID владельца календаря";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСобытияКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОБЫТИЯКАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--type";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Тип календаря: user, group, company_calendar";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСобытияКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОБЫТИЯКАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Фильтр событий. См. ПолучитьСтруктуруФильтраСобытийКалендарей (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСобытияКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОБЫТИЯКАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Удаляет событие из календаря";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--event";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID события для удаления";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УдалитьСобытиеКалендаря";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСОБЫТИЕКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтатусУчастияПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАТУСУЧАСТИЯПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Получает статус участия в событии для текущего пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтатусУчастияПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАТУСУЧАСТИЯПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--event";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID события календаря";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтатусУчастияПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТАТУСУЧАСТИЯПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьСтатусУчастияПользователя";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬСТАТУСУЧАСТИЯПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает статус участия в событии для текущего пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьСтатусУчастияПользователя";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬСТАТУСУЧАСТИЯПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--event";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "ID события календаря";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьСтатусУчастияПользователя";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬСТАТУСУЧАСТИЯПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--status";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Статус участия: Y (согласен), N (отказался), Q (не ответил)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "УстановитьСтатусУчастияПользователя";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬСТАТУСУЧАСТИЯПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с событиями календарей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСобытияКалендаря";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСОБЫТИЯКАЛЕНДАРЯ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структуру полей события календаря";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "bitrix24";
    НоваяСтрока.Модуль       = "OPI_Bitrix24";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраСобытийКалендарей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАСОБЫТИЙКАЛЕНДАРЕЙ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с событиями календарей";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру фильтра для функции ПолучитьСобытияКалендарей";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;

        |

        |
        |OPI_Bitrix24 = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_Bitrix24.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
