Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСсылкуАвторизацииПриложения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬССЫЛКУАВТОРИЗАЦИИПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр    = "--domain";
    НоваяСтрока.Описание    = "Адрес битрикс вида portal.bitrix24.com";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Формирует ссылку для авторизации через браузер";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСсылкуАвторизацииПриложения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬССЫЛКУАВТОРИЗАЦИИПРИЛОЖЕНИЯ";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает токен по коду авторизации";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientsecret";
    НоваяСтрока.Описание    = "Client secret из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--code";
    НоваяСтрока.Описание    = "Code из авторизации через браузер";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientid";
    НоваяСтрока.Описание    = "Client ID из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Обновляет токен по Refresh токену";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--clientsecret";
    НоваяСтрока.Описание    = "Client secret из настроек приложения";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--refresh";
    НоваяСтрока.Описание    = "Refresh токен";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СерверноеВремя";
    НоваяСтрока.МетодПоиска = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Настройки и администрирование";
    НоваяСтрока.ОписаниеМетода   = "Получает текущее серверное время";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СерверноеВремя";
    НоваяСтрока.МетодПоиска = "СЕРВЕРНОЕВРЕМЯ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Настройки и администрирование";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Создает новую новость в ленте";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст новости";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--vision";
    НоваяСтрока.Описание    = "Массив|Один получатель: UA все, SGn раб. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--files";
    НоваяСтрока.Описание    = "Данные вложений, где ключ > имя файла, значение > путь к файлу иди двоичные данные (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Заголовок новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--important";
    НоваяСтрока.Описание    = "Помечает новость как важную (необяз. по ум. - False)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьНовость";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Изменяет новость в ленте";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст новости";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--vision";
    НоваяСтрока.Описание    = "Массив|Один получатель: UA все, SGn раб. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--files";
    НоваяСтрока.Описание    = "Данные вложений, где ключ > имя файла, значение > путь к файлу иди двоичные данные (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--title";
    НоваяСтрока.Описание    = "Заголовок новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьНовость";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Удаляет новость из ленты по выбранному ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости для удаления";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьНовость";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬНОВОСТЬ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Возвращает список пользователей, просмотревших выбранное важное сообщение";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID важной новости";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСписокПросмотревшихВажное";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСПИСОКПРОСМОТРЕВШИХВАЖНОЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Получает нвости или одну новость с отобором по ID или доступности";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID важной новости (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--sel";
    НоваяСтрока.Описание    = "Отбор новостей по доступу: UA все, SGn раб. группа, Un пользователь, DRn отдел, Gn группа (необяз. по ум. - UA)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьНовости";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНОВОСТИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьКомментарий";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Добавляет комментарий к новости";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьКомментарий";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьКомментарий";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст комментария";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьКомментарий";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Живая лента";
    НоваяСтрока.ОписаниеМетода   = "Добавляет новые группы или пользователей в получатели";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр    = "--postid";
    НоваяСтрока.Описание    = "ID новости";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр    = "--vision";
    НоваяСтрока.Описание    = "Массив|Один получатель: UA все, SGn раб. группа, Un пользователь, DRn отдел, Gn группа";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьПолучателейКНовости";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬПОЛУЧАТЕЛЕЙКНОВОСТИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Живая лента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУЗАДАЧИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру с описанем полей для создания задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруЗадачи";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУЗАДАЧИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Получает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПолучитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Создает новую задачу по структуре полей (см. ПолучитьСтруктуруЗадачи)";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--fields";
    НоваяСтрока.Описание    = "Структура полей задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "СоздатьЗадачу";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Изменяет существующую задачу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--fields";
    НоваяСтрока.Описание    = "Структура полей задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ИзменитьЗадачу";
    НоваяСтрока.МетодПоиска = "ИЗМЕНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Удаляет задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УдалитьЗадачу";
    НоваяСтрока.МетодПоиска = "УДАЛИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Принимает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПринятьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИНЯТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Отклоняет задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтклонитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТКЛОНИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Завершает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ЗавершитьЗадачу";
    НоваяСтрока.МетодПоиска = "ЗАВЕРШИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Возвращает в работу задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ВозобновитьЗадачу";
    НоваяСтрока.МетодПоиска = "ВОЗОБНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Откладывает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ОтложитьЗадачу";
    НоваяСтрока.МетодПоиска = "ОТЛОЖИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Приостанавливает задачу по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПриостановитьЗадачу";
    НоваяСтрока.МетодПоиска = "ПРИОСТАНОВИТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Начинает выполнение задачи по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьВыполнениеЗадачи";
    НоваяСтрока.МетодПоиска = "НАЧАТЬВЫПОЛНЕНИЕЗАДАЧИ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Начинает наблюдение за задачей по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "НачатьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "НАЧАТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Прекращает наблюдение за задчей по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ПрекратитьНаблюдатьЗаЗадачей";
    НоваяСтрока.МетодПоиска = "ПРЕКРАТИТЬНАБЛЮДАТЬЗАЗАДАЧЕЙ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Делегирует задачу на другого пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--user";
    НоваяСтрока.Описание    = "ID пользователя исполнителя";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДелегироватьЗадачу";
    НоваяСтрока.МетодПоиска = "ДЕЛЕГИРОВАТЬЗАДАЧУ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Добавляет задачу в список избранного";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "ДобавитьЗадачуВИзбранное";
    НоваяСтрока.МетодПоиска = "ДОБАВИТЬЗАДАЧУВИЗБРАННОЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL внешнего вебхука или адрес Bitrix24 при использовании токена";
    НоваяСтрока.Область     = "Задачи";
    НоваяСтрока.ОписаниеМетода   = "Удаляет задачу из списка избранного";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр    = "--task";
    НоваяСтрока.Описание    = "ID задачи";
    НоваяСтрока.Область     = "Задачи";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "bitrix24";
    НоваяСтрока.Модуль      = "OPI_Bitrix24";
    НоваяСтрока.Метод       = "УбратьЗадачуИзИзбранного";
    НоваяСтрока.МетодПоиска = "УБРАТЬЗАДАЧУИЗИЗБРАННОГО";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации, если используется не вебхук (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Задачи";

    Возврат ТаблицаСостава;
КонецФункции

