Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--account";
    НоваяСтрока.Описание    = "Идентификатор клиента (Account)";
    НоваяСтрока.Область     = "Общие методы";
    НоваяСтрока.ОписаниеМетода   = "Получает токен на основе идентификатора аккаунта и пароля";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--pass";
    НоваяСтрока.Описание    = "Секретный ключ (Password)";
    НоваяСтрока.Область     = "Общие методы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "ПолучитьТокен";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--testapi";
    НоваяСтрока.Описание    = "Флаг использования API для тестовых запросов (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Общие методы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "СоздатьЗаказ";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАКАЗ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации";
    НоваяСтрока.Область     = "Работа с заказми";
    НоваяСтрока.ОписаниеМетода   = "Создает заказ по описанию полей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "СоздатьЗаказ";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАКАЗ";
    НоваяСтрока.Параметр    = "--order";
    НоваяСтрока.Описание    = "Набор полей заказа. См. ПолучитьОписаниеЗаказа";
    НоваяСтрока.Область     = "Работа с заказми";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "СоздатьЗаказ";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАКАЗ";
    НоваяСтрока.Параметр    = "--ostore";
    НоваяСтрока.Описание    = "Признак типа заказа Интернет магазин (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Работа с заказми";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "СоздатьЗаказ";
    НоваяСтрока.МетодПоиска = "СОЗДАТЬЗАКАЗ";
    НоваяСтрока.Параметр    = "--testapi";
    НоваяСтрока.Описание    = "Флаг использования API для тестовых запросов (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Работа с заказми";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "ПолучитьОписаниеЗаказа";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОПИСАНИЕЗАКАЗА";
    НоваяСтрока.Параметр    = "--empty";
    НоваяСтрока.Описание    = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Работа с заказми";
    НоваяСтрока.ОписаниеМетода   = "Получает макет для создания заказа в функции СоздатьЗаказ";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "ПолучитьОписаниеЗаказа";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОПИСАНИЕЗАКАЗА";
    НоваяСтрока.Параметр    = "--required";
    НоваяСтрока.Описание    = "Истина > в макете будут только обязательные поля (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Работа с заказми";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "cdek";
    НоваяСтрока.Модуль      = "OPI_CDEK";
    НоваяСтрока.Метод       = "ПолучитьОписаниеЗаказа";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОПИСАНИЕЗАКАЗА";
    НоваяСтрока.Параметр    = "--ostore";
    НоваяСтрока.Описание    = "Признак включения в макет полей исключительно для заказо Интернет магазина (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Работа с заказми";

    Возврат ТаблицаСостава;
КонецФункции

