
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("ПараметрСокр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СформироватьСсылкуПолученияКода";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬССЫЛКУПОЛУЧЕНИЯКОДА";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Client ID";
    НоваяСтрока.Область      = "Авторизация";
    НоваяСтрока.ОписаниеМетода   = "Возвращает URL для авторизации в браузере";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СформироватьСсылкуПолученияКода";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬССЫЛКУПОЛУЧЕНИЯКОДА";
    НоваяСтрока.Параметр     = "--calendar";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "разрешение на методы Calendar (необяз. по ум. - True)";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СформироватьСсылкуПолученияКода";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬССЫЛКУПОЛУЧЕНИЯКОДА";
    НоваяСтрока.Параметр     = "--drive";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "разрешение на методы Drive (необяз. по ум. - True)";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СформироватьСсылкуПолученияКода";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬССЫЛКУПОЛУЧЕНИЯКОДА";
    НоваяСтрока.Параметр     = "--sheets";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "разрешение на методы Sheets (необяз. по ум. - True)";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьТокенПоКоду";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕНПОКОДУ";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Client ID";
    НоваяСтрока.Область      = "Авторизация";
    НоваяСтрока.ОписаниеМетода   = "Получает токен по коду из авторизации в бразуере";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьТокенПоКоду";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕНПОКОДУ";
    НоваяСтрока.Параметр     = "--secret";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Client secret";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьТокенПоКоду";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕНПОКОДУ";
    НоваяСтрока.Параметр     = "--code";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Code из браузера";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Client ID";
    НоваяСтрока.Область      = "Авторизация";
    НоваяСтрока.ОписаниеМетода   = "Обновляет токен по Refresh token";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--secret";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Client secret";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр     = "--refresh";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Refresh token";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьТокенServiceАккаунта";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕНSERVICEАККАУНТА";
    НоваяСтрока.Параметр     = "--auth";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "JSON данные авторизации как файл, коллекция или двоичные данные";
    НоваяСтрока.Область      = "Авторизация";
    НоваяСтрока.ОписаниеМетода   = "Получает токен авторизации по данным service аккаунта
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьТокенServiceАккаунта";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕНSERVICEАККАУНТА";
    НоваяСтрока.Параметр     = "--scope";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Область действия (scope) или массив областей";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьТокенServiceАккаунта";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОКЕНSERVICEАККАУНТА";
    НоваяСтрока.Параметр     = "--exp";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Время жизни токена в секундах (необяз. по ум. - 3600)";
    НоваяСтрока.Область      = "Авторизация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОбОбъекте";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОБОБЪЕКТЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о папке или файле по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОбОбъекте";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОБОБЪЕКТЕ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор файла или каталога";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьСписокКаталогов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККАТАЛОГОВ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Получает список каталогов диска";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьСписокКаталогов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККАТАЛОГОВ";
    НоваяСтрока.Параметр     = "--querry";
    НоваяСтрока.ПараметрСокр = "-q";
    НоваяСтрока.Описание     = "Отбор по имени (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьСписокКаталогов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККАТАЛОГОВ";
    НоваяСтрока.Параметр     = "--depth";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Добавляет список файлов к полям каталога (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьСписокФайлов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКФАЙЛОВ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Получает список файлов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьСписокФайлов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКФАЙЛОВ";
    НоваяСтрока.Параметр     = "--querry";
    НоваяСтрока.ПараметрСокр = "-q";
    НоваяСтрока.Описание     = "Отбор по имени (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьСписокФайлов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКФАЙЛОВ";
    НоваяСтрока.Параметр     = "--catalog";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Отбор по ID каталога родителя (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Загружает файл на диск
    |    Структура заполнения опции --props:
    |    {
    |     ""MIME""        : ""image/jpeg"",
    |     ""Имя""         : ""Новый файл.jpg"",
    |     ""Описание""    : ""Это новый файл"",
    |     ""Родитель""    : ""root""
    |    }
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--file";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Загружаемый файл";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--props";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "См. ПолучитьОписаниеФайла";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СоздатьПапку";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПАПКУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Создает пустой каталог на диске";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СоздатьПапку";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПАПКУ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Имя папки";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СоздатьПапку";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬПАПКУ";
    НоваяСтрока.Параметр     = "--catalog";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Родитель (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СкачатьФайл";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Получает файл по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СкачатьФайл";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор файла";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СкачатьФайл";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--out";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Путь сохранения файла (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СкопироватьОбъект";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬОБЪЕКТ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Копирует файл или каталог";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СкопироватьОбъект";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬОБЪЕКТ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор объекта";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СкопироватьОбъект";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬОБЪЕКТ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Новое имя объекта (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СкопироватьОбъект";
    НоваяСтрока.МетодПоиска  = "СКОПИРОВАТЬОБЪЕКТ";
    НоваяСтрока.Параметр     = "--catalog";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Новый каталог размещения (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ОбновитьФайл";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Обновляет двоичные данные файла";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ОбновитьФайл";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор обновляемого объекта";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ОбновитьФайл";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--file";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Файл источник обновления";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ОбновитьФайл";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--title";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Новое имя файла (если необходимо) (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "УдалитьОбъект";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬОБЪЕКТ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет файл или каталог по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "УдалитьОбъект";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬОБЪЕКТ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор объекта для удаления";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьОписаниеФайла";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕФАЙЛА";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с файлами и каталогами";
    НоваяСтрока.ОписаниеМетода   = "Получает шаблон пустого описания для загрузки файла";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СоздатьКомментарий";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с комментариями";
    НоваяСтрока.ОписаниеМетода   = "Создает комментарий к файлу или каталогу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СоздатьКомментарий";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор объекта, для которого необходим комментарий";
    НоваяСтрока.Область      = "Работа с комментариями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "СоздатьКомментарий";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст комментария";
    НоваяСтрока.Область      = "Работа с комментариями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьКомментарий";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с комментариями";
    НоваяСтрока.ОписаниеМетода   = "Получает комментарий по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьКомментарий";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор файла или каталога размещения комментария";
    НоваяСтрока.Область      = "Работа с комментариями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьКомментарий";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--comment";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор комментария";
    НоваяСтрока.Область      = "Работа с комментариями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьСписокКомментариев";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с комментариями";
    НоваяСтрока.ОписаниеМетода   = "Получает список всех комментариев объекта";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "ПолучитьСписокКомментариев";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОККОММЕНТАРИЕВ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор объекта";
    НоваяСтрока.Область      = "Работа с комментариями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "УдалитьКомментарий";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Работа с комментариями";
    НоваяСтрока.ОписаниеМетода   = "Удаляет комментарий по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "УдалитьКомментарий";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--object";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Идентификатор файла или каталога размещения комментария";
    НоваяСтрока.Область      = "Работа с комментариями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "gdrive";
    НоваяСтрока.Модуль       = "OPI_GoogleDrive";
    НоваяСтрока.Метод        = "УдалитьКомментарий";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОММЕНТАРИЙ";
    НоваяСтрока.Параметр     = "--comment";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор комментария";
    НоваяСтрока.Область      = "Работа с комментариями";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;
        |Контекст.Вставить(""OPI_GoogleWorkspace"", Неопределено);
        |
        |OPI_GoogleWorkspace = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_GoogleWorkspace.os"", Контекст);
        |Контекст.Вставить(""OPI_GoogleWorkspace"", OPI_GoogleWorkspace);
        |
        |OPI_GoogleDrive = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_GoogleDrive.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
