
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "СформироватьСсылкуПолученияКода";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬССЫЛКУПОЛУЧЕНИЯКОДА";
    НоваяСтрока.Параметр    = "--id";
    НоваяСтрока.Описание    = "Client ID";
    НоваяСтрока.Область     = "Программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Возвращает URL для авторизации в браузере";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "СформироватьСсылкуПолученияКода";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬССЫЛКУПОЛУЧЕНИЯКОДА";
    НоваяСтрока.Параметр    = "--calendar";
    НоваяСтрока.Описание    = "разрешение на методы Calendar (необяз. по ум. - True)";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "СформироватьСсылкуПолученияКода";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬССЫЛКУПОЛУЧЕНИЯКОДА";
    НоваяСтрока.Параметр    = "--drive";
    НоваяСтрока.Описание    = "разрешение на методы Drive (необяз. по ум. - True)";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "СформироватьСсылкуПолученияКода";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬССЫЛКУПОЛУЧЕНИЯКОДА";
    НоваяСтрока.Параметр    = "--sheets";
    НоваяСтрока.Описание    = "разрешение на методы Sheets (необяз. по ум. - True)";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ПолучитьТокенПоКоду";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕНПОКОДУ";
    НоваяСтрока.Параметр    = "--id";
    НоваяСтрока.Описание    = "Client ID";
    НоваяСтрока.Область     = "Программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Получает токен по коду из авторизации в бразуере";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ПолучитьТокенПоКоду";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕНПОКОДУ";
    НоваяСтрока.Параметр    = "--secret";
    НоваяСтрока.Описание    = "Client secret";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ПолучитьТокенПоКоду";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕНПОКОДУ";
    НоваяСтрока.Параметр    = "--code";
    НоваяСтрока.Описание    = "Code из браузера";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--id";
    НоваяСтрока.Описание    = "Client ID";
    НоваяСтрока.Область     = "Программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Обновляет токен по Refresh token";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--secret";
    НоваяСтрока.Описание    = "Client secret";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--refresh";
    НоваяСтрока.Описание    = "Refresh token";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ПолучитьТокенServiceАккаунта";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕНSERVICEАККАУНТА";
    НоваяСтрока.Параметр    = "--auth";
    НоваяСтрока.Описание    = "JSON данные авторизации как файл, коллекция или двоичные данные";
    НоваяСтрока.Область     = "Программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Получает токен авторизации по данным service аккаунта
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ПолучитьТокенServiceАккаунта";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕНSERVICEАККАУНТА";
    НоваяСтрока.Параметр    = "--scope";
    НоваяСтрока.Описание    = "Область действия (scope) или массив областей";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "google";
    НоваяСтрока.Модуль      = "OPI_GoogleWorkspace";
    НоваяСтрока.Метод       = "ПолучитьТокенServiceАккаунта";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬТОКЕНSERVICEАККАУНТА";
    НоваяСтрока.Параметр    = "--exp";
    НоваяСтрока.Описание    = "Время жизни токена в секундах (необяз. по ум. - 3600)";
    НоваяСтрока.Область     = "Программный интерфейс";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;

        |

        |
        |OPI_GoogleWorkspace = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_GoogleWorkspace.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
