Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "greenapi";
    НоваяСтрока.Модуль      = "OPI_GreenAPI";
    НоваяСтрока.Метод       = "СформироватьПараметрыДоступа";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬПАРАМЕТРЫДОСТУПА";
    НоваяСтрока.Параметр    = "--api";
    НоваяСтрока.Описание    = "Ссылка на хост API";
    НоваяСтрока.Область     = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Формирует структуру основных авторизационных данных";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "greenapi";
    НоваяСтрока.Модуль      = "OPI_GreenAPI";
    НоваяСтрока.Метод       = "СформироватьПараметрыДоступа";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬПАРАМЕТРЫДОСТУПА";
    НоваяСтрока.Параметр    = "--media";
    НоваяСтрока.Описание    = "Ссылка на хост API для отправки файлов";
    НоваяСтрока.Область     = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "greenapi";
    НоваяСтрока.Модуль      = "OPI_GreenAPI";
    НоваяСтрока.Метод       = "СформироватьПараметрыДоступа";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬПАРАМЕТРЫДОСТУПА";
    НоваяСтрока.Параметр    = "--id";
    НоваяСтрока.Описание    = "Уникальный номер инстанса";
    НоваяСтрока.Область     = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "greenapi";
    НоваяСтрока.Модуль      = "OPI_GreenAPI";
    НоваяСтрока.Метод       = "СформироватьПараметрыДоступа";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬПАРАМЕТРЫДОСТУПА";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Ключ доступа инстанса";
    НоваяСтрока.Область     = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "greenapi";
    НоваяСтрока.Модуль      = "OPI_GreenAPI";
    НоваяСтрока.Метод       = "ПолучитьНастройкиИнстанса";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬНАСТРОЙКИИНСТАНСА";
    НоваяСтрока.Параметр    = "--access";
    НоваяСтрока.Описание    = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область     = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Получает текущие настройки инстанса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "greenapi";
    НоваяСтрока.Модуль      = "OPI_GreenAPI";
    НоваяСтрока.Метод       = "УстановитьНастройкиИнстанса";
    НоваяСтрока.МетодПоиска = "УСТАНОВИТЬНАСТРОЙКИИНСТАНСА";
    НоваяСтрока.Параметр    = "--settings";
    НоваяСтрока.Описание    = "Настройки инстанса. См. ПолучитьСтруктуруНастроекИнстанса";
    НоваяСтрока.Область     = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает настройки инстанса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "greenapi";
    НоваяСтрока.Модуль      = "OPI_GreenAPI";
    НоваяСтрока.Метод       = "УстановитьНастройкиИнстанса";
    НоваяСтрока.МетодПоиска = "УСТАНОВИТЬНАСТРОЙКИИНСТАНСА";
    НоваяСтрока.Параметр    = "--access";
    НоваяСтрока.Описание    = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область     = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "greenapi";
    НоваяСтрока.Модуль      = "OPI_GreenAPI";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруНастроекИнстанса";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУНАСТРОЕКИНСТАНСА";
    НоваяСтрока.Параметр    = "--empty";
    НоваяСтрока.Описание    = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Получает шаблон структуры для установки настроек инстанса";

    Возврат ТаблицаСостава;
КонецФункции

