
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("ПараметрСокр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СформироватьПараметрыДоступа";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬПАРАМЕТРЫДОСТУПА";
    НоваяСтрока.Параметр     = "--api";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Ссылка на хост API";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Формирует структуру основных авторизационных данных";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СформироватьПараметрыДоступа";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬПАРАМЕТРЫДОСТУПА";
    НоваяСтрока.Параметр     = "--media";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Ссылка на хост API для отправки файлов";
    НоваяСтрока.Область      = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СформироватьПараметрыДоступа";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬПАРАМЕТРЫДОСТУПА";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Уникальный номер инстанса";
    НоваяСтрока.Область      = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СформироватьПараметрыДоступа";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬПАРАМЕТРЫДОСТУПА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Ключ доступа инстанса";
    НоваяСтрока.Область      = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОбАккаунте";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОБАККАУНТЕ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию об аккаунте";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьНастройкиИнстанса";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНАСТРОЙКИИНСТАНСА";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Получает текущие настройки инстанса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьНастройкиИнстанса";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬНАСТРОЙКИИНСТАНСА";
    НоваяСтрока.Параметр     = "--settings";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Настройки инстанса. См. ПолучитьСтруктуруНастроекИнстанса";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает настройки инстанса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьНастройкиИнстанса";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬНАСТРОЙКИИНСТАНСА";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьСостояниеИнстанса";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСОСТОЯНИЕИНСТАНСА";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Получает состояние инстанса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПерезапуститьИнстанс";
    НоваяСтрока.МетодПоиска  = "ПЕРЕЗАПУСТИТЬИНСТАНС";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Перезапускает инстанс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "РазлогинитьИнстанс";
    НоваяСтрока.МетодПоиска  = "РАЗЛОГИНИТЬИНСТАНС";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Разлогинивает инстанс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьQR";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬQR";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Получает QR-код авторизации";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьКодАвторизации";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОДАВТОРИЗАЦИИ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Получает код авторизации для связи по номеру телефона";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьКодАвторизации";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКОДАВТОРИЗАЦИИ";
    НоваяСтрока.Параметр     = "--phone";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Номер телефона в международном формате без + и 00";
    НоваяСтрока.Область      = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьКартинкуПрофиля";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬКАРТИНКУПРОФИЛЯ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает новую картинку профиля";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьКартинкуПрофиля";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬКАРТИНКУПРОФИЛЯ";
    НоваяСтрока.Параметр     = "--picture";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Картинка профиля";
    НоваяСтрока.Область      = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "АрхивироватьЧат";
    НоваяСтрока.МетодПоиска  = "АРХИВИРОВАТЬЧАТ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Архивирует выбранный чат";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "АрхивироватьЧат";
    НоваяСтрока.МетодПоиска  = "АРХИВИРОВАТЬЧАТ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата для архивации";
    НоваяСтрока.Область      = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "РазархивироватьЧат";
    НоваяСтрока.МетодПоиска  = "РАЗАРХИВИРОВАТЬЧАТ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Разархивирует выбранный чат";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "РазархивироватьЧат";
    НоваяСтрока.МетодПоиска  = "РАЗАРХИВИРОВАТЬЧАТ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID чата для разархивации";
    НоваяСтрока.Область      = "Аккаунт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруНастроекИнстанса";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУНАСТРОЕКИНСТАНСА";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Аккаунт";
    НоваяСтрока.ОписаниеМетода   = "Получает шаблон структуры для установки настроек инстанса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОГруппе";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОГРУППЕ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Получает данные группового чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОГруппе";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОГРУППЕ";
    НоваяСтрока.Параметр     = "--group";
    НоваяСтрока.ПараметрСокр = "-g";
    НоваяСтрока.Описание     = "Идентификатор группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СоздатьГруппу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬГРУППУ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Создает новый групповой чат
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СоздатьГруппу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬГРУППУ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Наименование группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СоздатьГруппу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬГРУППУ";
    НоваяСтрока.Параметр     = "--members";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Массив участников чата (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИзменитьИмяГруппы";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬИМЯГРУППЫ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Изменяет имя существующей группы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИзменитьИмяГруппы";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬИМЯГРУППЫ";
    НоваяСтрока.Параметр     = "--group";
    НоваяСтрока.ПараметрСокр = "-g";
    НоваяСтрока.Описание     = "Идентификатор группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИзменитьИмяГруппы";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬИМЯГРУППЫ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Новое наименование группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ДобавитьУчастникаВГруппу";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬУЧАСТНИКАВГРУППУ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Добавляет участника в групповой чат";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ДобавитьУчастникаВГруппу";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬУЧАСТНИКАВГРУППУ";
    НоваяСтрока.Параметр     = "--group";
    НоваяСтрока.ПараметрСокр = "-g";
    НоваяСтрока.Описание     = "Идентификатор группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ДобавитьУчастникаВГруппу";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬУЧАСТНИКАВГРУППУ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя для добавления";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИсключитьУчастникаГруппы";
    НоваяСтрока.МетодПоиска  = "ИСКЛЮЧИТЬУЧАСТНИКАГРУППЫ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Исключает участника из группы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИсключитьУчастникаГруппы";
    НоваяСтрока.МетодПоиска  = "ИСКЛЮЧИТЬУЧАСТНИКАГРУППЫ";
    НоваяСтрока.Параметр     = "--group";
    НоваяСтрока.ПараметрСокр = "-g";
    НоваяСтрока.Описание     = "Идентификатор группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИсключитьУчастникаГруппы";
    НоваяСтрока.МетодПоиска  = "ИСКЛЮЧИТЬУЧАСТНИКАГРУППЫ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя для добавления";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "НазначитьПраваАдминистратора";
    НоваяСтрока.МетодПоиска  = "НАЗНАЧИТЬПРАВААДМИНИСТРАТОРА";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Назначает пользователя администратором группы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "НазначитьПраваАдминистратора";
    НоваяСтрока.МетодПоиска  = "НАЗНАЧИТЬПРАВААДМИНИСТРАТОРА";
    НоваяСтрока.Параметр     = "--group";
    НоваяСтрока.ПараметрСокр = "-g";
    НоваяСтрока.Описание     = "Идентификатор группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "НазначитьПраваАдминистратора";
    НоваяСтрока.МетодПоиска  = "НАЗНАЧИТЬПРАВААДМИНИСТРАТОРА";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя для добавления";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтозватьПраваАдминистратора";
    НоваяСтрока.МетодПоиска  = "ОТОЗВАТЬПРАВААДМИНИСТРАТОРА";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Отзывает права администратора у пользователя";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтозватьПраваАдминистратора";
    НоваяСтрока.МетодПоиска  = "ОТОЗВАТЬПРАВААДМИНИСТРАТОРА";
    НоваяСтрока.Параметр     = "--group";
    НоваяСтрока.ПараметрСокр = "-g";
    НоваяСтрока.Описание     = "Идентификатор группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтозватьПраваАдминистратора";
    НоваяСтрока.МетодПоиска  = "ОТОЗВАТЬПРАВААДМИНИСТРАТОРА";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя для добавления";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПокинутьГруппу";
    НоваяСтрока.МетодПоиска  = "ПОКИНУТЬГРУППУ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Производит выход текущего аккаунта из группового чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПокинутьГруппу";
    НоваяСтрока.МетодПоиска  = "ПОКИНУТЬГРУППУ";
    НоваяСтрока.Параметр     = "--group";
    НоваяСтрока.ПараметрСокр = "-g";
    НоваяСтрока.Описание     = "Идентификатор группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьКартинкуГруппы";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬКАРТИНКУГРУППЫ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Управление группами";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает картинку группового чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьКартинкуГруппы";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬКАРТИНКУГРУППЫ";
    НоваяСтрока.Параметр     = "--group";
    НоваяСтрока.ПараметрСокр = "-g";
    НоваяСтрока.Описание     = "Идентификатор группового чата";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьКартинкуГруппы";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬКАРТИНКУГРУППЫ";
    НоваяСтрока.Параметр     = "--picture";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Картинка профиля";
    НоваяСтрока.Область      = "Управление группами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет текстовое сообщение в выбранный чат";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст сообщения";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--quoted";
    НоваяСтрока.ПараметрСокр = "-q";
    НоваяСтрока.Описание     = "ID цитируемого сообщения, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет файл в выбранный чат";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--file";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Данные или путь к файлу";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--filename";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Имя загружаемого файла с раширением";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--caption";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст сообщения под файлом (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--quoted";
    НоваяСтрока.ПараметрСокр = "-q";
    НоваяСтрока.Описание     = "ID цитируемого сообщения, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайлПоURL";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛПОURL";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет файл по URL в выбранный чат";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайлПоURL";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛПОURL";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайлПоURL";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛПОURL";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL файла для отправки";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайлПоURL";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛПОURL";
    НоваяСтрока.Параметр     = "--filename";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Имя загружаемого файла с раширением";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайлПоURL";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛПОURL";
    НоваяСтрока.Параметр     = "--caption";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст сообщения под файлом (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьФайлПоURL";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛПОURL";
    НоваяСтрока.Параметр     = "--quoted";
    НоваяСтрока.ПараметрСокр = "-q";
    НоваяСтрока.Описание     = "ID цитируемого сообщения, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьОпрос";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬОПРОС";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет опрос с вариантами ответов в выбранный чат
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьОпрос";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬОПРОС";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьОпрос";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬОПРОС";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст сообщения";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьОпрос";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬОПРОС";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Варианты ответов";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьОпрос";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬОПРОС";
    НоваяСтрока.Параметр     = "--multi";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Позволяет выбирать несколько вариантов ответа (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьОпрос";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬОПРОС";
    НоваяСтрока.Параметр     = "--quoted";
    НоваяСтрока.ПараметрСокр = "-q";
    НоваяСтрока.Описание     = "ID цитируемого сообщения, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет данные о местоположении в указанный чат";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--loc";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Описание локации. См. ПолучитьОписаниеЛокации";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--quoted";
    НоваяСтрока.ПараметрСокр = "-q";
    НоваяСтрока.Описание     = "ID цитируемого сообщения, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет контакт с номером телефона в выбранный чат";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--contact";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Описание контакта. См. ПолучитьОписаниеКонтакта";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--quoted";
    НоваяСтрока.ПараметрСокр = "-q";
    НоваяСтрока.Описание     = "ID цитируемого сообщения, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПереслатьСообщения";
    НоваяСтрока.МетодПоиска  = "ПЕРЕСЛАТЬСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Пересылает сообщения из одного чата в другой
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПереслатьСообщения";
    НоваяСтрока.МетодПоиска  = "ПЕРЕСЛАТЬСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--from";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID чата источника сообщения";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПереслатьСообщения";
    НоваяСтрока.МетодПоиска  = "ПЕРЕСЛАТЬСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--to";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "ID чата приемника сообщения";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПереслатьСообщения";
    НоваяСтрока.МетодПоиска  = "ПЕРЕСЛАТЬСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--msgs";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Сообщения или одно сообщения для отправки";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИзменитьТекстСообщения";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТЕКСТСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Изменяет текст сообщения";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИзменитьТекстСообщения";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТЕКСТСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИзменитьТекстСообщения";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТЕКСТСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Идентификатор сообщения";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ИзменитьТекстСообщения";
    НоваяСтрока.МетодПоиска  = "ИЗМЕНИТЬТЕКСТСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Новый текст сообщения";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УдалитьСообщение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Удаляет сообщение в выбранном чате";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УдалитьСообщение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УдалитьСообщение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Идентификатор сообщения";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УдалитьСообщение";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--sender";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Удалять только у отправителя (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеКонтакта";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕКОНТАКТА";
    НоваяСтрока.Параметр     = "--phone";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Телефон в международном формате без знака плюс";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Получает описание контакта для функции ОтправитьКонстакт";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеКонтакта";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕКОНТАКТА";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Имя контакта (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеКонтакта";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕКОНТАКТА";
    НоваяСтрока.Параметр     = "--surname";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Фамилия контакта (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеКонтакта";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕКОНТАКТА";
    НоваяСтрока.Параметр     = "--midname";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Отчество контакта (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеКонтакта";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕКОНТАКТА";
    НоваяСтрока.Параметр     = "--company";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Название компании контакта (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеЛокации";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕЛОКАЦИИ";
    НоваяСтрока.Параметр     = "--lat";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Географическая широта";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Получает описание локации для отправки в ОтправитьЛокацию";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеЛокации";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕЛОКАЦИИ";
    НоваяСтрока.Параметр     = "--long";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Географическая долгота";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеЛокации";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕЛОКАЦИИ";
    НоваяСтрока.Параметр     = "--addr";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Адрес локации (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОписаниеЛокации";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОПИСАНИЕЛОКАЦИИ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Название локации (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьУведомление";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Получение уведомлений";
    НоваяСтрока.ОписаниеМетода   = "Получает одно уведомление из очереди";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьУведомление";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬУВЕДОМЛЕНИЕ";
    НоваяСтрока.Параметр     = "--timeout";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Таймаут ожидания новых сообщений при пустой очереди (необяз. по ум. - 5)";
    НоваяСтрока.Область      = "Получение уведомлений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УдалитьУведомлениеИзОчереди";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬУВЕДОМЛЕНИЕИЗОЧЕРЕДИ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Получение уведомлений";
    НоваяСтрока.ОписаниеМетода   = "Удаляет уведомление из очерели после успешного получения";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УдалитьУведомлениеИзОчереди";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬУВЕДОМЛЕНИЕИЗОЧЕРЕДИ";
    НоваяСтрока.Параметр     = "--receipt";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Идентификатор доставки из метода ПолучитьУведомление";
    НоваяСтрока.Область      = "Получение уведомлений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СкачатьФайлСообщения";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Получение уведомлений";
    НоваяСтрока.ОписаниеМетода   = "Получает ссылку на скачивание файла из входящего сообщения";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СкачатьФайлСообщения";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Получение уведомлений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "СкачатьФайлСообщения";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Идентификатор сообщения с файлом";
    НоваяСтрока.Область      = "Получение уведомлений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьОтметкуПрочтения";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬОТМЕТКУПРОЧТЕНИЯ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Получение уведомлений";
    НоваяСтрока.ОписаниеМетода   = "Устанавливает отметку Прочитано для сообщения или всех сообщений чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьОтметкуПрочтения";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬОТМЕТКУПРОЧТЕНИЯ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Получение уведомлений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "УстановитьОтметкуПрочтения";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬОТМЕТКУПРОЧТЕНИЯ";
    НоваяСтрока.Параметр     = "--message";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Идентификатор сообщения. Все сообщения, если не заполнено (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Получение уведомлений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьОчередьСообщений";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОЧЕРЕДЬСООБЩЕНИЙ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Очередь сообщений";
    НоваяСтрока.ОписаниеМетода   = "Получает список сообщений в очереди на отправку";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ОчиститьОчередьСообщений";
    НоваяСтрока.МетодПоиска  = "ОЧИСТИТЬОЧЕРЕДЬСООБЩЕНИЙ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Очередь сообщений";
    НоваяСтрока.ОписаниеМетода   = "Очищает очередь сообщений на отправку";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьИсториюЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИСТОРИЮЧАТА";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Журналы сообщений";
    НоваяСтрока.ОписаниеМетода   = "Получает историю сообщений чата";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьИсториюЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИСТОРИЮЧАТА";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Журналы сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьИсториюЧата";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИСТОРИЮЧАТА";
    НоваяСтрока.Параметр     = "--count";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Количество сообщений для получения (необяз. по ум. - 100)";
    НоваяСтрока.Область      = "Журналы сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьСообщение";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Журналы сообщений";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о сообщении чата по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьСообщение";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--chat";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Идентификатор чата";
    НоваяСтрока.Область      = "Журналы сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьСообщение";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--msg";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Идентификатор сообщения";
    НоваяСтрока.Область      = "Журналы сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьЖурналВходящихСообщений";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЖУРНАЛВХОДЯЩИХСООБЩЕНИЙ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Журналы сообщений";
    НоваяСтрока.ОписаниеМетода   = "Получает список входящих сообщений инстанса за указанный интервал";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьЖурналВходящихСообщений";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЖУРНАЛВХОДЯЩИХСООБЩЕНИЙ";
    НоваяСтрока.Параметр     = "--period";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Время в минутах, за которое требуется показать сообщения (необяз. по ум. - 1440)";
    НоваяСтрока.Область      = "Журналы сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьЖурналИсходящихСообщений";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЖУРНАЛИСХОДЯЩИХСООБЩЕНИЙ";
    НоваяСтрока.Параметр     = "--access";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Параметры доступа. См. СформироватьПараметрыДоступа";
    НоваяСтрока.Область      = "Журналы сообщений";
    НоваяСтрока.ОписаниеМетода   = "Получает список исходящих сообщений инстанса за указанный интервал";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "greenapi";
    НоваяСтрока.Модуль       = "OPI_GreenAPI";
    НоваяСтрока.Метод        = "ПолучитьЖурналИсходящихСообщений";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЖУРНАЛИСХОДЯЩИХСООБЩЕНИЙ";
    НоваяСтрока.Параметр     = "--period";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Время в минутах, за которое требуется показать сообщения (необяз. по ум. - 1440)";
    НоваяСтрока.Область      = "Журналы сообщений";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;

        |

        |
        |OPI_GreenAPI = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_GreenAPI.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
