Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "ollama";
    НоваяСтрока.Модуль      = "OPI_Ollama";
    НоваяСтрока.Метод       = "ОбработатьЗапрос";
    НоваяСтрока.МетодПоиска = "ОБРАБОТАТЬЗАПРОС";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL сервера Ollama";
    НоваяСтрока.Область     = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Генерирует ответ по заданному текстовому запросу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "ollama";
    НоваяСтрока.Модуль      = "OPI_Ollama";
    НоваяСтрока.Метод       = "ОбработатьЗапрос";
    НоваяСтрока.МетодПоиска = "ОБРАБОТАТЬЗАПРОС";
    НоваяСтрока.Параметр    = "--model";
    НоваяСтрока.Описание    = "Имя модели";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "ollama";
    НоваяСтрока.Модуль      = "OPI_Ollama";
    НоваяСтрока.Метод       = "ОбработатьЗапрос";
    НоваяСтрока.МетодПоиска = "ОБРАБОТАТЬЗАПРОС";
    НоваяСтрока.Параметр    = "--prompt";
    НоваяСтрока.Описание    = "Текст запроса";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "ollama";
    НоваяСтрока.Модуль      = "OPI_Ollama";
    НоваяСтрока.Метод       = "ОбработатьЗапрос";
    НоваяСтрока.МетодПоиска = "ОБРАБОТАТЬЗАПРОС";
    НоваяСтрока.Параметр    = "--options";
    НоваяСтрока.Описание    = "Доп. параметры. См. ПолучитьСтруктуруПараметровЗапроса (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "ollama";
    НоваяСтрока.Модуль      = "OPI_Ollama";
    НоваяСтрока.Метод       = "ОбработатьЗапрос";
    НоваяСтрока.МетодПоиска = "ОБРАБОТАТЬЗАПРОС";
    НоваяСтрока.Параметр    = "--headers";
    НоваяСтрока.Описание    = "Доп заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Обработка запросов";

    Возврат ТаблицаСостава;
КонецФункции

