
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("ПараметрСокр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Генерирует ответ по заданному текстовому запросу
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр     = "--model";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Имя модели";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр     = "--msgs";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Сообщения разговора. См. ПолучитьСтруктуруСообщения";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Доп. параметры запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКАРТИНКИ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Генерирует картинки по указанному описанию";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКАРТИНКИ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКАРТИНКИ";
    НоваяСтрока.Параметр     = "--model";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Имя модели";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКАРТИНКИ";
    НоваяСтрока.Параметр     = "--descr";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Параметры генерации. См. ПолучитьСтруктуруОписанияКартинок";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬКАРТИНКИ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получает представления (embeddings) для заданных вводных
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр     = "--model";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Имя модели";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр     = "--input";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Строка или массив строк запросов";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Доп. параметры запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСообщения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--role";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Источник сообщения: system, user, assistant и др.";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру произвольного сообщения для списка сообщений запроса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСообщения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст сообщения";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСообщения";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Имя участника разговора (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСообщениеПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСООБЩЕНИЕПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст сообщения";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру сообщения от лица пользователя для использования в запросе";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСообщениеПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСООБЩЕНИЕПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Имя участника разговора (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСообщениеАссистента";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСООБЩЕНИЕАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст сообщения";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру сообщения от лица ассистента для использования в запросе";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСообщениеСистемы";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСООБЩЕНИЕСИСТЕМЫ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Текст сообщения";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру системного сообщения для использования в запросе";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСообщенияКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯКАРТИНКИ";
    НоваяСтрока.Параметр     = "--role";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Источник сообщения: system, user, developer";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получает структура сообщения на основе изображения для списка сообщений запроса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСообщенияКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯКАРТИНКИ";
    НоваяСтрока.Параметр     = "--file";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "ID файла картинки. См. ЗагрузитьФайл";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруСообщенияКартинки";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯКАРТИНКИ";
    НоваяСтрока.Параметр     = "--prompt";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Вводный текст запроса для обработки картинки (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруОписанияКартинок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУОПИСАНИЯКАРТИНОК";
    НоваяСтрока.Параметр     = "--prompt";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Текстовое описание картинки для генерации";
    НоваяСтрока.Область      = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получить структуру описания картинок для генерации";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруОписанияКартинок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУОПИСАНИЯКАРТИНОК";
    НоваяСтрока.Параметр     = "--amount";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Количество изображений для генерации";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруОписанияКартинок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУОПИСАНИЯКАРТИНОК";
    НоваяСтрока.Параметр     = "--bg";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "Вариант генерации фона: transparent, opaque, auto (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруОписанияКартинок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУОПИСАНИЯКАРТИНОК";
    НоваяСтрока.Параметр     = "--size";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Вариант размера сгенерированных изображений (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруОписанияКартинок";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУОПИСАНИЯКАРТИНОК";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Доп. параметры запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокАссистентов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКАССИСТЕНТОВ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Ассистенты";
    НоваяСтрока.ОписаниеМетода   = "Получает список ассистентов с отбором или без";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокАссистентов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКАССИСТЕНТОВ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокАссистентов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКАССИСТЕНТОВ";
    НоваяСтрока.Параметр     = "--limit";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Максимальное число возвращаемых ассистентов (необяз. по ум. - 20)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокАссистентов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКАССИСТЕНТОВ";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Доп. параметры запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокАссистентов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКАССИСТЕНТОВ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьАссистента";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Ассистенты";
    НоваяСтрока.ОписаниеМетода   = "Создает ассистента по модели и инструкции";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьАссистента";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьАссистента";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--model";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Имя модели";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьАссистента";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Имя ассистента (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьАссистента";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--inst";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Системная инструкция для ассистента (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьАссистента";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Доп. параметры запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьАссистента";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьАссистента";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Ассистенты";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию об ассистенте по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьАссистента";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьАссистента";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "ID ассистента";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьАссистента";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "УдалитьАссистента";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Ассистенты";
    НоваяСтрока.ОписаниеМетода   = "Удаляет ранее созданного ассистента";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "УдалитьАссистента";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "УдалитьАссистента";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "ID ассистента";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "УдалитьАссистента";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬАССИСТЕНТА";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Ассистенты";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокФайлов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКФАЙЛОВ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает список файлов с отбором или без";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокФайлов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКФАЙЛОВ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокФайлов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКФАЙЛОВ";
    НоваяСтрока.Параметр     = "--limit";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Максимальное число возвращаемых ассистентов (необяз. по ум. - 10000)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокФайлов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКФАЙЛОВ";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Доп. параметры запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокФайлов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКФАЙЛОВ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Загружает файл для дальнейшего использования в других запросах";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Имя файла с раширением";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--data";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Путь к файлу или данные";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--purpose";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Назначение файла: assistants, batch, vision, user_data, evals";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ЗагрузитьФайл";
    НоваяСтрока.МетодПоиска  = "ЗАГРУЗИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОФайле";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОФАЙЛЕ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о файле";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОФайле";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОФАЙЛЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОФайле";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОФАЙЛЕ";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "ID файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОФайле";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОФАЙЛЕ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СкачатьФайл";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Получает данные файла с сервера";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СкачатьФайл";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СкачатьФайл";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "ID файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СкачатьФайл";
    НоваяСтрока.МетодПоиска  = "СКАЧАТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "УдалитьФайл";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";
    НоваяСтрока.ОписаниеМетода   = "Удаляет ранее загруженный файл";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "УдалитьФайл";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "УдалитьФайл";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--id";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "ID файла";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "УдалитьФайл";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с файлами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СгенерироватьРечь";
    НоваяСтрока.МетодПоиска  = "СГЕНЕРИРОВАТЬРЕЧЬ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Работа с аудио";
    НоваяСтрока.ОписаниеМетода   = "Генерирует аудио с озвучиванием указанного текста";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СгенерироватьРечь";
    НоваяСтрока.МетодПоиска  = "СГЕНЕРИРОВАТЬРЕЧЬ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СгенерироватьРечь";
    НоваяСтрока.МетодПоиска  = "СГЕНЕРИРОВАТЬРЕЧЬ";
    НоваяСтрока.Параметр     = "--model";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Имя модели";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СгенерироватьРечь";
    НоваяСтрока.МетодПоиска  = "СГЕНЕРИРОВАТЬРЕЧЬ";
    НоваяСтрока.Параметр     = "--input";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Текст для озвучивания";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СгенерироватьРечь";
    НоваяСтрока.МетодПоиска  = "СГЕНЕРИРОВАТЬРЕЧЬ";
    НоваяСтрока.Параметр     = "--voice";
    НоваяСтрока.ПараметрСокр = "-v";
    НоваяСтрока.Описание     = "Вид голоса: alloy, ash, ballad, coral, echo и др. (необяз. по ум. - alloy)";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СгенерироватьРечь";
    НоваяСтрока.МетодПоиска  = "СГЕНЕРИРОВАТЬРЕЧЬ";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Доп. параметры запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СгенерироватьРечь";
    НоваяСтрока.МетодПоиска  = "СГЕНЕРИРОВАТЬРЕЧЬ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьТранскрипцию";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТРАНСКРИПЦИЮ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Работа с аудио";
    НоваяСтрока.ОписаниеМетода   = "Создает текстовую транскрипцию для выбранного аудио файла";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьТранскрипцию";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТРАНСКРИПЦИЮ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьТранскрипцию";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТРАНСКРИПЦИЮ";
    НоваяСтрока.Параметр     = "--model";
    НоваяСтрока.ПараметрСокр = "-m";
    НоваяСтрока.Описание     = "Имя модели";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьТранскрипцию";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТРАНСКРИПЦИЮ";
    НоваяСтрока.Параметр     = "--audio";
    НоваяСтрока.ПараметрСокр = "-a";
    НоваяСтрока.Описание     = "Аудио файл";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьТранскрипцию";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТРАНСКРИПЦИЮ";
    НоваяСтрока.Параметр     = "--type";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "MIME тип аудио файла (необяз. по ум. - audio/mpeg)";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьТранскрипцию";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТРАНСКРИПЦИЮ";
    НоваяСтрока.Параметр     = "--options";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Доп. параметры запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "СоздатьТранскрипцию";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТРАНСКРИПЦИЮ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с аудио";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокМоделей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКМОДЕЛЕЙ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL сервера OpenAI";
    НоваяСтрока.Область      = "Работа с моделями";
    НоваяСтрока.ОписаниеМетода   = "Получает список доступных моделей";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокМоделей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКМОДЕЛЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен авторизации OpenAI";
    НоваяСтрока.Область      = "Работа с моделями";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "openai";
    НоваяСтрока.Модуль       = "OPI_OpenAI";
    НоваяСтрока.Метод        = "ПолучитьСписокМоделей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКМОДЕЛЕЙ";
    НоваяСтрока.Параметр     = "--headers";
    НоваяСтрока.ПараметрСокр = "-h";
    НоваяСтрока.Описание     = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с моделями";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;

        |

        |
        |OPI_OpenAI = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_OpenAI.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
