Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL сервера Ollama";
    НоваяСтрока.Область     = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Генерирует ответ по заданному текстовому запросу
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации OpenAI";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр    = "--model";
    НоваяСтрока.Описание    = "Имя модели";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр    = "--msgs";
    НоваяСтрока.Описание    = "Сообщения разговора. См. ПолучитьСтруктуруСообщения";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр    = "--options";
    НоваяСтрока.Описание    = "Коллекция КлючЗначение дополнительных параметров (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьОтвет";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬОТВЕТ";
    НоваяСтрока.Параметр    = "--headers";
    НоваяСтрока.Описание    = "Доп. заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL сервера Ollama";
    НоваяСтрока.Область     = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получает представления (embeddings) для заданных вводных
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен авторизации OpenAI";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр    = "--model";
    НоваяСтрока.Описание    = "Имя модели";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр    = "--input";
    НоваяСтрока.Описание    = "Строка или массив строк запросов";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр    = "--options";
    НоваяСтрока.Описание    = "Доп. параметры. См. ПолучитьСтруктуруПараметровПредставлений (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьПредставления";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬПРЕДСТАВЛЕНИЯ";
    НоваяСтрока.Параметр    = "--headers";
    НоваяСтрока.Описание    = "Доп заголовки запроса, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруСообщения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯ";
    НоваяСтрока.Параметр    = "--role";
    НоваяСтрока.Описание    = "Источник сообщения: system, user, developer";
    НоваяСтрока.Область     = "Обработка запросов";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру сообщения для списка сообщений запроса";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруСообщения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст сообщения";
    НоваяСтрока.Область     = "Обработка запросов";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "openai";
    НоваяСтрока.Модуль      = "OPI_OpenAI";
    НоваяСтрока.Метод       = "ПолучитьСтруктуруСообщения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСТРУКТУРУСООБЩЕНИЯ";
    НоваяСтрока.Параметр    = "--name";
    НоваяСтрока.Описание    = "Имя участника разговора (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Обработка запросов";

    Возврат ТаблицаСостава;
КонецФункции

