
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "rcon";
    НоваяСтрока.Модуль      = "OPI_RCON";
    НоваяСтрока.Метод       = "ВыполнитьКоманду";
    НоваяСтрока.МетодПоиска = "ВЫПОЛНИТЬКОМАНДУ";
    НоваяСтрока.Параметр    = "--exec";
    НоваяСтрока.Описание    = "Текст команды";
    НоваяСтрока.Область     = "Выполнение команд";
    НоваяСтрока.ОписаниеМетода   = "Выполняет команду на сервере";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "rcon";
    НоваяСтрока.Модуль      = "OPI_RCON";
    НоваяСтрока.Метод       = "ВыполнитьКоманду";
    НоваяСтрока.МетодПоиска = "ВЫПОЛНИТЬКОМАНДУ";
    НоваяСтрока.Параметр    = "--conn";
    НоваяСтрока.Описание    = "Соединение или параметры соединения";
    НоваяСтрока.Область     = "Выполнение команд";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "rcon";
    НоваяСтрока.Модуль      = "OPI_RCON";
    НоваяСтрока.Метод       = "СформироватьПараметрыСоединения";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬПАРАМЕТРЫСОЕДИНЕНИЯ";
    НоваяСтрока.Параметр    = "--url";
    НоваяСтрока.Описание    = "URL сервера";
    НоваяСтрока.Область     = "Выполнение команд";
    НоваяСтрока.ОписаниеМетода   = "Формирует коллекцию параметров соединения";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "rcon";
    НоваяСтрока.Модуль      = "OPI_RCON";
    НоваяСтрока.Метод       = "СформироватьПараметрыСоединения";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬПАРАМЕТРЫСОЕДИНЕНИЯ";
    НоваяСтрока.Параметр    = "--pass";
    НоваяСтрока.Описание    = "Пароль для подключения";
    НоваяСтрока.Область     = "Выполнение команд";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "rcon";
    НоваяСтрока.Модуль      = "OPI_RCON";
    НоваяСтрока.Метод       = "СформироватьПараметрыСоединения";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬПАРАМЕТРЫСОЕДИНЕНИЯ";
    НоваяСтрока.Параметр    = "--rtout";
    НоваяСтрока.Описание    = "Таймаут ожидания ответа (в секундах) (необяз. по ум. - 30)";
    НоваяСтрока.Область     = "Выполнение команд";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "rcon";
    НоваяСтрока.Модуль      = "OPI_RCON";
    НоваяСтрока.Метод       = "СформироватьПараметрыСоединения";
    НоваяСтрока.МетодПоиска = "СФОРМИРОВАТЬПАРАМЕТРЫСОЕДИНЕНИЯ";
    НоваяСтрока.Параметр    = "--wtout";
    НоваяСтрока.Описание    = "Таймаут ожидания отправки запроса (в секундах) (необяз. по ум. - 30)";
    НоваяСтрока.Область     = "Выполнение команд";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        | Контекст = Новый Структура;
        | Контекст.Вставить(""OPI_RCON"", Неопределено);
        | Контекст.Вставить(""OPI_Компоненты"", Неопределено);
        | Контекст.Вставить(""OPI_ПреобразованиеТипов"", Неопределено);
        | Контекст.Вставить(""OPI_ЗапросыHTTP"", Неопределено);
        | Контекст.Вставить(""OPI_HTTPКлиент"", Неопределено);
        | Контекст.Вставить(""OPI_Инструменты"", Неопределено);
        | Контекст.Вставить(""OPI_Криптография"", Неопределено);
        | 
        | OPI_RCON = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_RCON.os"", Контекст);
        | Контекст.Вставить(""OPI_RCON"", OPI_RCON);
        | OPI_Компоненты = ЗагрузитьСценарий(""%1/oint/tools/Modules/OPI_Компоненты.os"", Контекст);
        | Контекст.Вставить(""OPI_Компоненты"", OPI_Компоненты);
        | OPI_ПреобразованиеТипов = ЗагрузитьСценарий(""%1/oint/tools/Modules/OPI_ПреобразованиеТипов.os"", Контекст);
        | Контекст.Вставить(""OPI_ПреобразованиеТипов"", OPI_ПреобразованиеТипов);
        | OPI_ЗапросыHTTP = ЗагрузитьСценарий(""%1/oint/tools/Modules/OPI_ЗапросыHTTP.os"", Контекст);
        | Контекст.Вставить(""OPI_ЗапросыHTTP"", OPI_ЗапросыHTTP);
        | OPI_HTTPКлиент = ЗагрузитьСценарий(""%1/oint/tools/Modules/internal/Classes/OPI_HTTPКлиент.os"", Контекст);
        | Контекст.Вставить(""OPI_HTTPКлиент"", OPI_HTTPКлиент);
        | OPI_Инструменты = ЗагрузитьСценарий(""%1/oint/tools/Modules/internal/Modules/OPI_Инструменты.os"", Контекст);
        | Контекст.Вставить(""OPI_Инструменты"", OPI_Инструменты);
        | OPI_Криптография = ЗагрузитьСценарий(""%1/oint/tools/Modules/internal/Modules/OPI_Криптография.os"", Контекст);
        | Контекст.Вставить(""OPI_Криптография"", OPI_Криптография);
        |" + Символы.ПС;


КонецФункции 
