
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("ПараметрСокр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ВыполнитьЗапросSQL";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЗАПРОСSQL";
    НоваяСтрока.Параметр     = "--sql";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Текст запроса к базе";
    НоваяСтрока.Область      = "Основные методы";
    НоваяСтрока.ОписаниеМетода   = "Выполняет произвольный SQL запрос
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ВыполнитьЗапросSQL";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЗАПРОСSQL";
    НоваяСтрока.Параметр     = "--params";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Массив позиционных параметров запроса (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Основные методы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ВыполнитьЗапросSQL";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЗАПРОСSQL";
    НоваяСтрока.Параметр     = "--force";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Включает попытку получения результата, даже для не SELECT запросов (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Основные методы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ВыполнитьЗапросSQL";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЗАПРОСSQL";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе. In memory, если не заполнено (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Основные методы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ВыполнитьЗапросSQL";
    НоваяСтрока.МетодПоиска  = "ВЫПОЛНИТЬЗАПРОСSQL";
    НоваяСтрока.Параметр     = "--exts";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Расширения: Ключ > путь или данные расширения, Значение > точка входа (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Основные методы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОТаблице";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОТАБЛИЦЕ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о таблице";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОТаблице";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОТАБЛИЦЕ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "СоздатьТаблицу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Создает пустую таблицу в базе";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "СоздатьТаблицу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--cols";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Структура колонок: Ключ > имя, Значение > Тип данных";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "СоздатьТаблицу";
    НоваяСтрока.МетодПоиска  = "СОЗДАТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ДобавитьКолонкуТаблицы";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОЛОНКУТАБЛИЦЫ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Добавляет новую колонку в существующую таблицу";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ДобавитьКолонкуТаблицы";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОЛОНКУТАБЛИЦЫ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Имя колонки";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ДобавитьКолонкуТаблицы";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОЛОНКУТАБЛИЦЫ";
    НоваяСтрока.Параметр     = "--type";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Тип данных колонки";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ДобавитьКолонкуТаблицы";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬКОЛОНКУТАБЛИЦЫ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "УдалитьКолонкуТаблицы";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОЛОНКУТАБЛИЦЫ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Удаляет колонку из таблицы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "УдалитьКолонкуТаблицы";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОЛОНКУТАБЛИЦЫ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Имя колонки";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "УдалитьКолонкуТаблицы";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬКОЛОНКУТАБЛИЦЫ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ГарантироватьТаблицу";
    НоваяСтрока.МетодПоиска  = "ГАРАНТИРОВАТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Создает новую таблицу в случае отсутствия или обновляет состав колонок существующей таблицы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ГарантироватьТаблицу";
    НоваяСтрока.МетодПоиска  = "ГАРАНТИРОВАТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--cols";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "Структура колонок: Ключ > имя, Значение > Тип данных";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ГарантироватьТаблицу";
    НоваяСтрока.МетодПоиска  = "ГАРАНТИРОВАТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ДобавитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Добавляет записи в таблицу
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ДобавитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--rows";
    НоваяСтрока.ПараметрСокр = "-r";
    НоваяСтрока.Описание     = "Массив структур данных строк: Ключ > поле, Значение > значение поля";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ДобавитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--trn";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Истина > добавление записей в транзакции с откатом при ошибке (необяз. по ум. - True)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ДобавитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Получает записи из выбранной таблицы
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--fields";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Поля для выборки (необяз. по ум. - *)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Массив фильтров. См. ПолучитьСтруктуруФильтраЗаписей (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--order";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Сортировка: Ключ > поле, Значение > направление (ASC, DESC) (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--limit";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Ограничение количества получаемых строк (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ОбновитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Обновляет значение записей по выбранным критериям
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ОбновитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--values";
    НоваяСтрока.ПараметрСокр = "-v";
    НоваяСтрока.Описание     = "Структура значений: Ключ > поле, Значение > значение поля";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ОбновитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Массив фильтров. См. ПолучитьСтруктуруФильтраЗаписей (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ОбновитьЗаписи";
    НоваяСтрока.МетодПоиска  = "ОБНОВИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "УдалитьЗаписи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Удаляет записи из таблицы
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "УдалитьЗаписи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--filter";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Массив фильтров. См. ПолучитьСтруктуруФильтраЗаписей (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "УдалитьЗаписи";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬЗАПИСИ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "УдалитьТаблицу";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Удаляет таблицу из базы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "УдалитьТаблицу";
    НоваяСтрока.МетодПоиска  = "УДАЛИТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ОчиститьТаблицу";
    НоваяСтрока.МетодПоиска  = "ОЧИСТИТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--table";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Имя таблицы";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Очищает таблицу базы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ОчиститьТаблицу";
    НоваяСтрока.МетодПоиска  = "ОЧИСТИТЬТАБЛИЦУ";
    НоваяСтрока.Параметр     = "--db";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Существующее соединение или путь к базе (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Orm";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "sqlite";
    НоваяСтрока.Модуль       = "OPI_SQLite";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруФильтраЗаписей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУФИЛЬТРАЗАПИСЕЙ";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Orm";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру шаблон для фильтрации записей в запросах ORM";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;
        |Контекст.Вставить(""OPI_SQLite"", Неопределено);
        |
        |OPI_SQLite = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_SQLite.os"", Контекст);
        |Контекст.Вставить(""OPI_SQLite"", OPI_SQLite);
        |
        |OPI_SQLite = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_SQLite.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
