Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "tcp";
    НоваяСтрока.Модуль      = "OPI_TCP";
    НоваяСтрока.Метод       = "ПодключитьсяИПолучитьДанные";
    НоваяСтрока.МетодПоиска = "ПОДКЛЮЧИТЬСЯИПОЛУЧИТЬДАННЫЕ";
    НоваяСтрока.Параметр    = "--address";
    НоваяСтрока.Описание    = "Адрес и порт для подключения";
    НоваяСтрока.Область     = "Tcp клиент";
    НоваяСтрока.ОписаниеМетода   = "Создает соединение и читает данные до конца или по ограничениям";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "tcp";
    НоваяСтрока.Модуль      = "OPI_TCP";
    НоваяСтрока.Метод       = "ПодключитьсяИПолучитьДанные";
    НоваяСтрока.МетодПоиска = "ПОДКЛЮЧИТЬСЯИПОЛУЧИТЬДАННЫЕ";
    НоваяСтрока.Параметр    = "--ssl";
    НоваяСтрока.Описание    = "Признак использования защищенного соединения (необяз. по ум. - Нет)";
    НоваяСтрока.Область     = "Tcp клиент";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "tcp";
    НоваяСтрока.Модуль      = "OPI_TCP";
    НоваяСтрока.Метод       = "ПодключитьсяИПолучитьДанные";
    НоваяСтрока.МетодПоиска = "ПОДКЛЮЧИТЬСЯИПОЛУЧИТЬДАННЫЕ";
    НоваяСтрока.Параметр    = "--timeout";
    НоваяСтрока.Описание    = "Интервал между попытками получения данных (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Tcp клиент";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "tcp";
    НоваяСтрока.Модуль      = "OPI_TCP";
    НоваяСтрока.Метод       = "ПодключитьсяИПолучитьДанные";
    НоваяСтрока.МетодПоиска = "ПОДКЛЮЧИТЬСЯИПОЛУЧИТЬДАННЫЕ";
    НоваяСтрока.Параметр    = "--attempts";
    НоваяСтрока.Описание    = "Максимальное число попыток получения данных (необяз. по ум. - 5)";
    НоваяСтрока.Область     = "Tcp клиент";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "tcp";
    НоваяСтрока.Модуль      = "OPI_TCP";
    НоваяСтрока.Метод       = "ПодключитьсяИПолучитьДанные";
    НоваяСтрока.МетодПоиска = "ПОДКЛЮЧИТЬСЯИПОЛУЧИТЬДАННЫЕ";
    НоваяСтрока.Параметр    = "--size";
    НоваяСтрока.Описание    = "Максимальный размер данных. 0 > без ограничений (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Tcp клиент";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "tcp";
    НоваяСтрока.Модуль      = "OPI_TCP";
    НоваяСтрока.Метод       = "ПодключитьсяИПолучитьДанные";
    НоваяСтрока.МетодПоиска = "ПОДКЛЮЧИТЬСЯИПОЛУЧИТЬДАННЫЕ";
    НоваяСтрока.Параметр    = "--string";
    НоваяСтрока.Описание    = "Истина > возвращает строку, Ложь > двоичные данные (необяз. по ум. - Да)";
    НоваяСтрока.Область     = "Tcp клиент";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "tcp";
    НоваяСтрока.Модуль      = "OPI_TCP";
    НоваяСтрока.Метод       = "ПодключитьсяИПолучитьДанные";
    НоваяСтрока.МетодПоиска = "ПОДКЛЮЧИТЬСЯИПОЛУЧИТЬДАННЫЕ";
    НоваяСтрока.Параметр    = "--enc";
    НоваяСтрока.Описание    = "Кодировка получаемых данных (необяз. по ум. - UTF-8)";
    НоваяСтрока.Область     = "Tcp клиент";

    Возврат ТаблицаСостава;
КонецФункции

