
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("ПараметрСокр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "tools";
    НоваяСтрока.Модуль       = "Utils";
    НоваяСтрока.Метод        = "РазложитьJSON";
    НоваяСтрока.МетодПоиска  = "РАЗЛОЖИТЬJSON";
    НоваяСтрока.Параметр     = "--json";
    НоваяСтрока.ПараметрСокр = "-j";
    НоваяСтрока.Описание     = "JSON данные";
    НоваяСтрока.Область      = "Служебный программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Показывает значения, которые можно получить из переданного JSON и возвращает
    |    конкретное значение при указании имени поля";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "tools";
    НоваяСтрока.Модуль       = "Utils";
    НоваяСтрока.Метод        = "РазложитьJSON";
    НоваяСтрока.МетодПоиска  = "РАЗЛОЖИТЬJSON";
    НоваяСтрока.Параметр     = "--nesting";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Ограничение на ур. вложенности разбора. На всю глубину по умолчанию (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Служебный программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "tools";
    НоваяСтрока.Модуль       = "Utils";
    НоваяСтрока.Метод        = "РазложитьJSON";
    НоваяСтрока.МетодПоиска  = "РАЗЛОЖИТЬJSON";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Имя поля для получения. Выводит весь список, если не указано (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Служебный программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "tools";
    НоваяСтрока.Модуль       = "Utils";
    НоваяСтрока.Метод        = "РазложитьJSON";
    НоваяСтрока.МетодПоиска  = "РАЗЛОЖИТЬJSON";
    НоваяСтрока.Параметр     = "--enc";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Кодировка, в которой записаны JSON данные (необяз. по ум. - UTF-8)";
    НоваяСтрока.Область      = "Служебный программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "tools";
    НоваяСтрока.Модуль       = "Utils";
    НоваяСтрока.Метод        = "ПреобразоватьBase64ВДвоичные";
    НоваяСтрока.МетодПоиска  = "ПРЕОБРАЗОВАТЬBASE64ВДВОИЧНЫЕ";
    НоваяСтрока.Параметр     = "--in";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Файл с Base64";
    НоваяСтрока.Область      = "Служебный программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Преобразует файл с Base64 строкой в бинарный файл";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;

        |

        |
        |Utils = ЗагрузитьСценарий(""C:/ProgramData/Jenkins/.jenkins/workspace/OpiBuild/OpiMain/src/ru/cli/tools/Modules/Utils.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
