
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("ПараметрСокр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "УстановитьWebhook";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬWEBHOOK";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен Viber";
    НоваяСтрока.Область      = "Настройки и информация";
    НоваяСтрока.ОписаниеМетода   = "ВАЖНО: Установка Webhook обязательна по правилам Viber. Для этого надо иметь свободный URL,
    |    который будет возвращать 200 и подлинный SSL сертификат. Если есть сертификат и база опубликована
    |    на сервере - можно использовать http-сервис. Туда же будет приходить и информация о новых сообщениях
    |    Viber периодически стучит по адресу Webhook, так что если он будет неактивен, то все перестанет работать";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "УстановитьWebhook";
    НоваяСтрока.МетодПоиска  = "УСТАНОВИТЬWEBHOOK";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "URL для установки Webhook";
    НоваяСтрока.Область      = "Настройки и информация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ПолучитьИнформациюОКанале";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬИНФОРМАЦИЮОКАНАЛЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Настройки и информация";
    НоваяСтрока.ОписаниеМетода   = "Тут можно получить ID пользователей канала. ID для бота необходимо получать из прилетов на Webhook
    |    ID пользователя из информации о канале не подойдет для отправки сообщений через бота - они разные";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ПолучитьДанныеПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДАННЫЕПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Настройки и информация";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о пользователе по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ПолучитьДанныеПользователя";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬДАННЫЕПОЛЬЗОВАТЕЛЯ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя Viber";
    НоваяСтрока.Область      = "Настройки и информация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ПолучитьОнлайнПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОНЛАЙНПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен Viber";
    НоваяСтрока.Область      = "Настройки и информация";
    НоваяСтрока.ОписаниеМетода   = "Получает статус пользователя или нескольких пользователей по ID
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ПолучитьОнлайнПользователей";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬОНЛАЙНПОЛЬЗОВАТЕЛЕЙ";
    НоваяСтрока.Параметр     = "--users";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователей(я) Viber";
    НоваяСтрока.Область      = "Настройки и информация";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет текстовое сообщение в чат или канал";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--text";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Текст сообщения";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя. Для канала > администратора, для бота > получателя";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--ischannel";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Отправка в канал или в чат бота";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр     = "--keyboard";
    НоваяСтрока.ПараметрСокр = "-k";
    НоваяСтрока.Описание     = "См. СформироватьКлавиатуруИзМассиваКнопок (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКартинку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКАРТИНКУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет картинку в чат или канал";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКартинку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКАРТИНКУ";
    НоваяСтрока.Параметр     = "--picture";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "URL картинки";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКартинку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКАРТИНКУ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя. Для канала > администратора, для бота > получателя";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКартинку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКАРТИНКУ";
    НоваяСтрока.Параметр     = "--ischannel";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Отправка в канал или в чат бота";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКартинку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКАРТИНКУ";
    НоваяСтрока.Параметр     = "--description";
    НоваяСтрока.ПараметрСокр = "-d";
    НоваяСтрока.Описание     = "Аннотация к картинке (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет файл (документ) в чат или канал";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--file";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "URL файла";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя. Для канала > администратора, для бота > получателя";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--ischannel";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Отправка в канал или в чат бота";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--ext";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Расширение файла";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьФайл";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬФАЙЛ";
    НоваяСтрока.Параметр     = "--size";
    НоваяСтрока.ПараметрСокр = "-s";
    НоваяСтрока.Описание     = "Размер файла. Если не заполнен > определяется автоматически скачиванием файла (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет контакт с номером телефона в чат или канал";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--name";
    НоваяСтрока.ПараметрСокр = "-n";
    НоваяСтрока.Описание     = "Имя контакта";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--phone";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Номер телефона";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя. Для канала > администратора, для бота > получателя";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьКонтакт";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬКОНТАКТ";
    НоваяСтрока.Параметр     = "--ischannel";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Отправка в канал или в чат бота";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет географические координаты в чат или канал";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--lat";
    НоваяСтрока.ПараметрСокр = "-l";
    НоваяСтрока.Описание     = "Географическая широта";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--long";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "Географическая долгота";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "ID пользователя. Для канала > администратора, для бота > получателя";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьЛокацию";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬЛОКАЦИЮ";
    НоваяСтрока.Параметр     = "--ischannel";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Отправка в канал или в чат бота";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьСсылку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬССЫЛКУ";
    НоваяСтрока.Параметр     = "--token";
    НоваяСтрока.ПараметрСокр = "-t";
    НоваяСтрока.Описание     = "Токен";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет URL с предпросмотром в чат или канал";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьСсылку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬССЫЛКУ";
    НоваяСтрока.Параметр     = "--url";
    НоваяСтрока.ПараметрСокр = "-u";
    НоваяСтрока.Описание     = "Отправляемая ссылка";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьСсылку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬССЫЛКУ";
    НоваяСтрока.Параметр     = "--user";
    НоваяСтрока.ПараметрСокр = "";
    НоваяСтрока.Описание     = "ID пользователя. Для канала > администратора, для бота > получателя";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "ОтправитьСсылку";
    НоваяСтрока.МетодПоиска  = "ОТПРАВИТЬССЫЛКУ";
    НоваяСтрока.Параметр     = "--ischannel";
    НоваяСтрока.ПараметрСокр = "-i";
    НоваяСтрока.Описание     = "Отправка в канал или в чат бота";
    НоваяСтрока.Область      = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "СформироватьКлавиатуруИзМассиваКнопок";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬКЛАВИАТУРУИЗМАССИВАКНОПОК";
    НоваяСтрока.Параметр     = "--buttons";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "Массив кнопок";
    НоваяСтрока.Область      = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Возвращает структура клавиатуры для сообщений
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "viber";
    НоваяСтрока.Модуль       = "OPI_Viber";
    НоваяСтрока.Метод        = "СформироватьКлавиатуруИзМассиваКнопок";
    НоваяСтрока.МетодПоиска  = "СФОРМИРОВАТЬКЛАВИАТУРУИЗМАССИВАКНОПОК";
    НоваяСтрока.Параметр     = "--color";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "HEX цвет кнопок с # в начале (необяз. по ум. - #2db9b9)";
    НоваяСтрока.Область      = "Отправка сообщений";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;

        |

        |
        |OPI_Viber = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_Viber.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
