Функция ПолучитьСостав() Экспорт

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ПроверитьТокен";
    НоваяСтрока.МетодПоиска = "ПРОВЕРИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен бота";
    НоваяСтрока.Область     = "Общие методы";
    НоваяСтрока.ОписаниеМетода   = "Проверяет работоспособность токена бота";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ПолучитьСобытия";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСОБЫТИЯ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен бота";
    НоваяСтрока.Область     = "Общие методы";
    НоваяСтрока.ОписаниеМетода   = "Получает события бота в Polling режиме";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ПолучитьСобытия";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСОБЫТИЯ";
    НоваяСтрока.Параметр    = "--last";
    НоваяСтрока.Описание    = "ID последнего обработанного до этого события";
    НоваяСтрока.Область     = "Общие методы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ПолучитьСобытия";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬСОБЫТИЯ";
    НоваяСтрока.Параметр    = "--timeout";
    НоваяСтрока.Описание    = "Время удержания соединения для Long Polling (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Общие методы";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр    = "--token";
    НоваяСтрока.Описание    = "Токен бота";
    НоваяСтрока.Область     = "Отправка сообщений";
    НоваяСтрока.ОписаниеМетода   = "Отправляет текстовое сообщение в чат
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр    = "--chatid";
    НоваяСтрока.Описание    = "ID чата для отправки сообщения";
    НоваяСтрока.Область     = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр    = "--text";
    НоваяСтрока.Описание    = "Текст сообщения";
    НоваяСтрока.Область     = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр    = "--reply";
    НоваяСтрока.Описание    = "ID цитируемого сообщения, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр    = "--keyboard";
    НоваяСтрока.Описание    = "Кнопки к сообщению, если необходимо (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область     = "Отправка сообщений";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "vkteams";
    НоваяСтрока.Модуль      = "OPI_VKTeams";
    НоваяСтрока.Метод       = "ОтправитьТекстовоеСообщение";
    НоваяСтрока.МетодПоиска = "ОТПРАВИТЬТЕКСТОВОЕСООБЩЕНИЕ";
    НоваяСтрока.Параметр    = "--parsemod";
    НоваяСтрока.Описание    = "Вид разметки для текста сообщения: MarkdownV2 или HTML (необяз. по ум. - MarkdownV2)";
    НоваяСтрока.Область     = "Отправка сообщений";

    Возврат ТаблицаСостава;
КонецФункции

