
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("ПараметрСокр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьСписокМагазинов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКМАГАЗИНОВ";
    НоваяСтрока.Параметр     = "--Key)";
    НоваяСтрока.ПараметрСокр = "-K";
    НоваяСтрока.Описание     = "token";
    НоваяСтрока.Область      = "Кабинеты и магазины";
    НоваяСтрока.ОписаниеМетода   = "Получает список магазинов в кабинете по токену";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьСписокМагазинов";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСПИСОКМАГАЗИНОВ";
    НоваяСтрока.Параметр     = "--page";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Номер страницы выдачи списка (необяз. по ум. - 1)";
    НоваяСтрока.Область      = "Кабинеты и магазины";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьМагазин";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬМАГАЗИН";
    НоваяСтрока.Параметр     = "--Key)";
    НоваяСтрока.ПараметрСокр = "-K";
    НоваяСтрока.Описание     = "token";
    НоваяСтрока.Область      = "Кабинеты и магазины";
    НоваяСтрока.ОписаниеМетода   = "Получает информацию о магазине (кампании) по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьМагазин";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬМАГАЗИН";
    НоваяСтрока.Параметр     = "--campaign";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID магазина (кампании)";
    НоваяСтрока.Область      = "Кабинеты и магазины";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьНастройкиКабинета";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНАСТРОЙКИКАБИНЕТА";
    НоваяСтрока.Параметр     = "--Key)";
    НоваяСтрока.ПараметрСокр = "-K";
    НоваяСтрока.Описание     = "token";
    НоваяСтрока.Область      = "Кабинеты и магазины";
    НоваяСтрока.ОписаниеМетода   = "Получает значения настроек кабинета по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьНастройкиКабинета";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНАСТРОЙКИКАБИНЕТА";
    НоваяСтрока.Параметр     = "--business";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "ID кабинета";
    НоваяСтрока.Область      = "Кабинеты и магазины";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьНастройкиМагазина";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНАСТРОЙКИМАГАЗИНА";
    НоваяСтрока.Параметр     = "--Key)";
    НоваяСтрока.ПараметрСокр = "-K";
    НоваяСтрока.Описание     = "token";
    НоваяСтрока.Область      = "Кабинеты и магазины";
    НоваяСтрока.ОписаниеМетода   = "Получает настройки магазина по ID";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьНастройкиМагазина";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬНАСТРОЙКИМАГАЗИНА";
    НоваяСтрока.Параметр     = "--campaign";
    НоваяСтрока.ПараметрСокр = "-c";
    НоваяСтрока.Описание     = "ID магазина (кампании)";
    НоваяСтрока.Область      = "Кабинеты и магазины";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ДобавитьОбновитьТовары";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬОБНОВИТЬТОВАРЫ";
    НоваяСтрока.Параметр     = "--Key)";
    НоваяСтрока.ПараметрСокр = "-K";
    НоваяСтрока.Описание     = "token";
    НоваяСтрока.Область      = "Работа с товарами";
    НоваяСтрока.ОписаниеМетода   = "Добавляет или обновляет информацию о товарах в каталоге
    |
    |    Пример указания параметра типа массив:
    |    --param ""['Val1','Val2','Val3']""
    |";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ДобавитьОбновитьТовары";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬОБНОВИТЬТОВАРЫ";
    НоваяСтрока.Параметр     = "--business";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "ID кабинета";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ДобавитьОбновитьТовары";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬОБНОВИТЬТОВАРЫ";
    НоваяСтрока.Параметр     = "--offers";
    НоваяСтрока.ПараметрСокр = "-o";
    НоваяСтрока.Описание     = "Массив описаний товаров";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ДобавитьОбновитьТовары";
    НоваяСтрока.МетодПоиска  = "ДОБАВИТЬОБНОВИТЬТОВАРЫ";
    НоваяСтрока.Параметр     = "--pmedia";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Признак использования только своих изображений товаров (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьТоварыМагазина";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОВАРЫМАГАЗИНА";
    НоваяСтрока.Параметр     = "--Key)";
    НоваяСтрока.ПараметрСокр = "-K";
    НоваяСтрока.Описание     = "token";
    НоваяСтрока.Область      = "Работа с товарами";
    НоваяСтрока.ОписаниеМетода   = "Получает список товаров выбранного магазина";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьТоварыМагазина";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОВАРЫМАГАЗИНА";
    НоваяСтрока.Параметр     = "--business";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "ID магазина";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьТоварыМагазина";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОВАРЫМАГАЗИНА";
    НоваяСтрока.Параметр     = "--filters";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Фильтры для отбора товаров (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьТоварыМагазина";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОВАРЫМАГАЗИНА";
    НоваяСтрока.Параметр     = "--page";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Токен следующей страницы при большой выборке (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьТоварыКабинета";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОВАРЫКАБИНЕТА";
    НоваяСтрока.Параметр     = "--Key)";
    НоваяСтрока.ПараметрСокр = "-K";
    НоваяСтрока.Описание     = "token";
    НоваяСтрока.Область      = "Работа с товарами";
    НоваяСтрока.ОписаниеМетода   = "Получает список товаров выбранного кабинета";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьТоварыКабинета";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОВАРЫКАБИНЕТА";
    НоваяСтрока.Параметр     = "--business";
    НоваяСтрока.ПараметрСокр = "-b";
    НоваяСтрока.Описание     = "ID кабинета";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьТоварыКабинета";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОВАРЫКАБИНЕТА";
    НоваяСтрока.Параметр     = "--filters";
    НоваяСтрока.ПараметрСокр = "-f";
    НоваяСтрока.Описание     = "Фильтры для отбора товаров (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьТоварыКабинета";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬТОВАРЫКАБИНЕТА";
    НоваяСтрока.Параметр     = "--page";
    НоваяСтрока.ПараметрСокр = "-p";
    НоваяСтрока.Описание     = "Токен следующей страницы при большой выборке (необяз. по ум. - Пустое значение)";
    НоваяСтрока.Область      = "Работа с товарами";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека   = "yamarket";
    НоваяСтрока.Модуль       = "OPI_YandexMarket";
    НоваяСтрока.Метод        = "ПолучитьСтруктуруТовара";
    НоваяСтрока.МетодПоиска  = "ПОЛУЧИТЬСТРУКТУРУТОВАРА";
    НоваяСтрока.Параметр     = "--empty";
    НоваяСтрока.ПараметрСокр = "-e";
    НоваяСтрока.Описание     = "Истина > структура с пустыми значениями, Ложь > в значениях будут описания полей (необяз. по ум. - False)";
    НоваяСтрока.Область      = "Работа с товарами";
    НоваяСтрока.ОписаниеМетода   = "Получает структуру стандартных полей товара";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        |Контекст = Новый Структура;

        |

        |
        |OPI_YandexMarket = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_YandexMarket.os"", Контекст);
        |" + Символы.ПС;


КонецФункции 
