
Перем ТаблицаСостава;

Функция ПолучитьСостав() Экспорт

    Если ТаблицаСостава <> Неопределено Тогда
        Возврат ТаблицаСостава;
    КонецЕсли;

    ТаблицаСостава = Новый ТаблицаЗначений();
    ТаблицаСостава.Колонки.Добавить("Библиотека");
    ТаблицаСостава.Колонки.Добавить("Модуль");
    ТаблицаСостава.Колонки.Добавить("Метод");
    ТаблицаСостава.Колонки.Добавить("МетодПоиска");
    ТаблицаСостава.Колонки.Добавить("Параметр");
    ТаблицаСостава.Колонки.Добавить("Описание");
    ТаблицаСостава.Колонки.Добавить("ОписаниеМетода");
    ТаблицаСостава.Колонки.Добавить("Область");

    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "yandex";
    НоваяСтрока.Модуль      = "OPI_YandexID";
    НоваяСтрока.Метод       = "ПолучитьКодПодтверждения";
    НоваяСтрока.МетодПоиска = "ПОЛУЧИТЬКОДПОДТВЕРЖДЕНИЯ";
    НоваяСтрока.Параметр    = "--id";
    НоваяСтрока.Описание    = "Client id";
    НоваяСтрока.Область     = "Программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Получает код подтверждения и адрес страницы, на которой его необходимо ввести";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "yandex";
    НоваяСтрока.Модуль      = "OPI_YandexID";
    НоваяСтрока.Метод       = "ПреобразоватьКодВТокен";
    НоваяСтрока.МетодПоиска = "ПРЕОБРАЗОВАТЬКОДВТОКЕН";
    НоваяСтрока.Параметр    = "--id";
    НоваяСтрока.Описание    = "Client id";
    НоваяСтрока.Область     = "Программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Преобразовывает код в токен после ввода кода при выполнении ПолучитьКодПодтверждения";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "yandex";
    НоваяСтрока.Модуль      = "OPI_YandexID";
    НоваяСтрока.Метод       = "ПреобразоватьКодВТокен";
    НоваяСтрока.МетодПоиска = "ПРЕОБРАЗОВАТЬКОДВТОКЕН";
    НоваяСтрока.Параметр    = "--secret";
    НоваяСтрока.Описание    = "Client secret";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "yandex";
    НоваяСтрока.Модуль      = "OPI_YandexID";
    НоваяСтрока.Метод       = "ПреобразоватьКодВТокен";
    НоваяСтрока.МетодПоиска = "ПРЕОБРАЗОВАТЬКОДВТОКЕН";
    НоваяСтрока.Параметр    = "--device";
    НоваяСтрока.Описание    = "device_code из ПолучитьКодПодтверждения()";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "yandex";
    НоваяСтрока.Модуль      = "OPI_YandexID";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--id";
    НоваяСтрока.Описание    = "Client id";
    НоваяСтрока.Область     = "Программный интерфейс";
    НоваяСтрока.ОписаниеМетода   = "Обновляет токен по Refresh token";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "yandex";
    НоваяСтрока.Модуль      = "OPI_YandexID";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--secret";
    НоваяСтрока.Описание    = "Client secret";
    НоваяСтрока.Область     = "Программный интерфейс";


    НоваяСтрока = ТаблицаСостава.Добавить();
    НоваяСтрока.Библиотека  = "yandex";
    НоваяСтрока.Модуль      = "OPI_YandexID";
    НоваяСтрока.Метод       = "ОбновитьТокен";
    НоваяСтрока.МетодПоиска = "ОБНОВИТЬТОКЕН";
    НоваяСтрока.Параметр    = "--refresh";
    НоваяСтрока.Описание    = "Refresh token";
    НоваяСтрока.Область     = "Программный интерфейс";

    Возврат ТаблицаСостава;
КонецФункции


Функция ПолучитьСтрокуПодключения() Экспорт


    Возврат "
        | Контекст = Новый Структура;
        | Контекст.Вставить(""OPI_YandexID"", Неопределено);
        | Контекст.Вставить(""OPI_ЗапросыHTTP"", Неопределено);
        | Контекст.Вставить(""OPI_ПреобразованиеТипов"", Неопределено);
        | Контекст.Вставить(""OPI_Инструменты"", Неопределено);
        | Контекст.Вставить(""OPI_HTTPКлиент"", Неопределено);
        | Контекст.Вставить(""OPI_Криптография"", Неопределено);
        | Контекст.Вставить(""OPI_Компоненты"", Неопределено);
        | 
        | OPI_YandexID = ЗагрузитьСценарий(""%1/oint/core/Modules/OPI_YandexID.os"", Контекст);
        | Контекст.Вставить(""OPI_YandexID"", OPI_YandexID);
        | OPI_ЗапросыHTTP = ЗагрузитьСценарий(""%1/oint/tools/Modules/OPI_ЗапросыHTTP.os"", Контекст);
        | Контекст.Вставить(""OPI_ЗапросыHTTP"", OPI_ЗапросыHTTP);
        | OPI_ПреобразованиеТипов = ЗагрузитьСценарий(""%1/oint/tools/Modules/OPI_ПреобразованиеТипов.os"", Контекст);
        | Контекст.Вставить(""OPI_ПреобразованиеТипов"", OPI_ПреобразованиеТипов);
        | OPI_Инструменты = ЗагрузитьСценарий(""%1/oint/tools/Modules/internal/Modules/OPI_Инструменты.os"", Контекст);
        | Контекст.Вставить(""OPI_Инструменты"", OPI_Инструменты);
        | OPI_HTTPКлиент = ЗагрузитьСценарий(""%1/oint/tools/Modules/internal/Classes/OPI_HTTPКлиент.os"", Контекст);
        | Контекст.Вставить(""OPI_HTTPКлиент"", OPI_HTTPКлиент);
        | OPI_Криптография = ЗагрузитьСценарий(""%1/oint/tools/Modules/internal/Modules/OPI_Криптография.os"", Контекст);
        | Контекст.Вставить(""OPI_Криптография"", OPI_Криптография);
        | OPI_Компоненты = ЗагрузитьСценарий(""%1/oint/tools/Modules/OPI_Компоненты.os"", Контекст);
        | Контекст.Вставить(""OPI_Компоненты"", OPI_Компоненты);
        |" + Символы.ПС;


КонецФункции 
