Процедура ОбработатьМеню(Контекст, Проект) Экспорт
	
	МассивПунктов = Новый Массив;
	МассивПунктов.Добавить(ПолучитьПункт("Обработчик1", "/ui/handler?id=1"));
	МассивПунктов.Добавить(ПолучитьПункт("Обработчик2", "/ui/handler?id=2"));
	МассивПунктов.Добавить(ПолучитьПункт("Обработчик3", "/ui/handler?id=3"));

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(ПолучитьПодменю("Обработчики", МассивПунктов));

	Основа = ПолучитьОснову(МассивЭлементов);

	Контекст.Ответ.Записать(Основа);

КонецПроцедуры

Функция ПолучитьОснову(МассивЭлементов)

	Шаблон = "
	|<aside class=""menu"">
	|	%1
	|   <div class=""button-container"">
    |       <a href=""#"" id=""new"" hx-get=""/ui/handler?id=new"" hx-target=""#main-content"" hx-swap=""innerHTML"" class=""button is-primary is-fullwidth"">Новый элемент</a>
    |   </div>
	|	<div class=""resizer""></div>
	|</aside>";

	Возврат СтрШаблон(Шаблон, СтрСоединить(МассивЭлементов, Символы.ПС));

КонецФункции

Функция ПолучитьПодменю(Заголовок, МассивЭлементов)

	Шаблон = "<ul class=""menu-list"">
	|	<p class=""menu-label"">
    |   	%1
    |	</p>
	|	%2
	|</ul>";

	Возврат СтрШаблон(Шаблон, Заголовок, СтрСоединить(МассивЭлементов, Символы.ПС));

КонецФункции

Функция ПолучитьПункт(Текст, Ссылка)

	Шаблон = "<li><a href=""#"" hx-get=""%1"" hx-target=""#main-content"" hx-swap=""innerHTML"">%2</a></li>";
	Возврат СтрШаблон(Шаблон, Ссылка, Текст);

КонецФункции