#Область ПрограммныйИнтерфейс

#Область РаботаСоСтраницами

// Создать дочернюю страницу
// 
// Параметры:
//  Токен - Строка - Токен
//  Заголовок - Строка - Заголовок страницы
//  Родитель - Строка - ID Родителя
//  РодительБаза - Булево - Истина, если родитель - база, Ложь - если страница
// 
// Возвращаемое значение:
//  Строка, Произвольный, HTTPОтвет, ДвоичныеДанные, Неопределено - Ответ сервера Notion
Функция СоздатьСтраницу(Знач Токен, Знач Заголовок, Знач Родитель, Знач РодительБаза = Ложь) Экспорт
    
    Заголовки = СоздатьЗаголовкиЗапроса(Токен);
    Родитель  = ИдентификацияРодителя(Родитель, РодительБаза);    
    Свойства  = Новый Структура;
    
    ДобавитьЗаголовокСтраницы(Заголовок, Свойства);
    
    Параметры = Новый Структура;
    Параметры.Вставить("parent"    , Родитель);
    Параметры.Вставить("properties", Свойства);
    
    Ответ = OPI_Инструменты.Post("https://api.notion.com/v1/pages", Параметры, Заголовки);
    
    Возврат Ответ;
    
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЗаголовкиЗапроса(Знач Токен)
    
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Authorization" , "Bearer " + Токен);
    Заголовки.Вставить("Notion-Version", "2022-06-28");
    
    Возврат Заголовки;
        
КонецФункции

Процедура ПреобразоватьИД(Идентификатор)
    
    Если СтрНайти(Идентификатор, "-" = 0) Тогда
        
        МассивЧастей = Новый Массив;
        МассивЧастей.Добавить(Лев(Идентификатор  , 8));
        МассивЧастей.Добавить(Сред(Идентификатор , 9 , 4));
        МассивЧастей.Добавить(Сред(Идентификатор , 12, 4));
        МассивЧастей.Добавить(Сред(Идентификатор , 15, 4));
        МассивЧастей.Добавить(Прав(Идентификатор , 12));
        
        Идентификатор = СтрСоединить(МассивЧастей, "-");
        
    КонецЕсли
    
КонецПроцедуры

Функция ИдентификацияРодителя(Знач Родитель, Знач РодительБаза)
  
  ПреобразоватьИД(Родитель);
  
  ПолеИдентификатора = ?(РодительБаза, "database_id", "page_id");
  СтруктураРодителя  = Новый Структура(ПолеИдентификатора, Родитель);
 
  Возврат СтруктураРодителя;
     
КонецФункции

Процедура ДобавитьЗаголовокСтраницы(Знач Заголовок, ОсновнаяСтруктура) 
    
    ПодчиненнаяСтруктура = Новый Структура;
    СтруктураДанных      = Новый Структура;
    СтруктураТекста      = Новый Структура;
    МассивДанных         = Новый Массив;
    
    СтруктураТекста.Вставить("content", Заголовок);
    СтруктураТекста.Вставить("link"   , Неопределено);
    
    СтруктураДанных.Вставить("text", СтруктураТекста);
    СтруктураДанных.Вставить("type", "text");
    
    МассивДанных.Добавить(СтруктураДанных);
    
    ПодчиненнаяСтруктура.Вставить("id"   , "title");
    ПодчиненнаяСтруктура.Вставить("type" , "title");
    ПодчиненнаяСтруктура.Вставить("title", МассивДанных);
    
    ОсновнаяСтруктура.Вставить("title", ПодчиненнаяСтруктура);
    
КонецПроцедуры

#КонецОбласти